{
    "name": "Biology",
    "mission_statement": "Our Biology program provides pre-professional education and training for students of health sciences. As a student at Niagara University, you’ll gain access to state-of-the-art labs, conduct research alongside faculty while receiving personal guidance, and gain working experience through internships and volunteer opportunities.\n\nWe will guide you with an integrated and contemporary knowledge of biology, preparing you to pursue careers in research and industry, or continue your studies with advanced education. Qualified pre-professional students seeking entry to medical school can apply for the University at Buffalo Medical School’s Early Assurance Program. NU also has coordinated programs with the Lake Erie College of Osteopathic Medicine, University at Buffalo Dental School, and the School of Pharmacy for 3+4 programs.",
    "office": null,
    "course_listing_url": null,
    "course_descriptions_url": "https://catalog.niagara.edu/undergraduate/courses-az/bio/",
    "courses": [
        {
            "number": "121",
            "title": "122 and includes an investigative approach to the study of all living organisms",
            "description": "BIO 124L —Gen Biology Lab IIPrerequisite Take BIO*122This laboratory is designed to be taken concurrently with BIO 121-122 and includes an investigative approach to the study of all living organisms.BIO 189 —Prehealth Career StudiesThis is a course designed to introduce students early in their studies to the health care careers. Individual off-campus health sciences experiences sponsored by appropriate organizations, companies and private practitioners provide unpaid internships with a minimum of 60 hours of student service. Biology department chair permission required.BIO 198 —Introduction to Scientific ResearchThis course is designed to introduce students to the principles of scientific research, analyzing primary literature, ethics in research, science communication, and career development.BIO 199 —Intro to Scientific Research IIThis course is designed to allow first-year students the opportunity to rotate through scientific research labs in preparation for long-term faculty-student research collaborations.BIO 201 —Global HealthPrerequisite Take BIO*106Public health issues often transcend traditional boundaries and are rapidly changing in response to technological change and globalization. This course will focus on applying public health principles in both developed and developing countries to understand the links between health and economic and social development.BIO 202 —The History of Modern SciencePrerequisite Take BIO*121, BIO*123L, BIO*122, and BIO*124LThis course surveys the history of modern science, beginning with the Copernican  model of the universe. It will cover the evolution of scientific theories and the scientists responsible for the major discoveries in Astronomy, Physics, Chemistry, Biology, and Geology.BIO 204 —EcologyPrerequisite Take BIO*121, BIO*123L, BIO*122, and BIO*124LA course relating ecological principles to studies in the laboratory and field. Topics include population dynamics, energy flow in ecosystems, and species interactions.BIO 205L —Ecology LaboratoryPrerequisite Take BIO*204A course relating ecological principles to studies in the laboratory and field. Topics include population dynamics, energy flow in ecosystems, and species interactions.BIO 210 —BotanyPrerequisite Take BIO*121, BIO*122, BIO*123L, and BIO*124LA study of the basic principles of botany, and a survey of the plant kingdom with emphasis on the morphology and physiology of higher plants.BIO 212 —MicrobiologyPrerequisite TakeBIO 213LconcurrentlyA study of the basic principles of microbiology involving pathogenic and nonpathogenic organisms and their relation to medicine, sanitation, agriculture, and industry. Laboratory study is concerned with the morphology and physiology of microorganisms, and with their application in identification.BIO 213L —Microbiology LabPrerequisite Take BIO*212Laboratory study concerned with the morphology and physiology of microorganisms, and with their application in identification.BIO 215 —General PathophysiologyPrerequisite Must have taken NUR*354;This course is designed to correlate basic knowledge of normal physiology with dysfunction of body mechanisms. The student will gain a basic understanding of the processes of disease through study of causative mechanisms and the signs and symptoms which reflect disease.BIO 221 —EvolutionPrerequisite Take BIO*121, BIO*122, BIO*123L, AND BIO*124LNothing in biology makes sense except in the light of evolution. This course covers the diversity of life on earth and the ongoing evolutionary processes that affect all biology from the ecosystem to the hospital. Topics include natural selection, speciation, diversity on earth, molecular processes and primate evolution. Cross-listed asENV 221.BIO 222 —BioinformaticsPrerequisite take BIO*121, BIO*122, BIO*123L, and BIO*124LBioinformatics is the study of biological phenomena and the data generated from such studies with the assistance of computers. Bioinformatics relies on computers for the acquisition, storage, analysis, manipulation, management and dissemination of biological information. This is an introductory course to the problems and promise in this field.BIO 231 —Anatomy & Physiology IPrerequisite TakeBIO 233LA unified study of the structure and function of the human body. The course will survey the anatomy and physiology of the major types of human cells, tissues, organs and organ systems. An understanding of the human body as a self-regulated, dynamic community of interrelated living parts will be emphasized. Designed to be taken sequentially. Must be taken concurrently with laboratory.BIO 232 —Anatomy & Physiology IIPrerequisite Take BIO*234LA unified study of the structure and function of the human body. The course will survey the anatomy and physiology of the major types of human cells, tissues, organs and organ systems. An understanding of the human body as a self-regulated, dynamic community of interrelated living parts will be emphasized. Designed to be taken sequentially. Must be taken concurrently with laboratory.BIO 233L —Anatomy & Physiology Lab IPrerequisite Take BIO*231The laboratory involves a series of student-performed exercises designed to illustrate, by observation and experimentation, the major concepts of human anatomy and physiology. Designed to be taken sequentially. Must be taken concurrently with lecture.BIO 234L —Anatomy & Physiology Lab IIPrerequisite Take BIO*232The laboratory involves a series of student-performed exercises designed to illustrate, by observation and experimentation, the major concepts of human anatomy and physiology. Designed to be taken sequentially. Must be taken concurrently with lecture.BIO 237 —Comparative Anatomy TutorialPrerequisite Take BIO*121 and BIO*123LIn the true sense of a tutorial, the instructor provides individual attention to a small group of students in the art of dissecting a cat. The anatomy dissection is accompanied by lecture on the underlying physiology and comparisons to human anatomy and physiology.BIO 246 —Genetics IPrerequisite Must have taken BIO*121, BIO*122, BIO*123L and BIO*124L;A study of Mendelian genetics and the molecular biology of the gene. Basic principles of genetics, as they apply in plants and animals, are studied in the laboratory with special emphasis on Drosophilia. - four semester hoursBIO 298 —Fellowship ResearchStudent-faculty collaborative research for fellowship students.BIO 299 —Fellowship Research IIPrerequisite Take BIO*298BIO 302 —Nature StudyThis course fosters a personal, hands-on approach to understanding the natural world. It is designed to help the student become a better observer, communicator, and educator in the field of nature study. The laboratory provides opportunities to visit nature sites, conduct field studies, plan and implement educational projects, and learn from accomplished naturalists and educators. The course may include a service learning component.BIO 304 —Field Ecology & LabA course in the ecology of local plants and their habitats, designed for the student with minimal experience in ecology. By learning basic plant structure and terminology, and the interactions between plants and the environment, the student will learn the ecology of plants in a natural setting. Course activities include field trips to areas of interest and laboratory experiments.BIO 310 —Medical BotanyA survey of plants with physiologically active properties of medicinal interest. Emphasis is placed on the biology, folk uses, ethnobotany, and natural history of useful angiosperms.BIO 312 —Conservation EcologyPrerequisite Take BIO*204 and BIO*205LThe practice and theory of conservation ecology. Current and future threats to populations and ecosystems, methods of protection, and the methods used to assess conservation efforts will be covered. Case studies include restoration, extinction, and wildlife management. Students will apply conservation ecology methods to real world threatened populations. Cross-listed asENV 312.BIO 315 —PharmacologyPrerequisite Take BIO*121, BIO*122, CHE*111, CHE*112, and BIO*334The course is designed to introduce one to the study of the interaction of chemicals with living organisms. Pharmacology encompasses the disciplines of organic chemistry, physiology, pathology, biochemistry, and molecular biology, and as such we will investigate drug action at several levels: whole body, organ, tissue, cell, and molecular. We will discuss the intricacies of the various classes of drugs, and discuss the factors that are used to assess the safety and efficacy of a drug.BIO 316 —Virology/ImmunologyPrerequisite Take BIO*121, BIO*122, BIO*123L, and BIO*124LThe course material covers two areas of medical importance: virology, some of the predominant disease-causing agents; and immunology, our body's major defense mechanisms against disease. Topics to be covered include the history, biology, molecular structure, and evolutionary significance of the components of these two systems. The recent findings in the fields will be highlighted, as they pertain to our understanding of disease.BIO 334 —Cell BiologyPrerequisite Take BIO*121, BIO*122, BIO*123L, and BIO*124LA study of the cell with emphasis on the molecular aspects of cell structure and function. Biochemical processes are emphasized.BIO 337 —Intro to OncologyPrerequisite Take BIO*121, BIO*122, BIO*123L, and BIO*124LThe course encompasses the basic biology and clinical aspects of cancer. Topics to be covered include the history of oncology, basic cancer biology, and current concepts relative to the cause, prevention, detection, and treatment of benign and malignant neoplasias.BIO 338 —Cell PhysiologyPrerequisite Take BIO*334A contemporary perspective on cell function drawing upon recent findings in physiology, biochemistry, biophysics, and molecular biology. The course will highlight the cellular processes that occur outside the nucleus . Emphasis will be placed on learning quantitative approaches to solving problems in cell physiology.BIO 345 —Experimental Design & Analysis With LabPrerequisite Take BIO*121, and BIO*122Mathematics is a fundamental component of Biology. In this course, experimental design, statistics, and simple modeling are presented from a biological perspective, in preparation for thesis and post-baccalaureate research, and for preparation for employment in Biology.BIO 347 —GeneticsPrerequisite Must have takenBIO 121andBIO 122This course expands on the concepts of heredity, with emphasis placed on the genetics of both prokaryotic and eukaryotic microorganisms. Classical genetic analysis, non-Mendelian inheritance, molecular mechanism of genetic change, and human genetics will be covered.BIO 348L —Genetics LaboratoryPrerequisite Take BIO*347BIO 352 —Microscopic Anatomy & LabPrerequisite Take BIO*121, BIO*122, BIO*123L, and BIO*124LA study of the cells and tissues, and their involvement in organ structure. Cytological and histological slides are prepared and studied in the laboratory.BIO 360 —PathophysiologyPrerequisite TakeBIO 231,BIO 232,BIO 233LandBIO 234LThis course is designed to correlate basic knowledge of normal physiology with dysfunction of body mechanisms. The student will gain a basic understanding of the processes of disease through study of causative mechanisms and the signs and symptoms which reflect disease.BIO 361L —Pathophysiology LaboratoryPrerequisite Take BIO*231, and BIO*232This course is designed to correlate basic knowledge of normal physiology with dysfunction of body mechanisms. The student will gain a basic understanding of the processes of disease through study of causative mechanisms and the signs and symptoms which reflect disease.BIO 373 —AstrobiologyPrerequisite Take BIO*121, BIO*122, BIO*123L, and BIO*124LAstrobiology is the study of life as a planetary phenomenon. This course will explore life's origin, history, and evolution on Earth, and the potential for life elsewhere in the universe. It will examine the requirements and limits of life, from elemental to galactic, drawing from biology, geology, physics, and chemistry.BIO 380 —Genomics & ProteomicsPrerequisite Take BIO*121, BIO*122, BIO*123L, BIO*124L, and BIO*222Genomics and Proteomics is the detailed study of technologies and methodologies for evaluation of genomic and protein functions. These methods are used to interpret biological regulation of DNA sequences, the RNAs that are copied from them, and the proteins that are synthesized from these RNAs. The application of these technologies to problems in biology ranging from organism development to human diseases will be discussed.BIO 385 —Topic:Prerequisite Take BIO*121, BIO*122, BIO*123L, and BIO*124LThis special topics course provides students with opportunities to study current topics in the biological sciences. Biology is a rapidly changing field and thus many current issues are unable to be fully addressed in traditional course offerings. This includes topics in environmental science, bioinformatics and other evolving fields. Students may repeat the course two additional times as the topic changes.BIO 391 —Bio-Analy Tech & Lab IPrerequisite Take BIO*121, BIO*122, BIO*123L, BIO*124L, and BIO*334Lectures and laboratories will emphasize contemporary bioanalytical and biological research at the cell and molecular levels.BIO 391will stress methods employed in studies of cell physiology.BIO 392will emphasize DNA methods of gene recombination in prokaryotic and eukaryotic systems. Theoretical and practical competence will be developed in all techniques.BIO 392 —Bio-Analy Tech & Lab IIPrerequisite Take BIO*121, BIO*122, BIO*123L, BIO*124L, and BIO*334Lectures and laboratories will emphasize contemporary bioanalytical and biological research at the cell and molecular levels.BIO 391will stress methods employed in studies of cell physiology.BIO 392will emphasize DNA methods of gene recombination in prokaryotic and eukaryotic systems. Theoretical and practical competence will be developed in all techniques.BIO 401 —Biology SeminarRequired of all B.S. and B.A. biology majors beginning with students entering their senior year. The goal is to assure the readiness of students for job placement, and/or entrance into professional or graduate school by assessing the students knowledge and understanding of the field and their writing and speaking skills.BIO 402 —Biology SeminarPrerequisite TakeBIO 401Required of all B.S. and B.A. biology majors beginning with students entering senior year. The presentation of a research seminar and an in depth research literature review will be done to asses the students knowledge and understanding of the field and their writing and speaking skills.BIO 403 —Honors Thesis IIndividual research of a substantive nature pursued in the students major field of study. The research will conclude in a written thesis on an original project, and an oral defense.BIO 404 —Honors Thesis IIIndividual research of a substantive nature pursued in the students major field of study. The research will conclude in a written thesis on an original project, and an oral defense.BIO 410 —Projects in Public HealthPrerequisite Take BIO*106 and BIO*107This service learning and seminar course requires the student to apply public health concepts to his/her major area of study by working with a community partner on a project in a relevant area of public health. Students will meet weekly to discuss their projects.BIO 422 —Bioinformatics IIPrerequisite Take BIO*222The field of bioinformatics has developed as a result of the integration of information and approaches from a number of disciplines. This is an advanced course where on will be introduced to the challenges and projected outcomes of the field. It is expected that students entering this course are familiar with biological and computational techniques, as they will be used as the foundation for the laboratory portion of the course.BIO 427 —Environmental Microbio & LabPrerequisite Take BIO*212 and BIO*213LBIO 432 —Development & LabPrerequisite Take BIO*334To provide a modern view of developmental biology unifying the approaches of cell biology, biochemistry, molecular biology, and genetics. This course is designed for students who have had one year of introductory biology, and one semester of cell biology. The communication of biological concepts, ideas, and experimentation, in verbal and written form, is an integral component of this course. The laboratory emphasizes molecular aspects of development.BIO 435 —Plant PhysiologyPrerequisite Take BIO*121, BIO*122, BIO*123L, BIO*124L, and BIO*210This course deals with plant physiology at an organismal level and with the physiological ecology or interactions of plants with their environment. The unique features of plant photosynthesis, water relations and metabolic processes will be studied in a variety of taxa and settings. Laboratory will include field trips to local areas of interest and experiments in the laboratory.BIO 435L —Plant Physiology LabPrerequisite Take BIO*121, BIO*122, BIO*123L, and BIO*124LLaboratory will include field trips to local areas of interest and experiments in the laboratory.BIO 436 —Human GeneticsPrerequisite Take BIO*334The role of molecular regulatory mechanisms as they pertain to the structure and function of genes in eukaryotic systems, the evolution of genomes and molecular techniques are emphasized.BIO 437L —Medical Genetics LabPrerequisite Take BIO*436The bioinformatics component of Medical Genetics . A semester-long research project will be used to teach students how to use DNA sequence analysis to determine evolutionary relationships or explore the genetics of human disease. Research projects will vary depending upon the expertise and interest of the instructor.BIO 441 —Comp Animal Phys & LabPrerequisite Take BIO*121, BIO*122, BIO*123L, BIO*124L, and BIO*334An advanced course in physiology intended to provide in-depth coverage of functions of selected cells, tissues, organs, and organ systems. Laboratory will feature experiments using appropriate animal model systems.BIO 445 —LimnologyPrerequisite Take BIO*121. BIO*122, BIO*204, and BIO*205LThis course provides students with an introduction to limnology, emphasizing the physical, chemical and biological function of north temperate lakes and streams. Lecture topics include the physics and chemistry of continental waters, the major biotic communities, interactions among these communities, and interactions between humans and the aquatic environment. Laboratory exercises and field trips provide a practical introduction to the methods of aquatic sciences.BIO 488 —Internship in Environmental ScienceTraining and professional experience in the environment. Interns perform service training, keep a written journal, and write a personal career evaluation based on the internship experience. Department chair permission required.BIO 489 —Health Studies InternshipThe health studies internship is an immersive hands-on experience in a particular aspect of health care. Individuals must perform a minimum of 60 hours of structured, closely monitored training, maintain a written journal, and write a personal career evaluation based on the experience. Biology department chair permission required.BIO 497 —Independent Study Upper class status - junior or senior.  A 3.0 GPA in the major.  The acceptance of his/her proposed work by a department faculty member.  Completed work on the project by the end of one semester - written report.BIO 498 —Independent Study Upper class status - junior or senior.  A 3.0 GPA in the major.  The acceptance of his/her proposed work by a department faculty member.  Completed work on the project by the end of one semester - written report.BIO 499 —Independent Study A 3.0 GPA in the major.  The acceptance of his/her proposed work by a department faculty member.  Completed work on the project by the end of one semester - written report.",
            "instructors": [],
            "textbooks": [],
            "zoom_link": null
        },
        {
            "number": "121",
            "title": "122 and includes an investigative approach to the study of all living organisms",
            "description": "BIO 124L —Gen Biology Lab IIPrerequisite Take BIO*122This laboratory is designed to be taken concurrently with BIO 121-122 and includes an investigative approach to the study of all living organisms.BIO 189 —Prehealth Career StudiesThis is a course designed to introduce students early in their studies to the health care careers. Individual off-campus health sciences experiences sponsored by appropriate organizations, companies and private practitioners provide unpaid internships with a minimum of 60 hours of student service. Biology department chair permission required.BIO 198 —Introduction to Scientific ResearchThis course is designed to introduce students to the principles of scientific research, analyzing primary literature, ethics in research, science communication, and career development.BIO 199 —Intro to Scientific Research IIThis course is designed to allow first-year students the opportunity to rotate through scientific research labs in preparation for long-term faculty-student research collaborations.BIO 201 —Global HealthPrerequisite Take BIO*106Public health issues often transcend traditional boundaries and are rapidly changing in response to technological change and globalization. This course will focus on applying public health principles in both developed and developing countries to understand the links between health and economic and social development.BIO 202 —The History of Modern SciencePrerequisite Take BIO*121, BIO*123L, BIO*122, and BIO*124LThis course surveys the history of modern science, beginning with the Copernican  model of the universe. It will cover the evolution of scientific theories and the scientists responsible for the major discoveries in Astronomy, Physics, Chemistry, Biology, and Geology.BIO 204 —EcologyPrerequisite Take BIO*121, BIO*123L, BIO*122, and BIO*124LA course relating ecological principles to studies in the laboratory and field. Topics include population dynamics, energy flow in ecosystems, and species interactions.BIO 205L —Ecology LaboratoryPrerequisite Take BIO*204A course relating ecological principles to studies in the laboratory and field. Topics include population dynamics, energy flow in ecosystems, and species interactions.BIO 210 —BotanyPrerequisite Take BIO*121, BIO*122, BIO*123L, and BIO*124LA study of the basic principles of botany, and a survey of the plant kingdom with emphasis on the morphology and physiology of higher plants.BIO 212 —MicrobiologyPrerequisite TakeBIO 213LconcurrentlyA study of the basic principles of microbiology involving pathogenic and nonpathogenic organisms and their relation to medicine, sanitation, agriculture, and industry. Laboratory study is concerned with the morphology and physiology of microorganisms, and with their application in identification.BIO 213L —Microbiology LabPrerequisite Take BIO*212Laboratory study concerned with the morphology and physiology of microorganisms, and with their application in identification.BIO 215 —General PathophysiologyPrerequisite Must have taken NUR*354;This course is designed to correlate basic knowledge of normal physiology with dysfunction of body mechanisms. The student will gain a basic understanding of the processes of disease through study of causative mechanisms and the signs and symptoms which reflect disease.BIO 221 —EvolutionPrerequisite Take BIO*121, BIO*122, BIO*123L, AND BIO*124LNothing in biology makes sense except in the light of evolution. This course covers the diversity of life on earth and the ongoing evolutionary processes that affect all biology from the ecosystem to the hospital. Topics include natural selection, speciation, diversity on earth, molecular processes and primate evolution. Cross-listed asENV 221.BIO 222 —BioinformaticsPrerequisite take BIO*121, BIO*122, BIO*123L, and BIO*124LBioinformatics is the study of biological phenomena and the data generated from such studies with the assistance of computers. Bioinformatics relies on computers for the acquisition, storage, analysis, manipulation, management and dissemination of biological information. This is an introductory course to the problems and promise in this field.BIO 231 —Anatomy & Physiology IPrerequisite TakeBIO 233LA unified study of the structure and function of the human body. The course will survey the anatomy and physiology of the major types of human cells, tissues, organs and organ systems. An understanding of the human body as a self-regulated, dynamic community of interrelated living parts will be emphasized. Designed to be taken sequentially. Must be taken concurrently with laboratory.BIO 232 —Anatomy & Physiology IIPrerequisite Take BIO*234LA unified study of the structure and function of the human body. The course will survey the anatomy and physiology of the major types of human cells, tissues, organs and organ systems. An understanding of the human body as a self-regulated, dynamic community of interrelated living parts will be emphasized. Designed to be taken sequentially. Must be taken concurrently with laboratory.BIO 233L —Anatomy & Physiology Lab IPrerequisite Take BIO*231The laboratory involves a series of student-performed exercises designed to illustrate, by observation and experimentation, the major concepts of human anatomy and physiology. Designed to be taken sequentially. Must be taken concurrently with lecture.BIO 234L —Anatomy & Physiology Lab IIPrerequisite Take BIO*232The laboratory involves a series of student-performed exercises designed to illustrate, by observation and experimentation, the major concepts of human anatomy and physiology. Designed to be taken sequentially. Must be taken concurrently with lecture.BIO 237 —Comparative Anatomy TutorialPrerequisite Take BIO*121 and BIO*123LIn the true sense of a tutorial, the instructor provides individual attention to a small group of students in the art of dissecting a cat. The anatomy dissection is accompanied by lecture on the underlying physiology and comparisons to human anatomy and physiology.BIO 246 —Genetics IPrerequisite Must have taken BIO*121, BIO*122, BIO*123L and BIO*124L;A study of Mendelian genetics and the molecular biology of the gene. Basic principles of genetics, as they apply in plants and animals, are studied in the laboratory with special emphasis on Drosophilia. - four semester hoursBIO 298 —Fellowship ResearchStudent-faculty collaborative research for fellowship students.BIO 299 —Fellowship Research IIPrerequisite Take BIO*298BIO 302 —Nature StudyThis course fosters a personal, hands-on approach to understanding the natural world. It is designed to help the student become a better observer, communicator, and educator in the field of nature study. The laboratory provides opportunities to visit nature sites, conduct field studies, plan and implement educational projects, and learn from accomplished naturalists and educators. The course may include a service learning component.BIO 304 —Field Ecology & LabA course in the ecology of local plants and their habitats, designed for the student with minimal experience in ecology. By learning basic plant structure and terminology, and the interactions between plants and the environment, the student will learn the ecology of plants in a natural setting. Course activities include field trips to areas of interest and laboratory experiments.BIO 310 —Medical BotanyA survey of plants with physiologically active properties of medicinal interest. Emphasis is placed on the biology, folk uses, ethnobotany, and natural history of useful angiosperms.BIO 312 —Conservation EcologyPrerequisite Take BIO*204 and BIO*205LThe practice and theory of conservation ecology. Current and future threats to populations and ecosystems, methods of protection, and the methods used to assess conservation efforts will be covered. Case studies include restoration, extinction, and wildlife management. Students will apply conservation ecology methods to real world threatened populations. Cross-listed asENV 312.BIO 315 —PharmacologyPrerequisite Take BIO*121, BIO*122, CHE*111, CHE*112, and BIO*334The course is designed to introduce one to the study of the interaction of chemicals with living organisms. Pharmacology encompasses the disciplines of organic chemistry, physiology, pathology, biochemistry, and molecular biology, and as such we will investigate drug action at several levels: whole body, organ, tissue, cell, and molecular. We will discuss the intricacies of the various classes of drugs, and discuss the factors that are used to assess the safety and efficacy of a drug.BIO 316 —Virology/ImmunologyPrerequisite Take BIO*121, BIO*122, BIO*123L, and BIO*124LThe course material covers two areas of medical importance: virology, some of the predominant disease-causing agents; and immunology, our body's major defense mechanisms against disease. Topics to be covered include the history, biology, molecular structure, and evolutionary significance of the components of these two systems. The recent findings in the fields will be highlighted, as they pertain to our understanding of disease.BIO 334 —Cell BiologyPrerequisite Take BIO*121, BIO*122, BIO*123L, and BIO*124LA study of the cell with emphasis on the molecular aspects of cell structure and function. Biochemical processes are emphasized.BIO 337 —Intro to OncologyPrerequisite Take BIO*121, BIO*122, BIO*123L, and BIO*124LThe course encompasses the basic biology and clinical aspects of cancer. Topics to be covered include the history of oncology, basic cancer biology, and current concepts relative to the cause, prevention, detection, and treatment of benign and malignant neoplasias.BIO 338 —Cell PhysiologyPrerequisite Take BIO*334A contemporary perspective on cell function drawing upon recent findings in physiology, biochemistry, biophysics, and molecular biology. The course will highlight the cellular processes that occur outside the nucleus . Emphasis will be placed on learning quantitative approaches to solving problems in cell physiology.BIO 345 —Experimental Design & Analysis With LabPrerequisite Take BIO*121, and BIO*122Mathematics is a fundamental component of Biology. In this course, experimental design, statistics, and simple modeling are presented from a biological perspective, in preparation for thesis and post-baccalaureate research, and for preparation for employment in Biology.BIO 347 —GeneticsPrerequisite Must have takenBIO 121andBIO 122This course expands on the concepts of heredity, with emphasis placed on the genetics of both prokaryotic and eukaryotic microorganisms. Classical genetic analysis, non-Mendelian inheritance, molecular mechanism of genetic change, and human genetics will be covered.BIO 348L —Genetics LaboratoryPrerequisite Take BIO*347BIO 352 —Microscopic Anatomy & LabPrerequisite Take BIO*121, BIO*122, BIO*123L, and BIO*124LA study of the cells and tissues, and their involvement in organ structure. Cytological and histological slides are prepared and studied in the laboratory.BIO 360 —PathophysiologyPrerequisite TakeBIO 231,BIO 232,BIO 233LandBIO 234LThis course is designed to correlate basic knowledge of normal physiology with dysfunction of body mechanisms. The student will gain a basic understanding of the processes of disease through study of causative mechanisms and the signs and symptoms which reflect disease.BIO 361L —Pathophysiology LaboratoryPrerequisite Take BIO*231, and BIO*232This course is designed to correlate basic knowledge of normal physiology with dysfunction of body mechanisms. The student will gain a basic understanding of the processes of disease through study of causative mechanisms and the signs and symptoms which reflect disease.BIO 373 —AstrobiologyPrerequisite Take BIO*121, BIO*122, BIO*123L, and BIO*124LAstrobiology is the study of life as a planetary phenomenon. This course will explore life's origin, history, and evolution on Earth, and the potential for life elsewhere in the universe. It will examine the requirements and limits of life, from elemental to galactic, drawing from biology, geology, physics, and chemistry.BIO 380 —Genomics & ProteomicsPrerequisite Take BIO*121, BIO*122, BIO*123L, BIO*124L, and BIO*222Genomics and Proteomics is the detailed study of technologies and methodologies for evaluation of genomic and protein functions. These methods are used to interpret biological regulation of DNA sequences, the RNAs that are copied from them, and the proteins that are synthesized from these RNAs. The application of these technologies to problems in biology ranging from organism development to human diseases will be discussed.BIO 385 —Topic:Prerequisite Take BIO*121, BIO*122, BIO*123L, and BIO*124LThis special topics course provides students with opportunities to study current topics in the biological sciences. Biology is a rapidly changing field and thus many current issues are unable to be fully addressed in traditional course offerings. This includes topics in environmental science, bioinformatics and other evolving fields. Students may repeat the course two additional times as the topic changes.BIO 391 —Bio-Analy Tech & Lab IPrerequisite Take BIO*121, BIO*122, BIO*123L, BIO*124L, and BIO*334Lectures and laboratories will emphasize contemporary bioanalytical and biological research at the cell and molecular levels.BIO 391will stress methods employed in studies of cell physiology.BIO 392will emphasize DNA methods of gene recombination in prokaryotic and eukaryotic systems. Theoretical and practical competence will be developed in all techniques.BIO 392 —Bio-Analy Tech & Lab IIPrerequisite Take BIO*121, BIO*122, BIO*123L, BIO*124L, and BIO*334Lectures and laboratories will emphasize contemporary bioanalytical and biological research at the cell and molecular levels.BIO 391will stress methods employed in studies of cell physiology.BIO 392will emphasize DNA methods of gene recombination in prokaryotic and eukaryotic systems. Theoretical and practical competence will be developed in all techniques.BIO 401 —Biology SeminarRequired of all B.S. and B.A. biology majors beginning with students entering their senior year. The goal is to assure the readiness of students for job placement, and/or entrance into professional or graduate school by assessing the students knowledge and understanding of the field and their writing and speaking skills.BIO 402 —Biology SeminarPrerequisite TakeBIO 401Required of all B.S. and B.A. biology majors beginning with students entering senior year. The presentation of a research seminar and an in depth research literature review will be done to asses the students knowledge and understanding of the field and their writing and speaking skills.BIO 403 —Honors Thesis IIndividual research of a substantive nature pursued in the students major field of study. The research will conclude in a written thesis on an original project, and an oral defense.BIO 404 —Honors Thesis IIIndividual research of a substantive nature pursued in the students major field of study. The research will conclude in a written thesis on an original project, and an oral defense.BIO 410 —Projects in Public HealthPrerequisite Take BIO*106 and BIO*107This service learning and seminar course requires the student to apply public health concepts to his/her major area of study by working with a community partner on a project in a relevant area of public health. Students will meet weekly to discuss their projects.BIO 422 —Bioinformatics IIPrerequisite Take BIO*222The field of bioinformatics has developed as a result of the integration of information and approaches from a number of disciplines. This is an advanced course where on will be introduced to the challenges and projected outcomes of the field. It is expected that students entering this course are familiar with biological and computational techniques, as they will be used as the foundation for the laboratory portion of the course.BIO 427 —Environmental Microbio & LabPrerequisite Take BIO*212 and BIO*213LBIO 432 —Development & LabPrerequisite Take BIO*334To provide a modern view of developmental biology unifying the approaches of cell biology, biochemistry, molecular biology, and genetics. This course is designed for students who have had one year of introductory biology, and one semester of cell biology. The communication of biological concepts, ideas, and experimentation, in verbal and written form, is an integral component of this course. The laboratory emphasizes molecular aspects of development.BIO 435 —Plant PhysiologyPrerequisite Take BIO*121, BIO*122, BIO*123L, BIO*124L, and BIO*210This course deals with plant physiology at an organismal level and with the physiological ecology or interactions of plants with their environment. The unique features of plant photosynthesis, water relations and metabolic processes will be studied in a variety of taxa and settings. Laboratory will include field trips to local areas of interest and experiments in the laboratory.BIO 435L —Plant Physiology LabPrerequisite Take BIO*121, BIO*122, BIO*123L, and BIO*124LLaboratory will include field trips to local areas of interest and experiments in the laboratory.BIO 436 —Human GeneticsPrerequisite Take BIO*334The role of molecular regulatory mechanisms as they pertain to the structure and function of genes in eukaryotic systems, the evolution of genomes and molecular techniques are emphasized.BIO 437L —Medical Genetics LabPrerequisite Take BIO*436The bioinformatics component of Medical Genetics . A semester-long research project will be used to teach students how to use DNA sequence analysis to determine evolutionary relationships or explore the genetics of human disease. Research projects will vary depending upon the expertise and interest of the instructor.BIO 441 —Comp Animal Phys & LabPrerequisite Take BIO*121, BIO*122, BIO*123L, BIO*124L, and BIO*334An advanced course in physiology intended to provide in-depth coverage of functions of selected cells, tissues, organs, and organ systems. Laboratory will feature experiments using appropriate animal model systems.BIO 445 —LimnologyPrerequisite Take BIO*121. BIO*122, BIO*204, and BIO*205LThis course provides students with an introduction to limnology, emphasizing the physical, chemical and biological function of north temperate lakes and streams. Lecture topics include the physics and chemistry of continental waters, the major biotic communities, interactions among these communities, and interactions between humans and the aquatic environment. Laboratory exercises and field trips provide a practical introduction to the methods of aquatic sciences.BIO 488 —Internship in Environmental ScienceTraining and professional experience in the environment. Interns perform service training, keep a written journal, and write a personal career evaluation based on the internship experience. Department chair permission required.BIO 489 —Health Studies InternshipThe health studies internship is an immersive hands-on experience in a particular aspect of health care. Individuals must perform a minimum of 60 hours of structured, closely monitored training, maintain a written journal, and write a personal career evaluation based on the experience. Biology department chair permission required.BIO 497 —Independent Study Upper class status - junior or senior.  A 3.0 GPA in the major.  The acceptance of his/her proposed work by a department faculty member.  Completed work on the project by the end of one semester - written report.BIO 498 —Independent Study Upper class status - junior or senior.  A 3.0 GPA in the major.  The acceptance of his/her proposed work by a department faculty member.  Completed work on the project by the end of one semester - written report.BIO 499 —Independent Study A 3.0 GPA in the major.  The acceptance of his/her proposed work by a department faculty member.  Completed work on the project by the end of one semester - written report.",
            "instructors": [],
            "textbooks": [],
            "zoom_link": null
        },
        {
            "number": "121",
            "title": "122 and includes an investigative approach to the study of all living organisms",
            "description": "BIO 124L —Gen Biology Lab IIPrerequisite Take BIO*122This laboratory is designed to be taken concurrently with BIO 121-122 and includes an investigative approach to the study of all living organisms.BIO 189 —Prehealth Career StudiesThis is a course designed to introduce students early in their studies to the health care careers. Individual off-campus health sciences experiences sponsored by appropriate organizations, companies and private practitioners provide unpaid internships with a minimum of 60 hours of student service. Biology department chair permission required.BIO 198 —Introduction to Scientific ResearchThis course is designed to introduce students to the principles of scientific research, analyzing primary literature, ethics in research, science communication, and career development.BIO 199 —Intro to Scientific Research IIThis course is designed to allow first-year students the opportunity to rotate through scientific research labs in preparation for long-term faculty-student research collaborations.BIO 201 —Global HealthPrerequisite Take BIO*106Public health issues often transcend traditional boundaries and are rapidly changing in response to technological change and globalization. This course will focus on applying public health principles in both developed and developing countries to understand the links between health and economic and social development.BIO 202 —The History of Modern SciencePrerequisite Take BIO*121, BIO*123L, BIO*122, and BIO*124LThis course surveys the history of modern science, beginning with the Copernican  model of the universe. It will cover the evolution of scientific theories and the scientists responsible for the major discoveries in Astronomy, Physics, Chemistry, Biology, and Geology.BIO 204 —EcologyPrerequisite Take BIO*121, BIO*123L, BIO*122, and BIO*124LA course relating ecological principles to studies in the laboratory and field. Topics include population dynamics, energy flow in ecosystems, and species interactions.BIO 205L —Ecology LaboratoryPrerequisite Take BIO*204A course relating ecological principles to studies in the laboratory and field. Topics include population dynamics, energy flow in ecosystems, and species interactions.BIO 210 —BotanyPrerequisite Take BIO*121, BIO*122, BIO*123L, and BIO*124LA study of the basic principles of botany, and a survey of the plant kingdom with emphasis on the morphology and physiology of higher plants.BIO 212 —MicrobiologyPrerequisite TakeBIO 213LconcurrentlyA study of the basic principles of microbiology involving pathogenic and nonpathogenic organisms and their relation to medicine, sanitation, agriculture, and industry. Laboratory study is concerned with the morphology and physiology of microorganisms, and with their application in identification.BIO 213L —Microbiology LabPrerequisite Take BIO*212Laboratory study concerned with the morphology and physiology of microorganisms, and with their application in identification.BIO 215 —General PathophysiologyPrerequisite Must have taken NUR*354;This course is designed to correlate basic knowledge of normal physiology with dysfunction of body mechanisms. The student will gain a basic understanding of the processes of disease through study of causative mechanisms and the signs and symptoms which reflect disease.BIO 221 —EvolutionPrerequisite Take BIO*121, BIO*122, BIO*123L, AND BIO*124LNothing in biology makes sense except in the light of evolution. This course covers the diversity of life on earth and the ongoing evolutionary processes that affect all biology from the ecosystem to the hospital. Topics include natural selection, speciation, diversity on earth, molecular processes and primate evolution. Cross-listed asENV 221.BIO 222 —BioinformaticsPrerequisite take BIO*121, BIO*122, BIO*123L, and BIO*124LBioinformatics is the study of biological phenomena and the data generated from such studies with the assistance of computers. Bioinformatics relies on computers for the acquisition, storage, analysis, manipulation, management and dissemination of biological information. This is an introductory course to the problems and promise in this field.BIO 231 —Anatomy & Physiology IPrerequisite TakeBIO 233LA unified study of the structure and function of the human body. The course will survey the anatomy and physiology of the major types of human cells, tissues, organs and organ systems. An understanding of the human body as a self-regulated, dynamic community of interrelated living parts will be emphasized. Designed to be taken sequentially. Must be taken concurrently with laboratory.BIO 232 —Anatomy & Physiology IIPrerequisite Take BIO*234LA unified study of the structure and function of the human body. The course will survey the anatomy and physiology of the major types of human cells, tissues, organs and organ systems. An understanding of the human body as a self-regulated, dynamic community of interrelated living parts will be emphasized. Designed to be taken sequentially. Must be taken concurrently with laboratory.BIO 233L —Anatomy & Physiology Lab IPrerequisite Take BIO*231The laboratory involves a series of student-performed exercises designed to illustrate, by observation and experimentation, the major concepts of human anatomy and physiology. Designed to be taken sequentially. Must be taken concurrently with lecture.BIO 234L —Anatomy & Physiology Lab IIPrerequisite Take BIO*232The laboratory involves a series of student-performed exercises designed to illustrate, by observation and experimentation, the major concepts of human anatomy and physiology. Designed to be taken sequentially. Must be taken concurrently with lecture.BIO 237 —Comparative Anatomy TutorialPrerequisite Take BIO*121 and BIO*123LIn the true sense of a tutorial, the instructor provides individual attention to a small group of students in the art of dissecting a cat. The anatomy dissection is accompanied by lecture on the underlying physiology and comparisons to human anatomy and physiology.BIO 246 —Genetics IPrerequisite Must have taken BIO*121, BIO*122, BIO*123L and BIO*124L;A study of Mendelian genetics and the molecular biology of the gene. Basic principles of genetics, as they apply in plants and animals, are studied in the laboratory with special emphasis on Drosophilia. - four semester hoursBIO 298 —Fellowship ResearchStudent-faculty collaborative research for fellowship students.BIO 299 —Fellowship Research IIPrerequisite Take BIO*298BIO 302 —Nature StudyThis course fosters a personal, hands-on approach to understanding the natural world. It is designed to help the student become a better observer, communicator, and educator in the field of nature study. The laboratory provides opportunities to visit nature sites, conduct field studies, plan and implement educational projects, and learn from accomplished naturalists and educators. The course may include a service learning component.BIO 304 —Field Ecology & LabA course in the ecology of local plants and their habitats, designed for the student with minimal experience in ecology. By learning basic plant structure and terminology, and the interactions between plants and the environment, the student will learn the ecology of plants in a natural setting. Course activities include field trips to areas of interest and laboratory experiments.BIO 310 —Medical BotanyA survey of plants with physiologically active properties of medicinal interest. Emphasis is placed on the biology, folk uses, ethnobotany, and natural history of useful angiosperms.BIO 312 —Conservation EcologyPrerequisite Take BIO*204 and BIO*205LThe practice and theory of conservation ecology. Current and future threats to populations and ecosystems, methods of protection, and the methods used to assess conservation efforts will be covered. Case studies include restoration, extinction, and wildlife management. Students will apply conservation ecology methods to real world threatened populations. Cross-listed asENV 312.BIO 315 —PharmacologyPrerequisite Take BIO*121, BIO*122, CHE*111, CHE*112, and BIO*334The course is designed to introduce one to the study of the interaction of chemicals with living organisms. Pharmacology encompasses the disciplines of organic chemistry, physiology, pathology, biochemistry, and molecular biology, and as such we will investigate drug action at several levels: whole body, organ, tissue, cell, and molecular. We will discuss the intricacies of the various classes of drugs, and discuss the factors that are used to assess the safety and efficacy of a drug.BIO 316 —Virology/ImmunologyPrerequisite Take BIO*121, BIO*122, BIO*123L, and BIO*124LThe course material covers two areas of medical importance: virology, some of the predominant disease-causing agents; and immunology, our body's major defense mechanisms against disease. Topics to be covered include the history, biology, molecular structure, and evolutionary significance of the components of these two systems. The recent findings in the fields will be highlighted, as they pertain to our understanding of disease.BIO 334 —Cell BiologyPrerequisite Take BIO*121, BIO*122, BIO*123L, and BIO*124LA study of the cell with emphasis on the molecular aspects of cell structure and function. Biochemical processes are emphasized.BIO 337 —Intro to OncologyPrerequisite Take BIO*121, BIO*122, BIO*123L, and BIO*124LThe course encompasses the basic biology and clinical aspects of cancer. Topics to be covered include the history of oncology, basic cancer biology, and current concepts relative to the cause, prevention, detection, and treatment of benign and malignant neoplasias.BIO 338 —Cell PhysiologyPrerequisite Take BIO*334A contemporary perspective on cell function drawing upon recent findings in physiology, biochemistry, biophysics, and molecular biology. The course will highlight the cellular processes that occur outside the nucleus . Emphasis will be placed on learning quantitative approaches to solving problems in cell physiology.BIO 345 —Experimental Design & Analysis With LabPrerequisite Take BIO*121, and BIO*122Mathematics is a fundamental component of Biology. In this course, experimental design, statistics, and simple modeling are presented from a biological perspective, in preparation for thesis and post-baccalaureate research, and for preparation for employment in Biology.BIO 347 —GeneticsPrerequisite Must have takenBIO 121andBIO 122This course expands on the concepts of heredity, with emphasis placed on the genetics of both prokaryotic and eukaryotic microorganisms. Classical genetic analysis, non-Mendelian inheritance, molecular mechanism of genetic change, and human genetics will be covered.BIO 348L —Genetics LaboratoryPrerequisite Take BIO*347BIO 352 —Microscopic Anatomy & LabPrerequisite Take BIO*121, BIO*122, BIO*123L, and BIO*124LA study of the cells and tissues, and their involvement in organ structure. Cytological and histological slides are prepared and studied in the laboratory.BIO 360 —PathophysiologyPrerequisite TakeBIO 231,BIO 232,BIO 233LandBIO 234LThis course is designed to correlate basic knowledge of normal physiology with dysfunction of body mechanisms. The student will gain a basic understanding of the processes of disease through study of causative mechanisms and the signs and symptoms which reflect disease.BIO 361L —Pathophysiology LaboratoryPrerequisite Take BIO*231, and BIO*232This course is designed to correlate basic knowledge of normal physiology with dysfunction of body mechanisms. The student will gain a basic understanding of the processes of disease through study of causative mechanisms and the signs and symptoms which reflect disease.BIO 373 —AstrobiologyPrerequisite Take BIO*121, BIO*122, BIO*123L, and BIO*124LAstrobiology is the study of life as a planetary phenomenon. This course will explore life's origin, history, and evolution on Earth, and the potential for life elsewhere in the universe. It will examine the requirements and limits of life, from elemental to galactic, drawing from biology, geology, physics, and chemistry.BIO 380 —Genomics & ProteomicsPrerequisite Take BIO*121, BIO*122, BIO*123L, BIO*124L, and BIO*222Genomics and Proteomics is the detailed study of technologies and methodologies for evaluation of genomic and protein functions. These methods are used to interpret biological regulation of DNA sequences, the RNAs that are copied from them, and the proteins that are synthesized from these RNAs. The application of these technologies to problems in biology ranging from organism development to human diseases will be discussed.BIO 385 —Topic:Prerequisite Take BIO*121, BIO*122, BIO*123L, and BIO*124LThis special topics course provides students with opportunities to study current topics in the biological sciences. Biology is a rapidly changing field and thus many current issues are unable to be fully addressed in traditional course offerings. This includes topics in environmental science, bioinformatics and other evolving fields. Students may repeat the course two additional times as the topic changes.BIO 391 —Bio-Analy Tech & Lab IPrerequisite Take BIO*121, BIO*122, BIO*123L, BIO*124L, and BIO*334Lectures and laboratories will emphasize contemporary bioanalytical and biological research at the cell and molecular levels.BIO 391will stress methods employed in studies of cell physiology.BIO 392will emphasize DNA methods of gene recombination in prokaryotic and eukaryotic systems. Theoretical and practical competence will be developed in all techniques.BIO 392 —Bio-Analy Tech & Lab IIPrerequisite Take BIO*121, BIO*122, BIO*123L, BIO*124L, and BIO*334Lectures and laboratories will emphasize contemporary bioanalytical and biological research at the cell and molecular levels.BIO 391will stress methods employed in studies of cell physiology.BIO 392will emphasize DNA methods of gene recombination in prokaryotic and eukaryotic systems. Theoretical and practical competence will be developed in all techniques.BIO 401 —Biology SeminarRequired of all B.S. and B.A. biology majors beginning with students entering their senior year. The goal is to assure the readiness of students for job placement, and/or entrance into professional or graduate school by assessing the students knowledge and understanding of the field and their writing and speaking skills.BIO 402 —Biology SeminarPrerequisite TakeBIO 401Required of all B.S. and B.A. biology majors beginning with students entering senior year. The presentation of a research seminar and an in depth research literature review will be done to asses the students knowledge and understanding of the field and their writing and speaking skills.BIO 403 —Honors Thesis IIndividual research of a substantive nature pursued in the students major field of study. The research will conclude in a written thesis on an original project, and an oral defense.BIO 404 —Honors Thesis IIIndividual research of a substantive nature pursued in the students major field of study. The research will conclude in a written thesis on an original project, and an oral defense.BIO 410 —Projects in Public HealthPrerequisite Take BIO*106 and BIO*107This service learning and seminar course requires the student to apply public health concepts to his/her major area of study by working with a community partner on a project in a relevant area of public health. Students will meet weekly to discuss their projects.BIO 422 —Bioinformatics IIPrerequisite Take BIO*222The field of bioinformatics has developed as a result of the integration of information and approaches from a number of disciplines. This is an advanced course where on will be introduced to the challenges and projected outcomes of the field. It is expected that students entering this course are familiar with biological and computational techniques, as they will be used as the foundation for the laboratory portion of the course.BIO 427 —Environmental Microbio & LabPrerequisite Take BIO*212 and BIO*213LBIO 432 —Development & LabPrerequisite Take BIO*334To provide a modern view of developmental biology unifying the approaches of cell biology, biochemistry, molecular biology, and genetics. This course is designed for students who have had one year of introductory biology, and one semester of cell biology. The communication of biological concepts, ideas, and experimentation, in verbal and written form, is an integral component of this course. The laboratory emphasizes molecular aspects of development.BIO 435 —Plant PhysiologyPrerequisite Take BIO*121, BIO*122, BIO*123L, BIO*124L, and BIO*210This course deals with plant physiology at an organismal level and with the physiological ecology or interactions of plants with their environment. The unique features of plant photosynthesis, water relations and metabolic processes will be studied in a variety of taxa and settings. Laboratory will include field trips to local areas of interest and experiments in the laboratory.BIO 435L —Plant Physiology LabPrerequisite Take BIO*121, BIO*122, BIO*123L, and BIO*124LLaboratory will include field trips to local areas of interest and experiments in the laboratory.BIO 436 —Human GeneticsPrerequisite Take BIO*334The role of molecular regulatory mechanisms as they pertain to the structure and function of genes in eukaryotic systems, the evolution of genomes and molecular techniques are emphasized.BIO 437L —Medical Genetics LabPrerequisite Take BIO*436The bioinformatics component of Medical Genetics . A semester-long research project will be used to teach students how to use DNA sequence analysis to determine evolutionary relationships or explore the genetics of human disease. Research projects will vary depending upon the expertise and interest of the instructor.BIO 441 —Comp Animal Phys & LabPrerequisite Take BIO*121, BIO*122, BIO*123L, BIO*124L, and BIO*334An advanced course in physiology intended to provide in-depth coverage of functions of selected cells, tissues, organs, and organ systems. Laboratory will feature experiments using appropriate animal model systems.BIO 445 —LimnologyPrerequisite Take BIO*121. BIO*122, BIO*204, and BIO*205LThis course provides students with an introduction to limnology, emphasizing the physical, chemical and biological function of north temperate lakes and streams. Lecture topics include the physics and chemistry of continental waters, the major biotic communities, interactions among these communities, and interactions between humans and the aquatic environment. Laboratory exercises and field trips provide a practical introduction to the methods of aquatic sciences.BIO 488 —Internship in Environmental ScienceTraining and professional experience in the environment. Interns perform service training, keep a written journal, and write a personal career evaluation based on the internship experience. Department chair permission required.BIO 489 —Health Studies InternshipThe health studies internship is an immersive hands-on experience in a particular aspect of health care. Individuals must perform a minimum of 60 hours of structured, closely monitored training, maintain a written journal, and write a personal career evaluation based on the experience. Biology department chair permission required.BIO 497 —Independent Study Upper class status - junior or senior.  A 3.0 GPA in the major.  The acceptance of his/her proposed work by a department faculty member.  Completed work on the project by the end of one semester - written report.BIO 498 —Independent Study Upper class status - junior or senior.  A 3.0 GPA in the major.  The acceptance of his/her proposed work by a department faculty member.  Completed work on the project by the end of one semester - written report.BIO 499 —Independent Study A 3.0 GPA in the major.  The acceptance of his/her proposed work by a department faculty member.  Completed work on the project by the end of one semester - written report.",
            "instructors": [],
            "textbooks": [],
            "zoom_link": null
        },
        {
            "number": "121",
            "title": "122 and includes an investigative approach to the study of all living organisms",
            "description": "BIO 124L —Gen Biology Lab IIPrerequisite Take BIO*122This laboratory is designed to be taken concurrently with BIO 121-122 and includes an investigative approach to the study of all living organisms.BIO 189 —Prehealth Career StudiesThis is a course designed to introduce students early in their studies to the health care careers. Individual off-campus health sciences experiences sponsored by appropriate organizations, companies and private practitioners provide unpaid internships with a minimum of 60 hours of student service. Biology department chair permission required.BIO 198 —Introduction to Scientific ResearchThis course is designed to introduce students to the principles of scientific research, analyzing primary literature, ethics in research, science communication, and career development.BIO 199 —Intro to Scientific Research IIThis course is designed to allow first-year students the opportunity to rotate through scientific research labs in preparation for long-term faculty-student research collaborations.BIO 201 —Global HealthPrerequisite Take BIO*106Public health issues often transcend traditional boundaries and are rapidly changing in response to technological change and globalization. This course will focus on applying public health principles in both developed and developing countries to understand the links between health and economic and social development.BIO 202 —The History of Modern SciencePrerequisite Take BIO*121, BIO*123L, BIO*122, and BIO*124LThis course surveys the history of modern science, beginning with the Copernican  model of the universe. It will cover the evolution of scientific theories and the scientists responsible for the major discoveries in Astronomy, Physics, Chemistry, Biology, and Geology.BIO 204 —EcologyPrerequisite Take BIO*121, BIO*123L, BIO*122, and BIO*124LA course relating ecological principles to studies in the laboratory and field. Topics include population dynamics, energy flow in ecosystems, and species interactions.BIO 205L —Ecology LaboratoryPrerequisite Take BIO*204A course relating ecological principles to studies in the laboratory and field. Topics include population dynamics, energy flow in ecosystems, and species interactions.BIO 210 —BotanyPrerequisite Take BIO*121, BIO*122, BIO*123L, and BIO*124LA study of the basic principles of botany, and a survey of the plant kingdom with emphasis on the morphology and physiology of higher plants.BIO 212 —MicrobiologyPrerequisite TakeBIO 213LconcurrentlyA study of the basic principles of microbiology involving pathogenic and nonpathogenic organisms and their relation to medicine, sanitation, agriculture, and industry. Laboratory study is concerned with the morphology and physiology of microorganisms, and with their application in identification.BIO 213L —Microbiology LabPrerequisite Take BIO*212Laboratory study concerned with the morphology and physiology of microorganisms, and with their application in identification.BIO 215 —General PathophysiologyPrerequisite Must have taken NUR*354;This course is designed to correlate basic knowledge of normal physiology with dysfunction of body mechanisms. The student will gain a basic understanding of the processes of disease through study of causative mechanisms and the signs and symptoms which reflect disease.BIO 221 —EvolutionPrerequisite Take BIO*121, BIO*122, BIO*123L, AND BIO*124LNothing in biology makes sense except in the light of evolution. This course covers the diversity of life on earth and the ongoing evolutionary processes that affect all biology from the ecosystem to the hospital. Topics include natural selection, speciation, diversity on earth, molecular processes and primate evolution. Cross-listed asENV 221.BIO 222 —BioinformaticsPrerequisite take BIO*121, BIO*122, BIO*123L, and BIO*124LBioinformatics is the study of biological phenomena and the data generated from such studies with the assistance of computers. Bioinformatics relies on computers for the acquisition, storage, analysis, manipulation, management and dissemination of biological information. This is an introductory course to the problems and promise in this field.BIO 231 —Anatomy & Physiology IPrerequisite TakeBIO 233LA unified study of the structure and function of the human body. The course will survey the anatomy and physiology of the major types of human cells, tissues, organs and organ systems. An understanding of the human body as a self-regulated, dynamic community of interrelated living parts will be emphasized. Designed to be taken sequentially. Must be taken concurrently with laboratory.BIO 232 —Anatomy & Physiology IIPrerequisite Take BIO*234LA unified study of the structure and function of the human body. The course will survey the anatomy and physiology of the major types of human cells, tissues, organs and organ systems. An understanding of the human body as a self-regulated, dynamic community of interrelated living parts will be emphasized. Designed to be taken sequentially. Must be taken concurrently with laboratory.BIO 233L —Anatomy & Physiology Lab IPrerequisite Take BIO*231The laboratory involves a series of student-performed exercises designed to illustrate, by observation and experimentation, the major concepts of human anatomy and physiology. Designed to be taken sequentially. Must be taken concurrently with lecture.BIO 234L —Anatomy & Physiology Lab IIPrerequisite Take BIO*232The laboratory involves a series of student-performed exercises designed to illustrate, by observation and experimentation, the major concepts of human anatomy and physiology. Designed to be taken sequentially. Must be taken concurrently with lecture.BIO 237 —Comparative Anatomy TutorialPrerequisite Take BIO*121 and BIO*123LIn the true sense of a tutorial, the instructor provides individual attention to a small group of students in the art of dissecting a cat. The anatomy dissection is accompanied by lecture on the underlying physiology and comparisons to human anatomy and physiology.BIO 246 —Genetics IPrerequisite Must have taken BIO*121, BIO*122, BIO*123L and BIO*124L;A study of Mendelian genetics and the molecular biology of the gene. Basic principles of genetics, as they apply in plants and animals, are studied in the laboratory with special emphasis on Drosophilia. - four semester hoursBIO 298 —Fellowship ResearchStudent-faculty collaborative research for fellowship students.BIO 299 —Fellowship Research IIPrerequisite Take BIO*298BIO 302 —Nature StudyThis course fosters a personal, hands-on approach to understanding the natural world. It is designed to help the student become a better observer, communicator, and educator in the field of nature study. The laboratory provides opportunities to visit nature sites, conduct field studies, plan and implement educational projects, and learn from accomplished naturalists and educators. The course may include a service learning component.BIO 304 —Field Ecology & LabA course in the ecology of local plants and their habitats, designed for the student with minimal experience in ecology. By learning basic plant structure and terminology, and the interactions between plants and the environment, the student will learn the ecology of plants in a natural setting. Course activities include field trips to areas of interest and laboratory experiments.BIO 310 —Medical BotanyA survey of plants with physiologically active properties of medicinal interest. Emphasis is placed on the biology, folk uses, ethnobotany, and natural history of useful angiosperms.BIO 312 —Conservation EcologyPrerequisite Take BIO*204 and BIO*205LThe practice and theory of conservation ecology. Current and future threats to populations and ecosystems, methods of protection, and the methods used to assess conservation efforts will be covered. Case studies include restoration, extinction, and wildlife management. Students will apply conservation ecology methods to real world threatened populations. Cross-listed asENV 312.BIO 315 —PharmacologyPrerequisite Take BIO*121, BIO*122, CHE*111, CHE*112, and BIO*334The course is designed to introduce one to the study of the interaction of chemicals with living organisms. Pharmacology encompasses the disciplines of organic chemistry, physiology, pathology, biochemistry, and molecular biology, and as such we will investigate drug action at several levels: whole body, organ, tissue, cell, and molecular. We will discuss the intricacies of the various classes of drugs, and discuss the factors that are used to assess the safety and efficacy of a drug.BIO 316 —Virology/ImmunologyPrerequisite Take BIO*121, BIO*122, BIO*123L, and BIO*124LThe course material covers two areas of medical importance: virology, some of the predominant disease-causing agents; and immunology, our body's major defense mechanisms against disease. Topics to be covered include the history, biology, molecular structure, and evolutionary significance of the components of these two systems. The recent findings in the fields will be highlighted, as they pertain to our understanding of disease.BIO 334 —Cell BiologyPrerequisite Take BIO*121, BIO*122, BIO*123L, and BIO*124LA study of the cell with emphasis on the molecular aspects of cell structure and function. Biochemical processes are emphasized.BIO 337 —Intro to OncologyPrerequisite Take BIO*121, BIO*122, BIO*123L, and BIO*124LThe course encompasses the basic biology and clinical aspects of cancer. Topics to be covered include the history of oncology, basic cancer biology, and current concepts relative to the cause, prevention, detection, and treatment of benign and malignant neoplasias.BIO 338 —Cell PhysiologyPrerequisite Take BIO*334A contemporary perspective on cell function drawing upon recent findings in physiology, biochemistry, biophysics, and molecular biology. The course will highlight the cellular processes that occur outside the nucleus . Emphasis will be placed on learning quantitative approaches to solving problems in cell physiology.BIO 345 —Experimental Design & Analysis With LabPrerequisite Take BIO*121, and BIO*122Mathematics is a fundamental component of Biology. In this course, experimental design, statistics, and simple modeling are presented from a biological perspective, in preparation for thesis and post-baccalaureate research, and for preparation for employment in Biology.BIO 347 —GeneticsPrerequisite Must have takenBIO 121andBIO 122This course expands on the concepts of heredity, with emphasis placed on the genetics of both prokaryotic and eukaryotic microorganisms. Classical genetic analysis, non-Mendelian inheritance, molecular mechanism of genetic change, and human genetics will be covered.BIO 348L —Genetics LaboratoryPrerequisite Take BIO*347BIO 352 —Microscopic Anatomy & LabPrerequisite Take BIO*121, BIO*122, BIO*123L, and BIO*124LA study of the cells and tissues, and their involvement in organ structure. Cytological and histological slides are prepared and studied in the laboratory.BIO 360 —PathophysiologyPrerequisite TakeBIO 231,BIO 232,BIO 233LandBIO 234LThis course is designed to correlate basic knowledge of normal physiology with dysfunction of body mechanisms. The student will gain a basic understanding of the processes of disease through study of causative mechanisms and the signs and symptoms which reflect disease.BIO 361L —Pathophysiology LaboratoryPrerequisite Take BIO*231, and BIO*232This course is designed to correlate basic knowledge of normal physiology with dysfunction of body mechanisms. The student will gain a basic understanding of the processes of disease through study of causative mechanisms and the signs and symptoms which reflect disease.BIO 373 —AstrobiologyPrerequisite Take BIO*121, BIO*122, BIO*123L, and BIO*124LAstrobiology is the study of life as a planetary phenomenon. This course will explore life's origin, history, and evolution on Earth, and the potential for life elsewhere in the universe. It will examine the requirements and limits of life, from elemental to galactic, drawing from biology, geology, physics, and chemistry.BIO 380 —Genomics & ProteomicsPrerequisite Take BIO*121, BIO*122, BIO*123L, BIO*124L, and BIO*222Genomics and Proteomics is the detailed study of technologies and methodologies for evaluation of genomic and protein functions. These methods are used to interpret biological regulation of DNA sequences, the RNAs that are copied from them, and the proteins that are synthesized from these RNAs. The application of these technologies to problems in biology ranging from organism development to human diseases will be discussed.BIO 385 —Topic:Prerequisite Take BIO*121, BIO*122, BIO*123L, and BIO*124LThis special topics course provides students with opportunities to study current topics in the biological sciences. Biology is a rapidly changing field and thus many current issues are unable to be fully addressed in traditional course offerings. This includes topics in environmental science, bioinformatics and other evolving fields. Students may repeat the course two additional times as the topic changes.BIO 391 —Bio-Analy Tech & Lab IPrerequisite Take BIO*121, BIO*122, BIO*123L, BIO*124L, and BIO*334Lectures and laboratories will emphasize contemporary bioanalytical and biological research at the cell and molecular levels.BIO 391will stress methods employed in studies of cell physiology.BIO 392will emphasize DNA methods of gene recombination in prokaryotic and eukaryotic systems. Theoretical and practical competence will be developed in all techniques.BIO 392 —Bio-Analy Tech & Lab IIPrerequisite Take BIO*121, BIO*122, BIO*123L, BIO*124L, and BIO*334Lectures and laboratories will emphasize contemporary bioanalytical and biological research at the cell and molecular levels.BIO 391will stress methods employed in studies of cell physiology.BIO 392will emphasize DNA methods of gene recombination in prokaryotic and eukaryotic systems. Theoretical and practical competence will be developed in all techniques.BIO 401 —Biology SeminarRequired of all B.S. and B.A. biology majors beginning with students entering their senior year. The goal is to assure the readiness of students for job placement, and/or entrance into professional or graduate school by assessing the students knowledge and understanding of the field and their writing and speaking skills.BIO 402 —Biology SeminarPrerequisite TakeBIO 401Required of all B.S. and B.A. biology majors beginning with students entering senior year. The presentation of a research seminar and an in depth research literature review will be done to asses the students knowledge and understanding of the field and their writing and speaking skills.BIO 403 —Honors Thesis IIndividual research of a substantive nature pursued in the students major field of study. The research will conclude in a written thesis on an original project, and an oral defense.BIO 404 —Honors Thesis IIIndividual research of a substantive nature pursued in the students major field of study. The research will conclude in a written thesis on an original project, and an oral defense.BIO 410 —Projects in Public HealthPrerequisite Take BIO*106 and BIO*107This service learning and seminar course requires the student to apply public health concepts to his/her major area of study by working with a community partner on a project in a relevant area of public health. Students will meet weekly to discuss their projects.BIO 422 —Bioinformatics IIPrerequisite Take BIO*222The field of bioinformatics has developed as a result of the integration of information and approaches from a number of disciplines. This is an advanced course where on will be introduced to the challenges and projected outcomes of the field. It is expected that students entering this course are familiar with biological and computational techniques, as they will be used as the foundation for the laboratory portion of the course.BIO 427 —Environmental Microbio & LabPrerequisite Take BIO*212 and BIO*213LBIO 432 —Development & LabPrerequisite Take BIO*334To provide a modern view of developmental biology unifying the approaches of cell biology, biochemistry, molecular biology, and genetics. This course is designed for students who have had one year of introductory biology, and one semester of cell biology. The communication of biological concepts, ideas, and experimentation, in verbal and written form, is an integral component of this course. The laboratory emphasizes molecular aspects of development.BIO 435 —Plant PhysiologyPrerequisite Take BIO*121, BIO*122, BIO*123L, BIO*124L, and BIO*210This course deals with plant physiology at an organismal level and with the physiological ecology or interactions of plants with their environment. The unique features of plant photosynthesis, water relations and metabolic processes will be studied in a variety of taxa and settings. Laboratory will include field trips to local areas of interest and experiments in the laboratory.BIO 435L —Plant Physiology LabPrerequisite Take BIO*121, BIO*122, BIO*123L, and BIO*124LLaboratory will include field trips to local areas of interest and experiments in the laboratory.BIO 436 —Human GeneticsPrerequisite Take BIO*334The role of molecular regulatory mechanisms as they pertain to the structure and function of genes in eukaryotic systems, the evolution of genomes and molecular techniques are emphasized.BIO 437L —Medical Genetics LabPrerequisite Take BIO*436The bioinformatics component of Medical Genetics . A semester-long research project will be used to teach students how to use DNA sequence analysis to determine evolutionary relationships or explore the genetics of human disease. Research projects will vary depending upon the expertise and interest of the instructor.BIO 441 —Comp Animal Phys & LabPrerequisite Take BIO*121, BIO*122, BIO*123L, BIO*124L, and BIO*334An advanced course in physiology intended to provide in-depth coverage of functions of selected cells, tissues, organs, and organ systems. Laboratory will feature experiments using appropriate animal model systems.BIO 445 —LimnologyPrerequisite Take BIO*121. BIO*122, BIO*204, and BIO*205LThis course provides students with an introduction to limnology, emphasizing the physical, chemical and biological function of north temperate lakes and streams. Lecture topics include the physics and chemistry of continental waters, the major biotic communities, interactions among these communities, and interactions between humans and the aquatic environment. Laboratory exercises and field trips provide a practical introduction to the methods of aquatic sciences.BIO 488 —Internship in Environmental ScienceTraining and professional experience in the environment. Interns perform service training, keep a written journal, and write a personal career evaluation based on the internship experience. Department chair permission required.BIO 489 —Health Studies InternshipThe health studies internship is an immersive hands-on experience in a particular aspect of health care. Individuals must perform a minimum of 60 hours of structured, closely monitored training, maintain a written journal, and write a personal career evaluation based on the experience. Biology department chair permission required.BIO 497 —Independent Study Upper class status - junior or senior.  A 3.0 GPA in the major.  The acceptance of his/her proposed work by a department faculty member.  Completed work on the project by the end of one semester - written report.BIO 498 —Independent Study Upper class status - junior or senior.  A 3.0 GPA in the major.  The acceptance of his/her proposed work by a department faculty member.  Completed work on the project by the end of one semester - written report.BIO 499 —Independent Study A 3.0 GPA in the major.  The acceptance of his/her proposed work by a department faculty member.  Completed work on the project by the end of one semester - written report.",
            "instructors": [],
            "textbooks": [],
            "zoom_link": null
        },
        {
            "number": "121",
            "title": "122 and includes an investigative approach to the study of all living organisms",
            "description": "BIO 124L —Gen Biology Lab IIPrerequisite Take BIO*122This laboratory is designed to be taken concurrently with BIO 121-122 and includes an investigative approach to the study of all living organisms.BIO 189 —Prehealth Career StudiesThis is a course designed to introduce students early in their studies to the health care careers. Individual off-campus health sciences experiences sponsored by appropriate organizations, companies and private practitioners provide unpaid internships with a minimum of 60 hours of student service. Biology department chair permission required.BIO 198 —Introduction to Scientific ResearchThis course is designed to introduce students to the principles of scientific research, analyzing primary literature, ethics in research, science communication, and career development.BIO 199 —Intro to Scientific Research IIThis course is designed to allow first-year students the opportunity to rotate through scientific research labs in preparation for long-term faculty-student research collaborations.BIO 201 —Global HealthPrerequisite Take BIO*106Public health issues often transcend traditional boundaries and are rapidly changing in response to technological change and globalization. This course will focus on applying public health principles in both developed and developing countries to understand the links between health and economic and social development.BIO 202 —The History of Modern SciencePrerequisite Take BIO*121, BIO*123L, BIO*122, and BIO*124LThis course surveys the history of modern science, beginning with the Copernican  model of the universe. It will cover the evolution of scientific theories and the scientists responsible for the major discoveries in Astronomy, Physics, Chemistry, Biology, and Geology.BIO 204 —EcologyPrerequisite Take BIO*121, BIO*123L, BIO*122, and BIO*124LA course relating ecological principles to studies in the laboratory and field. Topics include population dynamics, energy flow in ecosystems, and species interactions.BIO 205L —Ecology LaboratoryPrerequisite Take BIO*204A course relating ecological principles to studies in the laboratory and field. Topics include population dynamics, energy flow in ecosystems, and species interactions.BIO 210 —BotanyPrerequisite Take BIO*121, BIO*122, BIO*123L, and BIO*124LA study of the basic principles of botany, and a survey of the plant kingdom with emphasis on the morphology and physiology of higher plants.BIO 212 —MicrobiologyPrerequisite TakeBIO 213LconcurrentlyA study of the basic principles of microbiology involving pathogenic and nonpathogenic organisms and their relation to medicine, sanitation, agriculture, and industry. Laboratory study is concerned with the morphology and physiology of microorganisms, and with their application in identification.BIO 213L —Microbiology LabPrerequisite Take BIO*212Laboratory study concerned with the morphology and physiology of microorganisms, and with their application in identification.BIO 215 —General PathophysiologyPrerequisite Must have taken NUR*354;This course is designed to correlate basic knowledge of normal physiology with dysfunction of body mechanisms. The student will gain a basic understanding of the processes of disease through study of causative mechanisms and the signs and symptoms which reflect disease.BIO 221 —EvolutionPrerequisite Take BIO*121, BIO*122, BIO*123L, AND BIO*124LNothing in biology makes sense except in the light of evolution. This course covers the diversity of life on earth and the ongoing evolutionary processes that affect all biology from the ecosystem to the hospital. Topics include natural selection, speciation, diversity on earth, molecular processes and primate evolution. Cross-listed asENV 221.BIO 222 —BioinformaticsPrerequisite take BIO*121, BIO*122, BIO*123L, and BIO*124LBioinformatics is the study of biological phenomena and the data generated from such studies with the assistance of computers. Bioinformatics relies on computers for the acquisition, storage, analysis, manipulation, management and dissemination of biological information. This is an introductory course to the problems and promise in this field.BIO 231 —Anatomy & Physiology IPrerequisite TakeBIO 233LA unified study of the structure and function of the human body. The course will survey the anatomy and physiology of the major types of human cells, tissues, organs and organ systems. An understanding of the human body as a self-regulated, dynamic community of interrelated living parts will be emphasized. Designed to be taken sequentially. Must be taken concurrently with laboratory.BIO 232 —Anatomy & Physiology IIPrerequisite Take BIO*234LA unified study of the structure and function of the human body. The course will survey the anatomy and physiology of the major types of human cells, tissues, organs and organ systems. An understanding of the human body as a self-regulated, dynamic community of interrelated living parts will be emphasized. Designed to be taken sequentially. Must be taken concurrently with laboratory.BIO 233L —Anatomy & Physiology Lab IPrerequisite Take BIO*231The laboratory involves a series of student-performed exercises designed to illustrate, by observation and experimentation, the major concepts of human anatomy and physiology. Designed to be taken sequentially. Must be taken concurrently with lecture.BIO 234L —Anatomy & Physiology Lab IIPrerequisite Take BIO*232The laboratory involves a series of student-performed exercises designed to illustrate, by observation and experimentation, the major concepts of human anatomy and physiology. Designed to be taken sequentially. Must be taken concurrently with lecture.BIO 237 —Comparative Anatomy TutorialPrerequisite Take BIO*121 and BIO*123LIn the true sense of a tutorial, the instructor provides individual attention to a small group of students in the art of dissecting a cat. The anatomy dissection is accompanied by lecture on the underlying physiology and comparisons to human anatomy and physiology.BIO 246 —Genetics IPrerequisite Must have taken BIO*121, BIO*122, BIO*123L and BIO*124L;A study of Mendelian genetics and the molecular biology of the gene. Basic principles of genetics, as they apply in plants and animals, are studied in the laboratory with special emphasis on Drosophilia. - four semester hoursBIO 298 —Fellowship ResearchStudent-faculty collaborative research for fellowship students.BIO 299 —Fellowship Research IIPrerequisite Take BIO*298BIO 302 —Nature StudyThis course fosters a personal, hands-on approach to understanding the natural world. It is designed to help the student become a better observer, communicator, and educator in the field of nature study. The laboratory provides opportunities to visit nature sites, conduct field studies, plan and implement educational projects, and learn from accomplished naturalists and educators. The course may include a service learning component.BIO 304 —Field Ecology & LabA course in the ecology of local plants and their habitats, designed for the student with minimal experience in ecology. By learning basic plant structure and terminology, and the interactions between plants and the environment, the student will learn the ecology of plants in a natural setting. Course activities include field trips to areas of interest and laboratory experiments.BIO 310 —Medical BotanyA survey of plants with physiologically active properties of medicinal interest. Emphasis is placed on the biology, folk uses, ethnobotany, and natural history of useful angiosperms.BIO 312 —Conservation EcologyPrerequisite Take BIO*204 and BIO*205LThe practice and theory of conservation ecology. Current and future threats to populations and ecosystems, methods of protection, and the methods used to assess conservation efforts will be covered. Case studies include restoration, extinction, and wildlife management. Students will apply conservation ecology methods to real world threatened populations. Cross-listed asENV 312.BIO 315 —PharmacologyPrerequisite Take BIO*121, BIO*122, CHE*111, CHE*112, and BIO*334The course is designed to introduce one to the study of the interaction of chemicals with living organisms. Pharmacology encompasses the disciplines of organic chemistry, physiology, pathology, biochemistry, and molecular biology, and as such we will investigate drug action at several levels: whole body, organ, tissue, cell, and molecular. We will discuss the intricacies of the various classes of drugs, and discuss the factors that are used to assess the safety and efficacy of a drug.BIO 316 —Virology/ImmunologyPrerequisite Take BIO*121, BIO*122, BIO*123L, and BIO*124LThe course material covers two areas of medical importance: virology, some of the predominant disease-causing agents; and immunology, our body's major defense mechanisms against disease. Topics to be covered include the history, biology, molecular structure, and evolutionary significance of the components of these two systems. The recent findings in the fields will be highlighted, as they pertain to our understanding of disease.BIO 334 —Cell BiologyPrerequisite Take BIO*121, BIO*122, BIO*123L, and BIO*124LA study of the cell with emphasis on the molecular aspects of cell structure and function. Biochemical processes are emphasized.BIO 337 —Intro to OncologyPrerequisite Take BIO*121, BIO*122, BIO*123L, and BIO*124LThe course encompasses the basic biology and clinical aspects of cancer. Topics to be covered include the history of oncology, basic cancer biology, and current concepts relative to the cause, prevention, detection, and treatment of benign and malignant neoplasias.BIO 338 —Cell PhysiologyPrerequisite Take BIO*334A contemporary perspective on cell function drawing upon recent findings in physiology, biochemistry, biophysics, and molecular biology. The course will highlight the cellular processes that occur outside the nucleus . Emphasis will be placed on learning quantitative approaches to solving problems in cell physiology.BIO 345 —Experimental Design & Analysis With LabPrerequisite Take BIO*121, and BIO*122Mathematics is a fundamental component of Biology. In this course, experimental design, statistics, and simple modeling are presented from a biological perspective, in preparation for thesis and post-baccalaureate research, and for preparation for employment in Biology.BIO 347 —GeneticsPrerequisite Must have takenBIO 121andBIO 122This course expands on the concepts of heredity, with emphasis placed on the genetics of both prokaryotic and eukaryotic microorganisms. Classical genetic analysis, non-Mendelian inheritance, molecular mechanism of genetic change, and human genetics will be covered.BIO 348L —Genetics LaboratoryPrerequisite Take BIO*347BIO 352 —Microscopic Anatomy & LabPrerequisite Take BIO*121, BIO*122, BIO*123L, and BIO*124LA study of the cells and tissues, and their involvement in organ structure. Cytological and histological slides are prepared and studied in the laboratory.BIO 360 —PathophysiologyPrerequisite TakeBIO 231,BIO 232,BIO 233LandBIO 234LThis course is designed to correlate basic knowledge of normal physiology with dysfunction of body mechanisms. The student will gain a basic understanding of the processes of disease through study of causative mechanisms and the signs and symptoms which reflect disease.BIO 361L —Pathophysiology LaboratoryPrerequisite Take BIO*231, and BIO*232This course is designed to correlate basic knowledge of normal physiology with dysfunction of body mechanisms. The student will gain a basic understanding of the processes of disease through study of causative mechanisms and the signs and symptoms which reflect disease.BIO 373 —AstrobiologyPrerequisite Take BIO*121, BIO*122, BIO*123L, and BIO*124LAstrobiology is the study of life as a planetary phenomenon. This course will explore life's origin, history, and evolution on Earth, and the potential for life elsewhere in the universe. It will examine the requirements and limits of life, from elemental to galactic, drawing from biology, geology, physics, and chemistry.BIO 380 —Genomics & ProteomicsPrerequisite Take BIO*121, BIO*122, BIO*123L, BIO*124L, and BIO*222Genomics and Proteomics is the detailed study of technologies and methodologies for evaluation of genomic and protein functions. These methods are used to interpret biological regulation of DNA sequences, the RNAs that are copied from them, and the proteins that are synthesized from these RNAs. The application of these technologies to problems in biology ranging from organism development to human diseases will be discussed.BIO 385 —Topic:Prerequisite Take BIO*121, BIO*122, BIO*123L, and BIO*124LThis special topics course provides students with opportunities to study current topics in the biological sciences. Biology is a rapidly changing field and thus many current issues are unable to be fully addressed in traditional course offerings. This includes topics in environmental science, bioinformatics and other evolving fields. Students may repeat the course two additional times as the topic changes.BIO 391 —Bio-Analy Tech & Lab IPrerequisite Take BIO*121, BIO*122, BIO*123L, BIO*124L, and BIO*334Lectures and laboratories will emphasize contemporary bioanalytical and biological research at the cell and molecular levels.BIO 391will stress methods employed in studies of cell physiology.BIO 392will emphasize DNA methods of gene recombination in prokaryotic and eukaryotic systems. Theoretical and practical competence will be developed in all techniques.BIO 392 —Bio-Analy Tech & Lab IIPrerequisite Take BIO*121, BIO*122, BIO*123L, BIO*124L, and BIO*334Lectures and laboratories will emphasize contemporary bioanalytical and biological research at the cell and molecular levels.BIO 391will stress methods employed in studies of cell physiology.BIO 392will emphasize DNA methods of gene recombination in prokaryotic and eukaryotic systems. Theoretical and practical competence will be developed in all techniques.BIO 401 —Biology SeminarRequired of all B.S. and B.A. biology majors beginning with students entering their senior year. The goal is to assure the readiness of students for job placement, and/or entrance into professional or graduate school by assessing the students knowledge and understanding of the field and their writing and speaking skills.BIO 402 —Biology SeminarPrerequisite TakeBIO 401Required of all B.S. and B.A. biology majors beginning with students entering senior year. The presentation of a research seminar and an in depth research literature review will be done to asses the students knowledge and understanding of the field and their writing and speaking skills.BIO 403 —Honors Thesis IIndividual research of a substantive nature pursued in the students major field of study. The research will conclude in a written thesis on an original project, and an oral defense.BIO 404 —Honors Thesis IIIndividual research of a substantive nature pursued in the students major field of study. The research will conclude in a written thesis on an original project, and an oral defense.BIO 410 —Projects in Public HealthPrerequisite Take BIO*106 and BIO*107This service learning and seminar course requires the student to apply public health concepts to his/her major area of study by working with a community partner on a project in a relevant area of public health. Students will meet weekly to discuss their projects.BIO 422 —Bioinformatics IIPrerequisite Take BIO*222The field of bioinformatics has developed as a result of the integration of information and approaches from a number of disciplines. This is an advanced course where on will be introduced to the challenges and projected outcomes of the field. It is expected that students entering this course are familiar with biological and computational techniques, as they will be used as the foundation for the laboratory portion of the course.BIO 427 —Environmental Microbio & LabPrerequisite Take BIO*212 and BIO*213LBIO 432 —Development & LabPrerequisite Take BIO*334To provide a modern view of developmental biology unifying the approaches of cell biology, biochemistry, molecular biology, and genetics. This course is designed for students who have had one year of introductory biology, and one semester of cell biology. The communication of biological concepts, ideas, and experimentation, in verbal and written form, is an integral component of this course. The laboratory emphasizes molecular aspects of development.BIO 435 —Plant PhysiologyPrerequisite Take BIO*121, BIO*122, BIO*123L, BIO*124L, and BIO*210This course deals with plant physiology at an organismal level and with the physiological ecology or interactions of plants with their environment. The unique features of plant photosynthesis, water relations and metabolic processes will be studied in a variety of taxa and settings. Laboratory will include field trips to local areas of interest and experiments in the laboratory.BIO 435L —Plant Physiology LabPrerequisite Take BIO*121, BIO*122, BIO*123L, and BIO*124LLaboratory will include field trips to local areas of interest and experiments in the laboratory.BIO 436 —Human GeneticsPrerequisite Take BIO*334The role of molecular regulatory mechanisms as they pertain to the structure and function of genes in eukaryotic systems, the evolution of genomes and molecular techniques are emphasized.BIO 437L —Medical Genetics LabPrerequisite Take BIO*436The bioinformatics component of Medical Genetics . A semester-long research project will be used to teach students how to use DNA sequence analysis to determine evolutionary relationships or explore the genetics of human disease. Research projects will vary depending upon the expertise and interest of the instructor.BIO 441 —Comp Animal Phys & LabPrerequisite Take BIO*121, BIO*122, BIO*123L, BIO*124L, and BIO*334An advanced course in physiology intended to provide in-depth coverage of functions of selected cells, tissues, organs, and organ systems. Laboratory will feature experiments using appropriate animal model systems.BIO 445 —LimnologyPrerequisite Take BIO*121. BIO*122, BIO*204, and BIO*205LThis course provides students with an introduction to limnology, emphasizing the physical, chemical and biological function of north temperate lakes and streams. Lecture topics include the physics and chemistry of continental waters, the major biotic communities, interactions among these communities, and interactions between humans and the aquatic environment. Laboratory exercises and field trips provide a practical introduction to the methods of aquatic sciences.BIO 488 —Internship in Environmental ScienceTraining and professional experience in the environment. Interns perform service training, keep a written journal, and write a personal career evaluation based on the internship experience. Department chair permission required.BIO 489 —Health Studies InternshipThe health studies internship is an immersive hands-on experience in a particular aspect of health care. Individuals must perform a minimum of 60 hours of structured, closely monitored training, maintain a written journal, and write a personal career evaluation based on the experience. Biology department chair permission required.BIO 497 —Independent Study Upper class status - junior or senior.  A 3.0 GPA in the major.  The acceptance of his/her proposed work by a department faculty member.  Completed work on the project by the end of one semester - written report.BIO 498 —Independent Study Upper class status - junior or senior.  A 3.0 GPA in the major.  The acceptance of his/her proposed work by a department faculty member.  Completed work on the project by the end of one semester - written report.BIO 499 —Independent Study A 3.0 GPA in the major.  The acceptance of his/her proposed work by a department faculty member.  Completed work on the project by the end of one semester - written report.",
            "instructors": [],
            "textbooks": [],
            "zoom_link": null
        },
        {
            "number": "121",
            "title": "122 and includes an investigative approach to the study of all living organisms",
            "description": "BIO 124L —Gen Biology Lab IIPrerequisite Take BIO*122This laboratory is designed to be taken concurrently with BIO 121-122 and includes an investigative approach to the study of all living organisms.BIO 189 —Prehealth Career StudiesThis is a course designed to introduce students early in their studies to the health care careers. Individual off-campus health sciences experiences sponsored by appropriate organizations, companies and private practitioners provide unpaid internships with a minimum of 60 hours of student service. Biology department chair permission required.BIO 198 —Introduction to Scientific ResearchThis course is designed to introduce students to the principles of scientific research, analyzing primary literature, ethics in research, science communication, and career development.BIO 199 —Intro to Scientific Research IIThis course is designed to allow first-year students the opportunity to rotate through scientific research labs in preparation for long-term faculty-student research collaborations.BIO 201 —Global HealthPrerequisite Take BIO*106Public health issues often transcend traditional boundaries and are rapidly changing in response to technological change and globalization. This course will focus on applying public health principles in both developed and developing countries to understand the links between health and economic and social development.BIO 202 —The History of Modern SciencePrerequisite Take BIO*121, BIO*123L, BIO*122, and BIO*124LThis course surveys the history of modern science, beginning with the Copernican  model of the universe. It will cover the evolution of scientific theories and the scientists responsible for the major discoveries in Astronomy, Physics, Chemistry, Biology, and Geology.BIO 204 —EcologyPrerequisite Take BIO*121, BIO*123L, BIO*122, and BIO*124LA course relating ecological principles to studies in the laboratory and field. Topics include population dynamics, energy flow in ecosystems, and species interactions.BIO 205L —Ecology LaboratoryPrerequisite Take BIO*204A course relating ecological principles to studies in the laboratory and field. Topics include population dynamics, energy flow in ecosystems, and species interactions.BIO 210 —BotanyPrerequisite Take BIO*121, BIO*122, BIO*123L, and BIO*124LA study of the basic principles of botany, and a survey of the plant kingdom with emphasis on the morphology and physiology of higher plants.BIO 212 —MicrobiologyPrerequisite TakeBIO 213LconcurrentlyA study of the basic principles of microbiology involving pathogenic and nonpathogenic organisms and their relation to medicine, sanitation, agriculture, and industry. Laboratory study is concerned with the morphology and physiology of microorganisms, and with their application in identification.BIO 213L —Microbiology LabPrerequisite Take BIO*212Laboratory study concerned with the morphology and physiology of microorganisms, and with their application in identification.BIO 215 —General PathophysiologyPrerequisite Must have taken NUR*354;This course is designed to correlate basic knowledge of normal physiology with dysfunction of body mechanisms. The student will gain a basic understanding of the processes of disease through study of causative mechanisms and the signs and symptoms which reflect disease.BIO 221 —EvolutionPrerequisite Take BIO*121, BIO*122, BIO*123L, AND BIO*124LNothing in biology makes sense except in the light of evolution. This course covers the diversity of life on earth and the ongoing evolutionary processes that affect all biology from the ecosystem to the hospital. Topics include natural selection, speciation, diversity on earth, molecular processes and primate evolution. Cross-listed asENV 221.BIO 222 —BioinformaticsPrerequisite take BIO*121, BIO*122, BIO*123L, and BIO*124LBioinformatics is the study of biological phenomena and the data generated from such studies with the assistance of computers. Bioinformatics relies on computers for the acquisition, storage, analysis, manipulation, management and dissemination of biological information. This is an introductory course to the problems and promise in this field.BIO 231 —Anatomy & Physiology IPrerequisite TakeBIO 233LA unified study of the structure and function of the human body. The course will survey the anatomy and physiology of the major types of human cells, tissues, organs and organ systems. An understanding of the human body as a self-regulated, dynamic community of interrelated living parts will be emphasized. Designed to be taken sequentially. Must be taken concurrently with laboratory.BIO 232 —Anatomy & Physiology IIPrerequisite Take BIO*234LA unified study of the structure and function of the human body. The course will survey the anatomy and physiology of the major types of human cells, tissues, organs and organ systems. An understanding of the human body as a self-regulated, dynamic community of interrelated living parts will be emphasized. Designed to be taken sequentially. Must be taken concurrently with laboratory.BIO 233L —Anatomy & Physiology Lab IPrerequisite Take BIO*231The laboratory involves a series of student-performed exercises designed to illustrate, by observation and experimentation, the major concepts of human anatomy and physiology. Designed to be taken sequentially. Must be taken concurrently with lecture.BIO 234L —Anatomy & Physiology Lab IIPrerequisite Take BIO*232The laboratory involves a series of student-performed exercises designed to illustrate, by observation and experimentation, the major concepts of human anatomy and physiology. Designed to be taken sequentially. Must be taken concurrently with lecture.BIO 237 —Comparative Anatomy TutorialPrerequisite Take BIO*121 and BIO*123LIn the true sense of a tutorial, the instructor provides individual attention to a small group of students in the art of dissecting a cat. The anatomy dissection is accompanied by lecture on the underlying physiology and comparisons to human anatomy and physiology.BIO 246 —Genetics IPrerequisite Must have taken BIO*121, BIO*122, BIO*123L and BIO*124L;A study of Mendelian genetics and the molecular biology of the gene. Basic principles of genetics, as they apply in plants and animals, are studied in the laboratory with special emphasis on Drosophilia. - four semester hoursBIO 298 —Fellowship ResearchStudent-faculty collaborative research for fellowship students.BIO 299 —Fellowship Research IIPrerequisite Take BIO*298BIO 302 —Nature StudyThis course fosters a personal, hands-on approach to understanding the natural world. It is designed to help the student become a better observer, communicator, and educator in the field of nature study. The laboratory provides opportunities to visit nature sites, conduct field studies, plan and implement educational projects, and learn from accomplished naturalists and educators. The course may include a service learning component.BIO 304 —Field Ecology & LabA course in the ecology of local plants and their habitats, designed for the student with minimal experience in ecology. By learning basic plant structure and terminology, and the interactions between plants and the environment, the student will learn the ecology of plants in a natural setting. Course activities include field trips to areas of interest and laboratory experiments.BIO 310 —Medical BotanyA survey of plants with physiologically active properties of medicinal interest. Emphasis is placed on the biology, folk uses, ethnobotany, and natural history of useful angiosperms.BIO 312 —Conservation EcologyPrerequisite Take BIO*204 and BIO*205LThe practice and theory of conservation ecology. Current and future threats to populations and ecosystems, methods of protection, and the methods used to assess conservation efforts will be covered. Case studies include restoration, extinction, and wildlife management. Students will apply conservation ecology methods to real world threatened populations. Cross-listed asENV 312.BIO 315 —PharmacologyPrerequisite Take BIO*121, BIO*122, CHE*111, CHE*112, and BIO*334The course is designed to introduce one to the study of the interaction of chemicals with living organisms. Pharmacology encompasses the disciplines of organic chemistry, physiology, pathology, biochemistry, and molecular biology, and as such we will investigate drug action at several levels: whole body, organ, tissue, cell, and molecular. We will discuss the intricacies of the various classes of drugs, and discuss the factors that are used to assess the safety and efficacy of a drug.BIO 316 —Virology/ImmunologyPrerequisite Take BIO*121, BIO*122, BIO*123L, and BIO*124LThe course material covers two areas of medical importance: virology, some of the predominant disease-causing agents; and immunology, our body's major defense mechanisms against disease. Topics to be covered include the history, biology, molecular structure, and evolutionary significance of the components of these two systems. The recent findings in the fields will be highlighted, as they pertain to our understanding of disease.BIO 334 —Cell BiologyPrerequisite Take BIO*121, BIO*122, BIO*123L, and BIO*124LA study of the cell with emphasis on the molecular aspects of cell structure and function. Biochemical processes are emphasized.BIO 337 —Intro to OncologyPrerequisite Take BIO*121, BIO*122, BIO*123L, and BIO*124LThe course encompasses the basic biology and clinical aspects of cancer. Topics to be covered include the history of oncology, basic cancer biology, and current concepts relative to the cause, prevention, detection, and treatment of benign and malignant neoplasias.BIO 338 —Cell PhysiologyPrerequisite Take BIO*334A contemporary perspective on cell function drawing upon recent findings in physiology, biochemistry, biophysics, and molecular biology. The course will highlight the cellular processes that occur outside the nucleus . Emphasis will be placed on learning quantitative approaches to solving problems in cell physiology.BIO 345 —Experimental Design & Analysis With LabPrerequisite Take BIO*121, and BIO*122Mathematics is a fundamental component of Biology. In this course, experimental design, statistics, and simple modeling are presented from a biological perspective, in preparation for thesis and post-baccalaureate research, and for preparation for employment in Biology.BIO 347 —GeneticsPrerequisite Must have takenBIO 121andBIO 122This course expands on the concepts of heredity, with emphasis placed on the genetics of both prokaryotic and eukaryotic microorganisms. Classical genetic analysis, non-Mendelian inheritance, molecular mechanism of genetic change, and human genetics will be covered.BIO 348L —Genetics LaboratoryPrerequisite Take BIO*347BIO 352 —Microscopic Anatomy & LabPrerequisite Take BIO*121, BIO*122, BIO*123L, and BIO*124LA study of the cells and tissues, and their involvement in organ structure. Cytological and histological slides are prepared and studied in the laboratory.BIO 360 —PathophysiologyPrerequisite TakeBIO 231,BIO 232,BIO 233LandBIO 234LThis course is designed to correlate basic knowledge of normal physiology with dysfunction of body mechanisms. The student will gain a basic understanding of the processes of disease through study of causative mechanisms and the signs and symptoms which reflect disease.BIO 361L —Pathophysiology LaboratoryPrerequisite Take BIO*231, and BIO*232This course is designed to correlate basic knowledge of normal physiology with dysfunction of body mechanisms. The student will gain a basic understanding of the processes of disease through study of causative mechanisms and the signs and symptoms which reflect disease.BIO 373 —AstrobiologyPrerequisite Take BIO*121, BIO*122, BIO*123L, and BIO*124LAstrobiology is the study of life as a planetary phenomenon. This course will explore life's origin, history, and evolution on Earth, and the potential for life elsewhere in the universe. It will examine the requirements and limits of life, from elemental to galactic, drawing from biology, geology, physics, and chemistry.BIO 380 —Genomics & ProteomicsPrerequisite Take BIO*121, BIO*122, BIO*123L, BIO*124L, and BIO*222Genomics and Proteomics is the detailed study of technologies and methodologies for evaluation of genomic and protein functions. These methods are used to interpret biological regulation of DNA sequences, the RNAs that are copied from them, and the proteins that are synthesized from these RNAs. The application of these technologies to problems in biology ranging from organism development to human diseases will be discussed.BIO 385 —Topic:Prerequisite Take BIO*121, BIO*122, BIO*123L, and BIO*124LThis special topics course provides students with opportunities to study current topics in the biological sciences. Biology is a rapidly changing field and thus many current issues are unable to be fully addressed in traditional course offerings. This includes topics in environmental science, bioinformatics and other evolving fields. Students may repeat the course two additional times as the topic changes.BIO 391 —Bio-Analy Tech & Lab IPrerequisite Take BIO*121, BIO*122, BIO*123L, BIO*124L, and BIO*334Lectures and laboratories will emphasize contemporary bioanalytical and biological research at the cell and molecular levels.BIO 391will stress methods employed in studies of cell physiology.BIO 392will emphasize DNA methods of gene recombination in prokaryotic and eukaryotic systems. Theoretical and practical competence will be developed in all techniques.BIO 392 —Bio-Analy Tech & Lab IIPrerequisite Take BIO*121, BIO*122, BIO*123L, BIO*124L, and BIO*334Lectures and laboratories will emphasize contemporary bioanalytical and biological research at the cell and molecular levels.BIO 391will stress methods employed in studies of cell physiology.BIO 392will emphasize DNA methods of gene recombination in prokaryotic and eukaryotic systems. Theoretical and practical competence will be developed in all techniques.BIO 401 —Biology SeminarRequired of all B.S. and B.A. biology majors beginning with students entering their senior year. The goal is to assure the readiness of students for job placement, and/or entrance into professional or graduate school by assessing the students knowledge and understanding of the field and their writing and speaking skills.BIO 402 —Biology SeminarPrerequisite TakeBIO 401Required of all B.S. and B.A. biology majors beginning with students entering senior year. The presentation of a research seminar and an in depth research literature review will be done to asses the students knowledge and understanding of the field and their writing and speaking skills.BIO 403 —Honors Thesis IIndividual research of a substantive nature pursued in the students major field of study. The research will conclude in a written thesis on an original project, and an oral defense.BIO 404 —Honors Thesis IIIndividual research of a substantive nature pursued in the students major field of study. The research will conclude in a written thesis on an original project, and an oral defense.BIO 410 —Projects in Public HealthPrerequisite Take BIO*106 and BIO*107This service learning and seminar course requires the student to apply public health concepts to his/her major area of study by working with a community partner on a project in a relevant area of public health. Students will meet weekly to discuss their projects.BIO 422 —Bioinformatics IIPrerequisite Take BIO*222The field of bioinformatics has developed as a result of the integration of information and approaches from a number of disciplines. This is an advanced course where on will be introduced to the challenges and projected outcomes of the field. It is expected that students entering this course are familiar with biological and computational techniques, as they will be used as the foundation for the laboratory portion of the course.BIO 427 —Environmental Microbio & LabPrerequisite Take BIO*212 and BIO*213LBIO 432 —Development & LabPrerequisite Take BIO*334To provide a modern view of developmental biology unifying the approaches of cell biology, biochemistry, molecular biology, and genetics. This course is designed for students who have had one year of introductory biology, and one semester of cell biology. The communication of biological concepts, ideas, and experimentation, in verbal and written form, is an integral component of this course. The laboratory emphasizes molecular aspects of development.BIO 435 —Plant PhysiologyPrerequisite Take BIO*121, BIO*122, BIO*123L, BIO*124L, and BIO*210This course deals with plant physiology at an organismal level and with the physiological ecology or interactions of plants with their environment. The unique features of plant photosynthesis, water relations and metabolic processes will be studied in a variety of taxa and settings. Laboratory will include field trips to local areas of interest and experiments in the laboratory.BIO 435L —Plant Physiology LabPrerequisite Take BIO*121, BIO*122, BIO*123L, and BIO*124LLaboratory will include field trips to local areas of interest and experiments in the laboratory.BIO 436 —Human GeneticsPrerequisite Take BIO*334The role of molecular regulatory mechanisms as they pertain to the structure and function of genes in eukaryotic systems, the evolution of genomes and molecular techniques are emphasized.BIO 437L —Medical Genetics LabPrerequisite Take BIO*436The bioinformatics component of Medical Genetics . A semester-long research project will be used to teach students how to use DNA sequence analysis to determine evolutionary relationships or explore the genetics of human disease. Research projects will vary depending upon the expertise and interest of the instructor.BIO 441 —Comp Animal Phys & LabPrerequisite Take BIO*121, BIO*122, BIO*123L, BIO*124L, and BIO*334An advanced course in physiology intended to provide in-depth coverage of functions of selected cells, tissues, organs, and organ systems. Laboratory will feature experiments using appropriate animal model systems.BIO 445 —LimnologyPrerequisite Take BIO*121. BIO*122, BIO*204, and BIO*205LThis course provides students with an introduction to limnology, emphasizing the physical, chemical and biological function of north temperate lakes and streams. Lecture topics include the physics and chemistry of continental waters, the major biotic communities, interactions among these communities, and interactions between humans and the aquatic environment. Laboratory exercises and field trips provide a practical introduction to the methods of aquatic sciences.BIO 488 —Internship in Environmental ScienceTraining and professional experience in the environment. Interns perform service training, keep a written journal, and write a personal career evaluation based on the internship experience. Department chair permission required.BIO 489 —Health Studies InternshipThe health studies internship is an immersive hands-on experience in a particular aspect of health care. Individuals must perform a minimum of 60 hours of structured, closely monitored training, maintain a written journal, and write a personal career evaluation based on the experience. Biology department chair permission required.BIO 497 —Independent Study Upper class status - junior or senior.  A 3.0 GPA in the major.  The acceptance of his/her proposed work by a department faculty member.  Completed work on the project by the end of one semester - written report.BIO 498 —Independent Study Upper class status - junior or senior.  A 3.0 GPA in the major.  The acceptance of his/her proposed work by a department faculty member.  Completed work on the project by the end of one semester - written report.BIO 499 —Independent Study A 3.0 GPA in the major.  The acceptance of his/her proposed work by a department faculty member.  Completed work on the project by the end of one semester - written report.",
            "instructors": [],
            "textbooks": [],
            "zoom_link": null
        },
        {
            "number": "121",
            "title": "122 and includes an investigative approach to the study of all living organisms",
            "description": "BIO 124L —Gen Biology Lab IIPrerequisite Take BIO*122This laboratory is designed to be taken concurrently with BIO 121-122 and includes an investigative approach to the study of all living organisms.BIO 189 —Prehealth Career StudiesThis is a course designed to introduce students early in their studies to the health care careers. Individual off-campus health sciences experiences sponsored by appropriate organizations, companies and private practitioners provide unpaid internships with a minimum of 60 hours of student service. Biology department chair permission required.BIO 198 —Introduction to Scientific ResearchThis course is designed to introduce students to the principles of scientific research, analyzing primary literature, ethics in research, science communication, and career development.BIO 199 —Intro to Scientific Research IIThis course is designed to allow first-year students the opportunity to rotate through scientific research labs in preparation for long-term faculty-student research collaborations.BIO 201 —Global HealthPrerequisite Take BIO*106Public health issues often transcend traditional boundaries and are rapidly changing in response to technological change and globalization. This course will focus on applying public health principles in both developed and developing countries to understand the links between health and economic and social development.BIO 202 —The History of Modern SciencePrerequisite Take BIO*121, BIO*123L, BIO*122, and BIO*124LThis course surveys the history of modern science, beginning with the Copernican  model of the universe. It will cover the evolution of scientific theories and the scientists responsible for the major discoveries in Astronomy, Physics, Chemistry, Biology, and Geology.BIO 204 —EcologyPrerequisite Take BIO*121, BIO*123L, BIO*122, and BIO*124LA course relating ecological principles to studies in the laboratory and field. Topics include population dynamics, energy flow in ecosystems, and species interactions.BIO 205L —Ecology LaboratoryPrerequisite Take BIO*204A course relating ecological principles to studies in the laboratory and field. Topics include population dynamics, energy flow in ecosystems, and species interactions.BIO 210 —BotanyPrerequisite Take BIO*121, BIO*122, BIO*123L, and BIO*124LA study of the basic principles of botany, and a survey of the plant kingdom with emphasis on the morphology and physiology of higher plants.BIO 212 —MicrobiologyPrerequisite TakeBIO 213LconcurrentlyA study of the basic principles of microbiology involving pathogenic and nonpathogenic organisms and their relation to medicine, sanitation, agriculture, and industry. Laboratory study is concerned with the morphology and physiology of microorganisms, and with their application in identification.BIO 213L —Microbiology LabPrerequisite Take BIO*212Laboratory study concerned with the morphology and physiology of microorganisms, and with their application in identification.BIO 215 —General PathophysiologyPrerequisite Must have taken NUR*354;This course is designed to correlate basic knowledge of normal physiology with dysfunction of body mechanisms. The student will gain a basic understanding of the processes of disease through study of causative mechanisms and the signs and symptoms which reflect disease.BIO 221 —EvolutionPrerequisite Take BIO*121, BIO*122, BIO*123L, AND BIO*124LNothing in biology makes sense except in the light of evolution. This course covers the diversity of life on earth and the ongoing evolutionary processes that affect all biology from the ecosystem to the hospital. Topics include natural selection, speciation, diversity on earth, molecular processes and primate evolution. Cross-listed asENV 221.BIO 222 —BioinformaticsPrerequisite take BIO*121, BIO*122, BIO*123L, and BIO*124LBioinformatics is the study of biological phenomena and the data generated from such studies with the assistance of computers. Bioinformatics relies on computers for the acquisition, storage, analysis, manipulation, management and dissemination of biological information. This is an introductory course to the problems and promise in this field.BIO 231 —Anatomy & Physiology IPrerequisite TakeBIO 233LA unified study of the structure and function of the human body. The course will survey the anatomy and physiology of the major types of human cells, tissues, organs and organ systems. An understanding of the human body as a self-regulated, dynamic community of interrelated living parts will be emphasized. Designed to be taken sequentially. Must be taken concurrently with laboratory.BIO 232 —Anatomy & Physiology IIPrerequisite Take BIO*234LA unified study of the structure and function of the human body. The course will survey the anatomy and physiology of the major types of human cells, tissues, organs and organ systems. An understanding of the human body as a self-regulated, dynamic community of interrelated living parts will be emphasized. Designed to be taken sequentially. Must be taken concurrently with laboratory.BIO 233L —Anatomy & Physiology Lab IPrerequisite Take BIO*231The laboratory involves a series of student-performed exercises designed to illustrate, by observation and experimentation, the major concepts of human anatomy and physiology. Designed to be taken sequentially. Must be taken concurrently with lecture.BIO 234L —Anatomy & Physiology Lab IIPrerequisite Take BIO*232The laboratory involves a series of student-performed exercises designed to illustrate, by observation and experimentation, the major concepts of human anatomy and physiology. Designed to be taken sequentially. Must be taken concurrently with lecture.BIO 237 —Comparative Anatomy TutorialPrerequisite Take BIO*121 and BIO*123LIn the true sense of a tutorial, the instructor provides individual attention to a small group of students in the art of dissecting a cat. The anatomy dissection is accompanied by lecture on the underlying physiology and comparisons to human anatomy and physiology.BIO 246 —Genetics IPrerequisite Must have taken BIO*121, BIO*122, BIO*123L and BIO*124L;A study of Mendelian genetics and the molecular biology of the gene. Basic principles of genetics, as they apply in plants and animals, are studied in the laboratory with special emphasis on Drosophilia. - four semester hoursBIO 298 —Fellowship ResearchStudent-faculty collaborative research for fellowship students.BIO 299 —Fellowship Research IIPrerequisite Take BIO*298BIO 302 —Nature StudyThis course fosters a personal, hands-on approach to understanding the natural world. It is designed to help the student become a better observer, communicator, and educator in the field of nature study. The laboratory provides opportunities to visit nature sites, conduct field studies, plan and implement educational projects, and learn from accomplished naturalists and educators. The course may include a service learning component.BIO 304 —Field Ecology & LabA course in the ecology of local plants and their habitats, designed for the student with minimal experience in ecology. By learning basic plant structure and terminology, and the interactions between plants and the environment, the student will learn the ecology of plants in a natural setting. Course activities include field trips to areas of interest and laboratory experiments.BIO 310 —Medical BotanyA survey of plants with physiologically active properties of medicinal interest. Emphasis is placed on the biology, folk uses, ethnobotany, and natural history of useful angiosperms.BIO 312 —Conservation EcologyPrerequisite Take BIO*204 and BIO*205LThe practice and theory of conservation ecology. Current and future threats to populations and ecosystems, methods of protection, and the methods used to assess conservation efforts will be covered. Case studies include restoration, extinction, and wildlife management. Students will apply conservation ecology methods to real world threatened populations. Cross-listed asENV 312.BIO 315 —PharmacologyPrerequisite Take BIO*121, BIO*122, CHE*111, CHE*112, and BIO*334The course is designed to introduce one to the study of the interaction of chemicals with living organisms. Pharmacology encompasses the disciplines of organic chemistry, physiology, pathology, biochemistry, and molecular biology, and as such we will investigate drug action at several levels: whole body, organ, tissue, cell, and molecular. We will discuss the intricacies of the various classes of drugs, and discuss the factors that are used to assess the safety and efficacy of a drug.BIO 316 —Virology/ImmunologyPrerequisite Take BIO*121, BIO*122, BIO*123L, and BIO*124LThe course material covers two areas of medical importance: virology, some of the predominant disease-causing agents; and immunology, our body's major defense mechanisms against disease. Topics to be covered include the history, biology, molecular structure, and evolutionary significance of the components of these two systems. The recent findings in the fields will be highlighted, as they pertain to our understanding of disease.BIO 334 —Cell BiologyPrerequisite Take BIO*121, BIO*122, BIO*123L, and BIO*124LA study of the cell with emphasis on the molecular aspects of cell structure and function. Biochemical processes are emphasized.BIO 337 —Intro to OncologyPrerequisite Take BIO*121, BIO*122, BIO*123L, and BIO*124LThe course encompasses the basic biology and clinical aspects of cancer. Topics to be covered include the history of oncology, basic cancer biology, and current concepts relative to the cause, prevention, detection, and treatment of benign and malignant neoplasias.BIO 338 —Cell PhysiologyPrerequisite Take BIO*334A contemporary perspective on cell function drawing upon recent findings in physiology, biochemistry, biophysics, and molecular biology. The course will highlight the cellular processes that occur outside the nucleus . Emphasis will be placed on learning quantitative approaches to solving problems in cell physiology.BIO 345 —Experimental Design & Analysis With LabPrerequisite Take BIO*121, and BIO*122Mathematics is a fundamental component of Biology. In this course, experimental design, statistics, and simple modeling are presented from a biological perspective, in preparation for thesis and post-baccalaureate research, and for preparation for employment in Biology.BIO 347 —GeneticsPrerequisite Must have takenBIO 121andBIO 122This course expands on the concepts of heredity, with emphasis placed on the genetics of both prokaryotic and eukaryotic microorganisms. Classical genetic analysis, non-Mendelian inheritance, molecular mechanism of genetic change, and human genetics will be covered.BIO 348L —Genetics LaboratoryPrerequisite Take BIO*347BIO 352 —Microscopic Anatomy & LabPrerequisite Take BIO*121, BIO*122, BIO*123L, and BIO*124LA study of the cells and tissues, and their involvement in organ structure. Cytological and histological slides are prepared and studied in the laboratory.BIO 360 —PathophysiologyPrerequisite TakeBIO 231,BIO 232,BIO 233LandBIO 234LThis course is designed to correlate basic knowledge of normal physiology with dysfunction of body mechanisms. The student will gain a basic understanding of the processes of disease through study of causative mechanisms and the signs and symptoms which reflect disease.BIO 361L —Pathophysiology LaboratoryPrerequisite Take BIO*231, and BIO*232This course is designed to correlate basic knowledge of normal physiology with dysfunction of body mechanisms. The student will gain a basic understanding of the processes of disease through study of causative mechanisms and the signs and symptoms which reflect disease.BIO 373 —AstrobiologyPrerequisite Take BIO*121, BIO*122, BIO*123L, and BIO*124LAstrobiology is the study of life as a planetary phenomenon. This course will explore life's origin, history, and evolution on Earth, and the potential for life elsewhere in the universe. It will examine the requirements and limits of life, from elemental to galactic, drawing from biology, geology, physics, and chemistry.BIO 380 —Genomics & ProteomicsPrerequisite Take BIO*121, BIO*122, BIO*123L, BIO*124L, and BIO*222Genomics and Proteomics is the detailed study of technologies and methodologies for evaluation of genomic and protein functions. These methods are used to interpret biological regulation of DNA sequences, the RNAs that are copied from them, and the proteins that are synthesized from these RNAs. The application of these technologies to problems in biology ranging from organism development to human diseases will be discussed.BIO 385 —Topic:Prerequisite Take BIO*121, BIO*122, BIO*123L, and BIO*124LThis special topics course provides students with opportunities to study current topics in the biological sciences. Biology is a rapidly changing field and thus many current issues are unable to be fully addressed in traditional course offerings. This includes topics in environmental science, bioinformatics and other evolving fields. Students may repeat the course two additional times as the topic changes.BIO 391 —Bio-Analy Tech & Lab IPrerequisite Take BIO*121, BIO*122, BIO*123L, BIO*124L, and BIO*334Lectures and laboratories will emphasize contemporary bioanalytical and biological research at the cell and molecular levels.BIO 391will stress methods employed in studies of cell physiology.BIO 392will emphasize DNA methods of gene recombination in prokaryotic and eukaryotic systems. Theoretical and practical competence will be developed in all techniques.BIO 392 —Bio-Analy Tech & Lab IIPrerequisite Take BIO*121, BIO*122, BIO*123L, BIO*124L, and BIO*334Lectures and laboratories will emphasize contemporary bioanalytical and biological research at the cell and molecular levels.BIO 391will stress methods employed in studies of cell physiology.BIO 392will emphasize DNA methods of gene recombination in prokaryotic and eukaryotic systems. Theoretical and practical competence will be developed in all techniques.BIO 401 —Biology SeminarRequired of all B.S. and B.A. biology majors beginning with students entering their senior year. The goal is to assure the readiness of students for job placement, and/or entrance into professional or graduate school by assessing the students knowledge and understanding of the field and their writing and speaking skills.BIO 402 —Biology SeminarPrerequisite TakeBIO 401Required of all B.S. and B.A. biology majors beginning with students entering senior year. The presentation of a research seminar and an in depth research literature review will be done to asses the students knowledge and understanding of the field and their writing and speaking skills.BIO 403 —Honors Thesis IIndividual research of a substantive nature pursued in the students major field of study. The research will conclude in a written thesis on an original project, and an oral defense.BIO 404 —Honors Thesis IIIndividual research of a substantive nature pursued in the students major field of study. The research will conclude in a written thesis on an original project, and an oral defense.BIO 410 —Projects in Public HealthPrerequisite Take BIO*106 and BIO*107This service learning and seminar course requires the student to apply public health concepts to his/her major area of study by working with a community partner on a project in a relevant area of public health. Students will meet weekly to discuss their projects.BIO 422 —Bioinformatics IIPrerequisite Take BIO*222The field of bioinformatics has developed as a result of the integration of information and approaches from a number of disciplines. This is an advanced course where on will be introduced to the challenges and projected outcomes of the field. It is expected that students entering this course are familiar with biological and computational techniques, as they will be used as the foundation for the laboratory portion of the course.BIO 427 —Environmental Microbio & LabPrerequisite Take BIO*212 and BIO*213LBIO 432 —Development & LabPrerequisite Take BIO*334To provide a modern view of developmental biology unifying the approaches of cell biology, biochemistry, molecular biology, and genetics. This course is designed for students who have had one year of introductory biology, and one semester of cell biology. The communication of biological concepts, ideas, and experimentation, in verbal and written form, is an integral component of this course. The laboratory emphasizes molecular aspects of development.BIO 435 —Plant PhysiologyPrerequisite Take BIO*121, BIO*122, BIO*123L, BIO*124L, and BIO*210This course deals with plant physiology at an organismal level and with the physiological ecology or interactions of plants with their environment. The unique features of plant photosynthesis, water relations and metabolic processes will be studied in a variety of taxa and settings. Laboratory will include field trips to local areas of interest and experiments in the laboratory.BIO 435L —Plant Physiology LabPrerequisite Take BIO*121, BIO*122, BIO*123L, and BIO*124LLaboratory will include field trips to local areas of interest and experiments in the laboratory.BIO 436 —Human GeneticsPrerequisite Take BIO*334The role of molecular regulatory mechanisms as they pertain to the structure and function of genes in eukaryotic systems, the evolution of genomes and molecular techniques are emphasized.BIO 437L —Medical Genetics LabPrerequisite Take BIO*436The bioinformatics component of Medical Genetics . A semester-long research project will be used to teach students how to use DNA sequence analysis to determine evolutionary relationships or explore the genetics of human disease. Research projects will vary depending upon the expertise and interest of the instructor.BIO 441 —Comp Animal Phys & LabPrerequisite Take BIO*121, BIO*122, BIO*123L, BIO*124L, and BIO*334An advanced course in physiology intended to provide in-depth coverage of functions of selected cells, tissues, organs, and organ systems. Laboratory will feature experiments using appropriate animal model systems.BIO 445 —LimnologyPrerequisite Take BIO*121. BIO*122, BIO*204, and BIO*205LThis course provides students with an introduction to limnology, emphasizing the physical, chemical and biological function of north temperate lakes and streams. Lecture topics include the physics and chemistry of continental waters, the major biotic communities, interactions among these communities, and interactions between humans and the aquatic environment. Laboratory exercises and field trips provide a practical introduction to the methods of aquatic sciences.BIO 488 —Internship in Environmental ScienceTraining and professional experience in the environment. Interns perform service training, keep a written journal, and write a personal career evaluation based on the internship experience. Department chair permission required.BIO 489 —Health Studies InternshipThe health studies internship is an immersive hands-on experience in a particular aspect of health care. Individuals must perform a minimum of 60 hours of structured, closely monitored training, maintain a written journal, and write a personal career evaluation based on the experience. Biology department chair permission required.BIO 497 —Independent Study Upper class status - junior or senior.  A 3.0 GPA in the major.  The acceptance of his/her proposed work by a department faculty member.  Completed work on the project by the end of one semester - written report.BIO 498 —Independent Study Upper class status - junior or senior.  A 3.0 GPA in the major.  The acceptance of his/her proposed work by a department faculty member.  Completed work on the project by the end of one semester - written report.BIO 499 —Independent Study A 3.0 GPA in the major.  The acceptance of his/her proposed work by a department faculty member.  Completed work on the project by the end of one semester - written report.",
            "instructors": [],
            "textbooks": [],
            "zoom_link": null
        },
        {
            "number": "121",
            "title": "122 and includes an investigative approach to the study of all living organisms",
            "description": "BIO 124L —Gen Biology Lab IIPrerequisite Take BIO*122This laboratory is designed to be taken concurrently with BIO 121-122 and includes an investigative approach to the study of all living organisms.BIO 189 —Prehealth Career StudiesThis is a course designed to introduce students early in their studies to the health care careers. Individual off-campus health sciences experiences sponsored by appropriate organizations, companies and private practitioners provide unpaid internships with a minimum of 60 hours of student service. Biology department chair permission required.BIO 198 —Introduction to Scientific ResearchThis course is designed to introduce students to the principles of scientific research, analyzing primary literature, ethics in research, science communication, and career development.BIO 199 —Intro to Scientific Research IIThis course is designed to allow first-year students the opportunity to rotate through scientific research labs in preparation for long-term faculty-student research collaborations.BIO 201 —Global HealthPrerequisite Take BIO*106Public health issues often transcend traditional boundaries and are rapidly changing in response to technological change and globalization. This course will focus on applying public health principles in both developed and developing countries to understand the links between health and economic and social development.BIO 202 —The History of Modern SciencePrerequisite Take BIO*121, BIO*123L, BIO*122, and BIO*124LThis course surveys the history of modern science, beginning with the Copernican  model of the universe. It will cover the evolution of scientific theories and the scientists responsible for the major discoveries in Astronomy, Physics, Chemistry, Biology, and Geology.BIO 204 —EcologyPrerequisite Take BIO*121, BIO*123L, BIO*122, and BIO*124LA course relating ecological principles to studies in the laboratory and field. Topics include population dynamics, energy flow in ecosystems, and species interactions.BIO 205L —Ecology LaboratoryPrerequisite Take BIO*204A course relating ecological principles to studies in the laboratory and field. Topics include population dynamics, energy flow in ecosystems, and species interactions.BIO 210 —BotanyPrerequisite Take BIO*121, BIO*122, BIO*123L, and BIO*124LA study of the basic principles of botany, and a survey of the plant kingdom with emphasis on the morphology and physiology of higher plants.BIO 212 —MicrobiologyPrerequisite TakeBIO 213LconcurrentlyA study of the basic principles of microbiology involving pathogenic and nonpathogenic organisms and their relation to medicine, sanitation, agriculture, and industry. Laboratory study is concerned with the morphology and physiology of microorganisms, and with their application in identification.BIO 213L —Microbiology LabPrerequisite Take BIO*212Laboratory study concerned with the morphology and physiology of microorganisms, and with their application in identification.BIO 215 —General PathophysiologyPrerequisite Must have taken NUR*354;This course is designed to correlate basic knowledge of normal physiology with dysfunction of body mechanisms. The student will gain a basic understanding of the processes of disease through study of causative mechanisms and the signs and symptoms which reflect disease.BIO 221 —EvolutionPrerequisite Take BIO*121, BIO*122, BIO*123L, AND BIO*124LNothing in biology makes sense except in the light of evolution. This course covers the diversity of life on earth and the ongoing evolutionary processes that affect all biology from the ecosystem to the hospital. Topics include natural selection, speciation, diversity on earth, molecular processes and primate evolution. Cross-listed asENV 221.BIO 222 —BioinformaticsPrerequisite take BIO*121, BIO*122, BIO*123L, and BIO*124LBioinformatics is the study of biological phenomena and the data generated from such studies with the assistance of computers. Bioinformatics relies on computers for the acquisition, storage, analysis, manipulation, management and dissemination of biological information. This is an introductory course to the problems and promise in this field.BIO 231 —Anatomy & Physiology IPrerequisite TakeBIO 233LA unified study of the structure and function of the human body. The course will survey the anatomy and physiology of the major types of human cells, tissues, organs and organ systems. An understanding of the human body as a self-regulated, dynamic community of interrelated living parts will be emphasized. Designed to be taken sequentially. Must be taken concurrently with laboratory.BIO 232 —Anatomy & Physiology IIPrerequisite Take BIO*234LA unified study of the structure and function of the human body. The course will survey the anatomy and physiology of the major types of human cells, tissues, organs and organ systems. An understanding of the human body as a self-regulated, dynamic community of interrelated living parts will be emphasized. Designed to be taken sequentially. Must be taken concurrently with laboratory.BIO 233L —Anatomy & Physiology Lab IPrerequisite Take BIO*231The laboratory involves a series of student-performed exercises designed to illustrate, by observation and experimentation, the major concepts of human anatomy and physiology. Designed to be taken sequentially. Must be taken concurrently with lecture.BIO 234L —Anatomy & Physiology Lab IIPrerequisite Take BIO*232The laboratory involves a series of student-performed exercises designed to illustrate, by observation and experimentation, the major concepts of human anatomy and physiology. Designed to be taken sequentially. Must be taken concurrently with lecture.BIO 237 —Comparative Anatomy TutorialPrerequisite Take BIO*121 and BIO*123LIn the true sense of a tutorial, the instructor provides individual attention to a small group of students in the art of dissecting a cat. The anatomy dissection is accompanied by lecture on the underlying physiology and comparisons to human anatomy and physiology.BIO 246 —Genetics IPrerequisite Must have taken BIO*121, BIO*122, BIO*123L and BIO*124L;A study of Mendelian genetics and the molecular biology of the gene. Basic principles of genetics, as they apply in plants and animals, are studied in the laboratory with special emphasis on Drosophilia. - four semester hoursBIO 298 —Fellowship ResearchStudent-faculty collaborative research for fellowship students.BIO 299 —Fellowship Research IIPrerequisite Take BIO*298BIO 302 —Nature StudyThis course fosters a personal, hands-on approach to understanding the natural world. It is designed to help the student become a better observer, communicator, and educator in the field of nature study. The laboratory provides opportunities to visit nature sites, conduct field studies, plan and implement educational projects, and learn from accomplished naturalists and educators. The course may include a service learning component.BIO 304 —Field Ecology & LabA course in the ecology of local plants and their habitats, designed for the student with minimal experience in ecology. By learning basic plant structure and terminology, and the interactions between plants and the environment, the student will learn the ecology of plants in a natural setting. Course activities include field trips to areas of interest and laboratory experiments.BIO 310 —Medical BotanyA survey of plants with physiologically active properties of medicinal interest. Emphasis is placed on the biology, folk uses, ethnobotany, and natural history of useful angiosperms.BIO 312 —Conservation EcologyPrerequisite Take BIO*204 and BIO*205LThe practice and theory of conservation ecology. Current and future threats to populations and ecosystems, methods of protection, and the methods used to assess conservation efforts will be covered. Case studies include restoration, extinction, and wildlife management. Students will apply conservation ecology methods to real world threatened populations. Cross-listed asENV 312.BIO 315 —PharmacologyPrerequisite Take BIO*121, BIO*122, CHE*111, CHE*112, and BIO*334The course is designed to introduce one to the study of the interaction of chemicals with living organisms. Pharmacology encompasses the disciplines of organic chemistry, physiology, pathology, biochemistry, and molecular biology, and as such we will investigate drug action at several levels: whole body, organ, tissue, cell, and molecular. We will discuss the intricacies of the various classes of drugs, and discuss the factors that are used to assess the safety and efficacy of a drug.BIO 316 —Virology/ImmunologyPrerequisite Take BIO*121, BIO*122, BIO*123L, and BIO*124LThe course material covers two areas of medical importance: virology, some of the predominant disease-causing agents; and immunology, our body's major defense mechanisms against disease. Topics to be covered include the history, biology, molecular structure, and evolutionary significance of the components of these two systems. The recent findings in the fields will be highlighted, as they pertain to our understanding of disease.BIO 334 —Cell BiologyPrerequisite Take BIO*121, BIO*122, BIO*123L, and BIO*124LA study of the cell with emphasis on the molecular aspects of cell structure and function. Biochemical processes are emphasized.BIO 337 —Intro to OncologyPrerequisite Take BIO*121, BIO*122, BIO*123L, and BIO*124LThe course encompasses the basic biology and clinical aspects of cancer. Topics to be covered include the history of oncology, basic cancer biology, and current concepts relative to the cause, prevention, detection, and treatment of benign and malignant neoplasias.BIO 338 —Cell PhysiologyPrerequisite Take BIO*334A contemporary perspective on cell function drawing upon recent findings in physiology, biochemistry, biophysics, and molecular biology. The course will highlight the cellular processes that occur outside the nucleus . Emphasis will be placed on learning quantitative approaches to solving problems in cell physiology.BIO 345 —Experimental Design & Analysis With LabPrerequisite Take BIO*121, and BIO*122Mathematics is a fundamental component of Biology. In this course, experimental design, statistics, and simple modeling are presented from a biological perspective, in preparation for thesis and post-baccalaureate research, and for preparation for employment in Biology.BIO 347 —GeneticsPrerequisite Must have takenBIO 121andBIO 122This course expands on the concepts of heredity, with emphasis placed on the genetics of both prokaryotic and eukaryotic microorganisms. Classical genetic analysis, non-Mendelian inheritance, molecular mechanism of genetic change, and human genetics will be covered.BIO 348L —Genetics LaboratoryPrerequisite Take BIO*347BIO 352 —Microscopic Anatomy & LabPrerequisite Take BIO*121, BIO*122, BIO*123L, and BIO*124LA study of the cells and tissues, and their involvement in organ structure. Cytological and histological slides are prepared and studied in the laboratory.BIO 360 —PathophysiologyPrerequisite TakeBIO 231,BIO 232,BIO 233LandBIO 234LThis course is designed to correlate basic knowledge of normal physiology with dysfunction of body mechanisms. The student will gain a basic understanding of the processes of disease through study of causative mechanisms and the signs and symptoms which reflect disease.BIO 361L —Pathophysiology LaboratoryPrerequisite Take BIO*231, and BIO*232This course is designed to correlate basic knowledge of normal physiology with dysfunction of body mechanisms. The student will gain a basic understanding of the processes of disease through study of causative mechanisms and the signs and symptoms which reflect disease.BIO 373 —AstrobiologyPrerequisite Take BIO*121, BIO*122, BIO*123L, and BIO*124LAstrobiology is the study of life as a planetary phenomenon. This course will explore life's origin, history, and evolution on Earth, and the potential for life elsewhere in the universe. It will examine the requirements and limits of life, from elemental to galactic, drawing from biology, geology, physics, and chemistry.BIO 380 —Genomics & ProteomicsPrerequisite Take BIO*121, BIO*122, BIO*123L, BIO*124L, and BIO*222Genomics and Proteomics is the detailed study of technologies and methodologies for evaluation of genomic and protein functions. These methods are used to interpret biological regulation of DNA sequences, the RNAs that are copied from them, and the proteins that are synthesized from these RNAs. The application of these technologies to problems in biology ranging from organism development to human diseases will be discussed.BIO 385 —Topic:Prerequisite Take BIO*121, BIO*122, BIO*123L, and BIO*124LThis special topics course provides students with opportunities to study current topics in the biological sciences. Biology is a rapidly changing field and thus many current issues are unable to be fully addressed in traditional course offerings. This includes topics in environmental science, bioinformatics and other evolving fields. Students may repeat the course two additional times as the topic changes.BIO 391 —Bio-Analy Tech & Lab IPrerequisite Take BIO*121, BIO*122, BIO*123L, BIO*124L, and BIO*334Lectures and laboratories will emphasize contemporary bioanalytical and biological research at the cell and molecular levels.BIO 391will stress methods employed in studies of cell physiology.BIO 392will emphasize DNA methods of gene recombination in prokaryotic and eukaryotic systems. Theoretical and practical competence will be developed in all techniques.BIO 392 —Bio-Analy Tech & Lab IIPrerequisite Take BIO*121, BIO*122, BIO*123L, BIO*124L, and BIO*334Lectures and laboratories will emphasize contemporary bioanalytical and biological research at the cell and molecular levels.BIO 391will stress methods employed in studies of cell physiology.BIO 392will emphasize DNA methods of gene recombination in prokaryotic and eukaryotic systems. Theoretical and practical competence will be developed in all techniques.BIO 401 —Biology SeminarRequired of all B.S. and B.A. biology majors beginning with students entering their senior year. The goal is to assure the readiness of students for job placement, and/or entrance into professional or graduate school by assessing the students knowledge and understanding of the field and their writing and speaking skills.BIO 402 —Biology SeminarPrerequisite TakeBIO 401Required of all B.S. and B.A. biology majors beginning with students entering senior year. The presentation of a research seminar and an in depth research literature review will be done to asses the students knowledge and understanding of the field and their writing and speaking skills.BIO 403 —Honors Thesis IIndividual research of a substantive nature pursued in the students major field of study. The research will conclude in a written thesis on an original project, and an oral defense.BIO 404 —Honors Thesis IIIndividual research of a substantive nature pursued in the students major field of study. The research will conclude in a written thesis on an original project, and an oral defense.BIO 410 —Projects in Public HealthPrerequisite Take BIO*106 and BIO*107This service learning and seminar course requires the student to apply public health concepts to his/her major area of study by working with a community partner on a project in a relevant area of public health. Students will meet weekly to discuss their projects.BIO 422 —Bioinformatics IIPrerequisite Take BIO*222The field of bioinformatics has developed as a result of the integration of information and approaches from a number of disciplines. This is an advanced course where on will be introduced to the challenges and projected outcomes of the field. It is expected that students entering this course are familiar with biological and computational techniques, as they will be used as the foundation for the laboratory portion of the course.BIO 427 —Environmental Microbio & LabPrerequisite Take BIO*212 and BIO*213LBIO 432 —Development & LabPrerequisite Take BIO*334To provide a modern view of developmental biology unifying the approaches of cell biology, biochemistry, molecular biology, and genetics. This course is designed for students who have had one year of introductory biology, and one semester of cell biology. The communication of biological concepts, ideas, and experimentation, in verbal and written form, is an integral component of this course. The laboratory emphasizes molecular aspects of development.BIO 435 —Plant PhysiologyPrerequisite Take BIO*121, BIO*122, BIO*123L, BIO*124L, and BIO*210This course deals with plant physiology at an organismal level and with the physiological ecology or interactions of plants with their environment. The unique features of plant photosynthesis, water relations and metabolic processes will be studied in a variety of taxa and settings. Laboratory will include field trips to local areas of interest and experiments in the laboratory.BIO 435L —Plant Physiology LabPrerequisite Take BIO*121, BIO*122, BIO*123L, and BIO*124LLaboratory will include field trips to local areas of interest and experiments in the laboratory.BIO 436 —Human GeneticsPrerequisite Take BIO*334The role of molecular regulatory mechanisms as they pertain to the structure and function of genes in eukaryotic systems, the evolution of genomes and molecular techniques are emphasized.BIO 437L —Medical Genetics LabPrerequisite Take BIO*436The bioinformatics component of Medical Genetics . A semester-long research project will be used to teach students how to use DNA sequence analysis to determine evolutionary relationships or explore the genetics of human disease. Research projects will vary depending upon the expertise and interest of the instructor.BIO 441 —Comp Animal Phys & LabPrerequisite Take BIO*121, BIO*122, BIO*123L, BIO*124L, and BIO*334An advanced course in physiology intended to provide in-depth coverage of functions of selected cells, tissues, organs, and organ systems. Laboratory will feature experiments using appropriate animal model systems.BIO 445 —LimnologyPrerequisite Take BIO*121. BIO*122, BIO*204, and BIO*205LThis course provides students with an introduction to limnology, emphasizing the physical, chemical and biological function of north temperate lakes and streams. Lecture topics include the physics and chemistry of continental waters, the major biotic communities, interactions among these communities, and interactions between humans and the aquatic environment. Laboratory exercises and field trips provide a practical introduction to the methods of aquatic sciences.BIO 488 —Internship in Environmental ScienceTraining and professional experience in the environment. Interns perform service training, keep a written journal, and write a personal career evaluation based on the internship experience. Department chair permission required.BIO 489 —Health Studies InternshipThe health studies internship is an immersive hands-on experience in a particular aspect of health care. Individuals must perform a minimum of 60 hours of structured, closely monitored training, maintain a written journal, and write a personal career evaluation based on the experience. Biology department chair permission required.BIO 497 —Independent Study Upper class status - junior or senior.  A 3.0 GPA in the major.  The acceptance of his/her proposed work by a department faculty member.  Completed work on the project by the end of one semester - written report.BIO 498 —Independent Study Upper class status - junior or senior.  A 3.0 GPA in the major.  The acceptance of his/her proposed work by a department faculty member.  Completed work on the project by the end of one semester - written report.BIO 499 —Independent Study A 3.0 GPA in the major.  The acceptance of his/her proposed work by a department faculty member.  Completed work on the project by the end of one semester - written report.",
            "instructors": [],
            "textbooks": [],
            "zoom_link": null
        },
        {
            "number": "121",
            "title": "122 and includes an investigative approach to the study of all living organisms",
            "description": "BIO 124L —Gen Biology Lab IIPrerequisite Take BIO*122This laboratory is designed to be taken concurrently with BIO 121-122 and includes an investigative approach to the study of all living organisms.BIO 189 —Prehealth Career StudiesThis is a course designed to introduce students early in their studies to the health care careers. Individual off-campus health sciences experiences sponsored by appropriate organizations, companies and private practitioners provide unpaid internships with a minimum of 60 hours of student service. Biology department chair permission required.BIO 198 —Introduction to Scientific ResearchThis course is designed to introduce students to the principles of scientific research, analyzing primary literature, ethics in research, science communication, and career development.BIO 199 —Intro to Scientific Research IIThis course is designed to allow first-year students the opportunity to rotate through scientific research labs in preparation for long-term faculty-student research collaborations.BIO 201 —Global HealthPrerequisite Take BIO*106Public health issues often transcend traditional boundaries and are rapidly changing in response to technological change and globalization. This course will focus on applying public health principles in both developed and developing countries to understand the links between health and economic and social development.BIO 202 —The History of Modern SciencePrerequisite Take BIO*121, BIO*123L, BIO*122, and BIO*124LThis course surveys the history of modern science, beginning with the Copernican  model of the universe. It will cover the evolution of scientific theories and the scientists responsible for the major discoveries in Astronomy, Physics, Chemistry, Biology, and Geology.BIO 204 —EcologyPrerequisite Take BIO*121, BIO*123L, BIO*122, and BIO*124LA course relating ecological principles to studies in the laboratory and field. Topics include population dynamics, energy flow in ecosystems, and species interactions.BIO 205L —Ecology LaboratoryPrerequisite Take BIO*204A course relating ecological principles to studies in the laboratory and field. Topics include population dynamics, energy flow in ecosystems, and species interactions.BIO 210 —BotanyPrerequisite Take BIO*121, BIO*122, BIO*123L, and BIO*124LA study of the basic principles of botany, and a survey of the plant kingdom with emphasis on the morphology and physiology of higher plants.BIO 212 —MicrobiologyPrerequisite TakeBIO 213LconcurrentlyA study of the basic principles of microbiology involving pathogenic and nonpathogenic organisms and their relation to medicine, sanitation, agriculture, and industry. Laboratory study is concerned with the morphology and physiology of microorganisms, and with their application in identification.BIO 213L —Microbiology LabPrerequisite Take BIO*212Laboratory study concerned with the morphology and physiology of microorganisms, and with their application in identification.BIO 215 —General PathophysiologyPrerequisite Must have taken NUR*354;This course is designed to correlate basic knowledge of normal physiology with dysfunction of body mechanisms. The student will gain a basic understanding of the processes of disease through study of causative mechanisms and the signs and symptoms which reflect disease.BIO 221 —EvolutionPrerequisite Take BIO*121, BIO*122, BIO*123L, AND BIO*124LNothing in biology makes sense except in the light of evolution. This course covers the diversity of life on earth and the ongoing evolutionary processes that affect all biology from the ecosystem to the hospital. Topics include natural selection, speciation, diversity on earth, molecular processes and primate evolution. Cross-listed asENV 221.BIO 222 —BioinformaticsPrerequisite take BIO*121, BIO*122, BIO*123L, and BIO*124LBioinformatics is the study of biological phenomena and the data generated from such studies with the assistance of computers. Bioinformatics relies on computers for the acquisition, storage, analysis, manipulation, management and dissemination of biological information. This is an introductory course to the problems and promise in this field.BIO 231 —Anatomy & Physiology IPrerequisite TakeBIO 233LA unified study of the structure and function of the human body. The course will survey the anatomy and physiology of the major types of human cells, tissues, organs and organ systems. An understanding of the human body as a self-regulated, dynamic community of interrelated living parts will be emphasized. Designed to be taken sequentially. Must be taken concurrently with laboratory.BIO 232 —Anatomy & Physiology IIPrerequisite Take BIO*234LA unified study of the structure and function of the human body. The course will survey the anatomy and physiology of the major types of human cells, tissues, organs and organ systems. An understanding of the human body as a self-regulated, dynamic community of interrelated living parts will be emphasized. Designed to be taken sequentially. Must be taken concurrently with laboratory.BIO 233L —Anatomy & Physiology Lab IPrerequisite Take BIO*231The laboratory involves a series of student-performed exercises designed to illustrate, by observation and experimentation, the major concepts of human anatomy and physiology. Designed to be taken sequentially. Must be taken concurrently with lecture.BIO 234L —Anatomy & Physiology Lab IIPrerequisite Take BIO*232The laboratory involves a series of student-performed exercises designed to illustrate, by observation and experimentation, the major concepts of human anatomy and physiology. Designed to be taken sequentially. Must be taken concurrently with lecture.BIO 237 —Comparative Anatomy TutorialPrerequisite Take BIO*121 and BIO*123LIn the true sense of a tutorial, the instructor provides individual attention to a small group of students in the art of dissecting a cat. The anatomy dissection is accompanied by lecture on the underlying physiology and comparisons to human anatomy and physiology.BIO 246 —Genetics IPrerequisite Must have taken BIO*121, BIO*122, BIO*123L and BIO*124L;A study of Mendelian genetics and the molecular biology of the gene. Basic principles of genetics, as they apply in plants and animals, are studied in the laboratory with special emphasis on Drosophilia. - four semester hoursBIO 298 —Fellowship ResearchStudent-faculty collaborative research for fellowship students.BIO 299 —Fellowship Research IIPrerequisite Take BIO*298BIO 302 —Nature StudyThis course fosters a personal, hands-on approach to understanding the natural world. It is designed to help the student become a better observer, communicator, and educator in the field of nature study. The laboratory provides opportunities to visit nature sites, conduct field studies, plan and implement educational projects, and learn from accomplished naturalists and educators. The course may include a service learning component.BIO 304 —Field Ecology & LabA course in the ecology of local plants and their habitats, designed for the student with minimal experience in ecology. By learning basic plant structure and terminology, and the interactions between plants and the environment, the student will learn the ecology of plants in a natural setting. Course activities include field trips to areas of interest and laboratory experiments.BIO 310 —Medical BotanyA survey of plants with physiologically active properties of medicinal interest. Emphasis is placed on the biology, folk uses, ethnobotany, and natural history of useful angiosperms.BIO 312 —Conservation EcologyPrerequisite Take BIO*204 and BIO*205LThe practice and theory of conservation ecology. Current and future threats to populations and ecosystems, methods of protection, and the methods used to assess conservation efforts will be covered. Case studies include restoration, extinction, and wildlife management. Students will apply conservation ecology methods to real world threatened populations. Cross-listed asENV 312.BIO 315 —PharmacologyPrerequisite Take BIO*121, BIO*122, CHE*111, CHE*112, and BIO*334The course is designed to introduce one to the study of the interaction of chemicals with living organisms. Pharmacology encompasses the disciplines of organic chemistry, physiology, pathology, biochemistry, and molecular biology, and as such we will investigate drug action at several levels: whole body, organ, tissue, cell, and molecular. We will discuss the intricacies of the various classes of drugs, and discuss the factors that are used to assess the safety and efficacy of a drug.BIO 316 —Virology/ImmunologyPrerequisite Take BIO*121, BIO*122, BIO*123L, and BIO*124LThe course material covers two areas of medical importance: virology, some of the predominant disease-causing agents; and immunology, our body's major defense mechanisms against disease. Topics to be covered include the history, biology, molecular structure, and evolutionary significance of the components of these two systems. The recent findings in the fields will be highlighted, as they pertain to our understanding of disease.BIO 334 —Cell BiologyPrerequisite Take BIO*121, BIO*122, BIO*123L, and BIO*124LA study of the cell with emphasis on the molecular aspects of cell structure and function. Biochemical processes are emphasized.BIO 337 —Intro to OncologyPrerequisite Take BIO*121, BIO*122, BIO*123L, and BIO*124LThe course encompasses the basic biology and clinical aspects of cancer. Topics to be covered include the history of oncology, basic cancer biology, and current concepts relative to the cause, prevention, detection, and treatment of benign and malignant neoplasias.BIO 338 —Cell PhysiologyPrerequisite Take BIO*334A contemporary perspective on cell function drawing upon recent findings in physiology, biochemistry, biophysics, and molecular biology. The course will highlight the cellular processes that occur outside the nucleus . Emphasis will be placed on learning quantitative approaches to solving problems in cell physiology.BIO 345 —Experimental Design & Analysis With LabPrerequisite Take BIO*121, and BIO*122Mathematics is a fundamental component of Biology. In this course, experimental design, statistics, and simple modeling are presented from a biological perspective, in preparation for thesis and post-baccalaureate research, and for preparation for employment in Biology.BIO 347 —GeneticsPrerequisite Must have takenBIO 121andBIO 122This course expands on the concepts of heredity, with emphasis placed on the genetics of both prokaryotic and eukaryotic microorganisms. Classical genetic analysis, non-Mendelian inheritance, molecular mechanism of genetic change, and human genetics will be covered.BIO 348L —Genetics LaboratoryPrerequisite Take BIO*347BIO 352 —Microscopic Anatomy & LabPrerequisite Take BIO*121, BIO*122, BIO*123L, and BIO*124LA study of the cells and tissues, and their involvement in organ structure. Cytological and histological slides are prepared and studied in the laboratory.BIO 360 —PathophysiologyPrerequisite TakeBIO 231,BIO 232,BIO 233LandBIO 234LThis course is designed to correlate basic knowledge of normal physiology with dysfunction of body mechanisms. The student will gain a basic understanding of the processes of disease through study of causative mechanisms and the signs and symptoms which reflect disease.BIO 361L —Pathophysiology LaboratoryPrerequisite Take BIO*231, and BIO*232This course is designed to correlate basic knowledge of normal physiology with dysfunction of body mechanisms. The student will gain a basic understanding of the processes of disease through study of causative mechanisms and the signs and symptoms which reflect disease.BIO 373 —AstrobiologyPrerequisite Take BIO*121, BIO*122, BIO*123L, and BIO*124LAstrobiology is the study of life as a planetary phenomenon. This course will explore life's origin, history, and evolution on Earth, and the potential for life elsewhere in the universe. It will examine the requirements and limits of life, from elemental to galactic, drawing from biology, geology, physics, and chemistry.BIO 380 —Genomics & ProteomicsPrerequisite Take BIO*121, BIO*122, BIO*123L, BIO*124L, and BIO*222Genomics and Proteomics is the detailed study of technologies and methodologies for evaluation of genomic and protein functions. These methods are used to interpret biological regulation of DNA sequences, the RNAs that are copied from them, and the proteins that are synthesized from these RNAs. The application of these technologies to problems in biology ranging from organism development to human diseases will be discussed.BIO 385 —Topic:Prerequisite Take BIO*121, BIO*122, BIO*123L, and BIO*124LThis special topics course provides students with opportunities to study current topics in the biological sciences. Biology is a rapidly changing field and thus many current issues are unable to be fully addressed in traditional course offerings. This includes topics in environmental science, bioinformatics and other evolving fields. Students may repeat the course two additional times as the topic changes.BIO 391 —Bio-Analy Tech & Lab IPrerequisite Take BIO*121, BIO*122, BIO*123L, BIO*124L, and BIO*334Lectures and laboratories will emphasize contemporary bioanalytical and biological research at the cell and molecular levels.BIO 391will stress methods employed in studies of cell physiology.BIO 392will emphasize DNA methods of gene recombination in prokaryotic and eukaryotic systems. Theoretical and practical competence will be developed in all techniques.BIO 392 —Bio-Analy Tech & Lab IIPrerequisite Take BIO*121, BIO*122, BIO*123L, BIO*124L, and BIO*334Lectures and laboratories will emphasize contemporary bioanalytical and biological research at the cell and molecular levels.BIO 391will stress methods employed in studies of cell physiology.BIO 392will emphasize DNA methods of gene recombination in prokaryotic and eukaryotic systems. Theoretical and practical competence will be developed in all techniques.BIO 401 —Biology SeminarRequired of all B.S. and B.A. biology majors beginning with students entering their senior year. The goal is to assure the readiness of students for job placement, and/or entrance into professional or graduate school by assessing the students knowledge and understanding of the field and their writing and speaking skills.BIO 402 —Biology SeminarPrerequisite TakeBIO 401Required of all B.S. and B.A. biology majors beginning with students entering senior year. The presentation of a research seminar and an in depth research literature review will be done to asses the students knowledge and understanding of the field and their writing and speaking skills.BIO 403 —Honors Thesis IIndividual research of a substantive nature pursued in the students major field of study. The research will conclude in a written thesis on an original project, and an oral defense.BIO 404 —Honors Thesis IIIndividual research of a substantive nature pursued in the students major field of study. The research will conclude in a written thesis on an original project, and an oral defense.BIO 410 —Projects in Public HealthPrerequisite Take BIO*106 and BIO*107This service learning and seminar course requires the student to apply public health concepts to his/her major area of study by working with a community partner on a project in a relevant area of public health. Students will meet weekly to discuss their projects.BIO 422 —Bioinformatics IIPrerequisite Take BIO*222The field of bioinformatics has developed as a result of the integration of information and approaches from a number of disciplines. This is an advanced course where on will be introduced to the challenges and projected outcomes of the field. It is expected that students entering this course are familiar with biological and computational techniques, as they will be used as the foundation for the laboratory portion of the course.BIO 427 —Environmental Microbio & LabPrerequisite Take BIO*212 and BIO*213LBIO 432 —Development & LabPrerequisite Take BIO*334To provide a modern view of developmental biology unifying the approaches of cell biology, biochemistry, molecular biology, and genetics. This course is designed for students who have had one year of introductory biology, and one semester of cell biology. The communication of biological concepts, ideas, and experimentation, in verbal and written form, is an integral component of this course. The laboratory emphasizes molecular aspects of development.BIO 435 —Plant PhysiologyPrerequisite Take BIO*121, BIO*122, BIO*123L, BIO*124L, and BIO*210This course deals with plant physiology at an organismal level and with the physiological ecology or interactions of plants with their environment. The unique features of plant photosynthesis, water relations and metabolic processes will be studied in a variety of taxa and settings. Laboratory will include field trips to local areas of interest and experiments in the laboratory.BIO 435L —Plant Physiology LabPrerequisite Take BIO*121, BIO*122, BIO*123L, and BIO*124LLaboratory will include field trips to local areas of interest and experiments in the laboratory.BIO 436 —Human GeneticsPrerequisite Take BIO*334The role of molecular regulatory mechanisms as they pertain to the structure and function of genes in eukaryotic systems, the evolution of genomes and molecular techniques are emphasized.BIO 437L —Medical Genetics LabPrerequisite Take BIO*436The bioinformatics component of Medical Genetics . A semester-long research project will be used to teach students how to use DNA sequence analysis to determine evolutionary relationships or explore the genetics of human disease. Research projects will vary depending upon the expertise and interest of the instructor.BIO 441 —Comp Animal Phys & LabPrerequisite Take BIO*121, BIO*122, BIO*123L, BIO*124L, and BIO*334An advanced course in physiology intended to provide in-depth coverage of functions of selected cells, tissues, organs, and organ systems. Laboratory will feature experiments using appropriate animal model systems.BIO 445 —LimnologyPrerequisite Take BIO*121. BIO*122, BIO*204, and BIO*205LThis course provides students with an introduction to limnology, emphasizing the physical, chemical and biological function of north temperate lakes and streams. Lecture topics include the physics and chemistry of continental waters, the major biotic communities, interactions among these communities, and interactions between humans and the aquatic environment. Laboratory exercises and field trips provide a practical introduction to the methods of aquatic sciences.BIO 488 —Internship in Environmental ScienceTraining and professional experience in the environment. Interns perform service training, keep a written journal, and write a personal career evaluation based on the internship experience. Department chair permission required.BIO 489 —Health Studies InternshipThe health studies internship is an immersive hands-on experience in a particular aspect of health care. Individuals must perform a minimum of 60 hours of structured, closely monitored training, maintain a written journal, and write a personal career evaluation based on the experience. Biology department chair permission required.BIO 497 —Independent Study Upper class status - junior or senior.  A 3.0 GPA in the major.  The acceptance of his/her proposed work by a department faculty member.  Completed work on the project by the end of one semester - written report.BIO 498 —Independent Study Upper class status - junior or senior.  A 3.0 GPA in the major.  The acceptance of his/her proposed work by a department faculty member.  Completed work on the project by the end of one semester - written report.BIO 499 —Independent Study A 3.0 GPA in the major.  The acceptance of his/her proposed work by a department faculty member.  Completed work on the project by the end of one semester - written report.",
            "instructors": [],
            "textbooks": [],
            "zoom_link": null
        },
        {
            "number": "121",
            "title": "122 and includes an investigative approach to the study of all living organisms",
            "description": "BIO 124L —Gen Biology Lab IIPrerequisite Take BIO*122This laboratory is designed to be taken concurrently with BIO 121-122 and includes an investigative approach to the study of all living organisms.BIO 189 —Prehealth Career StudiesThis is a course designed to introduce students early in their studies to the health care careers. Individual off-campus health sciences experiences sponsored by appropriate organizations, companies and private practitioners provide unpaid internships with a minimum of 60 hours of student service. Biology department chair permission required.BIO 198 —Introduction to Scientific ResearchThis course is designed to introduce students to the principles of scientific research, analyzing primary literature, ethics in research, science communication, and career development.BIO 199 —Intro to Scientific Research IIThis course is designed to allow first-year students the opportunity to rotate through scientific research labs in preparation for long-term faculty-student research collaborations.BIO 201 —Global HealthPrerequisite Take BIO*106Public health issues often transcend traditional boundaries and are rapidly changing in response to technological change and globalization. This course will focus on applying public health principles in both developed and developing countries to understand the links between health and economic and social development.BIO 202 —The History of Modern SciencePrerequisite Take BIO*121, BIO*123L, BIO*122, and BIO*124LThis course surveys the history of modern science, beginning with the Copernican  model of the universe. It will cover the evolution of scientific theories and the scientists responsible for the major discoveries in Astronomy, Physics, Chemistry, Biology, and Geology.BIO 204 —EcologyPrerequisite Take BIO*121, BIO*123L, BIO*122, and BIO*124LA course relating ecological principles to studies in the laboratory and field. Topics include population dynamics, energy flow in ecosystems, and species interactions.BIO 205L —Ecology LaboratoryPrerequisite Take BIO*204A course relating ecological principles to studies in the laboratory and field. Topics include population dynamics, energy flow in ecosystems, and species interactions.BIO 210 —BotanyPrerequisite Take BIO*121, BIO*122, BIO*123L, and BIO*124LA study of the basic principles of botany, and a survey of the plant kingdom with emphasis on the morphology and physiology of higher plants.BIO 212 —MicrobiologyPrerequisite TakeBIO 213LconcurrentlyA study of the basic principles of microbiology involving pathogenic and nonpathogenic organisms and their relation to medicine, sanitation, agriculture, and industry. Laboratory study is concerned with the morphology and physiology of microorganisms, and with their application in identification.BIO 213L —Microbiology LabPrerequisite Take BIO*212Laboratory study concerned with the morphology and physiology of microorganisms, and with their application in identification.BIO 215 —General PathophysiologyPrerequisite Must have taken NUR*354;This course is designed to correlate basic knowledge of normal physiology with dysfunction of body mechanisms. The student will gain a basic understanding of the processes of disease through study of causative mechanisms and the signs and symptoms which reflect disease.BIO 221 —EvolutionPrerequisite Take BIO*121, BIO*122, BIO*123L, AND BIO*124LNothing in biology makes sense except in the light of evolution. This course covers the diversity of life on earth and the ongoing evolutionary processes that affect all biology from the ecosystem to the hospital. Topics include natural selection, speciation, diversity on earth, molecular processes and primate evolution. Cross-listed asENV 221.BIO 222 —BioinformaticsPrerequisite take BIO*121, BIO*122, BIO*123L, and BIO*124LBioinformatics is the study of biological phenomena and the data generated from such studies with the assistance of computers. Bioinformatics relies on computers for the acquisition, storage, analysis, manipulation, management and dissemination of biological information. This is an introductory course to the problems and promise in this field.BIO 231 —Anatomy & Physiology IPrerequisite TakeBIO 233LA unified study of the structure and function of the human body. The course will survey the anatomy and physiology of the major types of human cells, tissues, organs and organ systems. An understanding of the human body as a self-regulated, dynamic community of interrelated living parts will be emphasized. Designed to be taken sequentially. Must be taken concurrently with laboratory.BIO 232 —Anatomy & Physiology IIPrerequisite Take BIO*234LA unified study of the structure and function of the human body. The course will survey the anatomy and physiology of the major types of human cells, tissues, organs and organ systems. An understanding of the human body as a self-regulated, dynamic community of interrelated living parts will be emphasized. Designed to be taken sequentially. Must be taken concurrently with laboratory.BIO 233L —Anatomy & Physiology Lab IPrerequisite Take BIO*231The laboratory involves a series of student-performed exercises designed to illustrate, by observation and experimentation, the major concepts of human anatomy and physiology. Designed to be taken sequentially. Must be taken concurrently with lecture.BIO 234L —Anatomy & Physiology Lab IIPrerequisite Take BIO*232The laboratory involves a series of student-performed exercises designed to illustrate, by observation and experimentation, the major concepts of human anatomy and physiology. Designed to be taken sequentially. Must be taken concurrently with lecture.BIO 237 —Comparative Anatomy TutorialPrerequisite Take BIO*121 and BIO*123LIn the true sense of a tutorial, the instructor provides individual attention to a small group of students in the art of dissecting a cat. The anatomy dissection is accompanied by lecture on the underlying physiology and comparisons to human anatomy and physiology.BIO 246 —Genetics IPrerequisite Must have taken BIO*121, BIO*122, BIO*123L and BIO*124L;A study of Mendelian genetics and the molecular biology of the gene. Basic principles of genetics, as they apply in plants and animals, are studied in the laboratory with special emphasis on Drosophilia. - four semester hoursBIO 298 —Fellowship ResearchStudent-faculty collaborative research for fellowship students.BIO 299 —Fellowship Research IIPrerequisite Take BIO*298BIO 302 —Nature StudyThis course fosters a personal, hands-on approach to understanding the natural world. It is designed to help the student become a better observer, communicator, and educator in the field of nature study. The laboratory provides opportunities to visit nature sites, conduct field studies, plan and implement educational projects, and learn from accomplished naturalists and educators. The course may include a service learning component.BIO 304 —Field Ecology & LabA course in the ecology of local plants and their habitats, designed for the student with minimal experience in ecology. By learning basic plant structure and terminology, and the interactions between plants and the environment, the student will learn the ecology of plants in a natural setting. Course activities include field trips to areas of interest and laboratory experiments.BIO 310 —Medical BotanyA survey of plants with physiologically active properties of medicinal interest. Emphasis is placed on the biology, folk uses, ethnobotany, and natural history of useful angiosperms.BIO 312 —Conservation EcologyPrerequisite Take BIO*204 and BIO*205LThe practice and theory of conservation ecology. Current and future threats to populations and ecosystems, methods of protection, and the methods used to assess conservation efforts will be covered. Case studies include restoration, extinction, and wildlife management. Students will apply conservation ecology methods to real world threatened populations. Cross-listed asENV 312.BIO 315 —PharmacologyPrerequisite Take BIO*121, BIO*122, CHE*111, CHE*112, and BIO*334The course is designed to introduce one to the study of the interaction of chemicals with living organisms. Pharmacology encompasses the disciplines of organic chemistry, physiology, pathology, biochemistry, and molecular biology, and as such we will investigate drug action at several levels: whole body, organ, tissue, cell, and molecular. We will discuss the intricacies of the various classes of drugs, and discuss the factors that are used to assess the safety and efficacy of a drug.BIO 316 —Virology/ImmunologyPrerequisite Take BIO*121, BIO*122, BIO*123L, and BIO*124LThe course material covers two areas of medical importance: virology, some of the predominant disease-causing agents; and immunology, our body's major defense mechanisms against disease. Topics to be covered include the history, biology, molecular structure, and evolutionary significance of the components of these two systems. The recent findings in the fields will be highlighted, as they pertain to our understanding of disease.BIO 334 —Cell BiologyPrerequisite Take BIO*121, BIO*122, BIO*123L, and BIO*124LA study of the cell with emphasis on the molecular aspects of cell structure and function. Biochemical processes are emphasized.BIO 337 —Intro to OncologyPrerequisite Take BIO*121, BIO*122, BIO*123L, and BIO*124LThe course encompasses the basic biology and clinical aspects of cancer. Topics to be covered include the history of oncology, basic cancer biology, and current concepts relative to the cause, prevention, detection, and treatment of benign and malignant neoplasias.BIO 338 —Cell PhysiologyPrerequisite Take BIO*334A contemporary perspective on cell function drawing upon recent findings in physiology, biochemistry, biophysics, and molecular biology. The course will highlight the cellular processes that occur outside the nucleus . Emphasis will be placed on learning quantitative approaches to solving problems in cell physiology.BIO 345 —Experimental Design & Analysis With LabPrerequisite Take BIO*121, and BIO*122Mathematics is a fundamental component of Biology. In this course, experimental design, statistics, and simple modeling are presented from a biological perspective, in preparation for thesis and post-baccalaureate research, and for preparation for employment in Biology.BIO 347 —GeneticsPrerequisite Must have takenBIO 121andBIO 122This course expands on the concepts of heredity, with emphasis placed on the genetics of both prokaryotic and eukaryotic microorganisms. Classical genetic analysis, non-Mendelian inheritance, molecular mechanism of genetic change, and human genetics will be covered.BIO 348L —Genetics LaboratoryPrerequisite Take BIO*347BIO 352 —Microscopic Anatomy & LabPrerequisite Take BIO*121, BIO*122, BIO*123L, and BIO*124LA study of the cells and tissues, and their involvement in organ structure. Cytological and histological slides are prepared and studied in the laboratory.BIO 360 —PathophysiologyPrerequisite TakeBIO 231,BIO 232,BIO 233LandBIO 234LThis course is designed to correlate basic knowledge of normal physiology with dysfunction of body mechanisms. The student will gain a basic understanding of the processes of disease through study of causative mechanisms and the signs and symptoms which reflect disease.BIO 361L —Pathophysiology LaboratoryPrerequisite Take BIO*231, and BIO*232This course is designed to correlate basic knowledge of normal physiology with dysfunction of body mechanisms. The student will gain a basic understanding of the processes of disease through study of causative mechanisms and the signs and symptoms which reflect disease.BIO 373 —AstrobiologyPrerequisite Take BIO*121, BIO*122, BIO*123L, and BIO*124LAstrobiology is the study of life as a planetary phenomenon. This course will explore life's origin, history, and evolution on Earth, and the potential for life elsewhere in the universe. It will examine the requirements and limits of life, from elemental to galactic, drawing from biology, geology, physics, and chemistry.BIO 380 —Genomics & ProteomicsPrerequisite Take BIO*121, BIO*122, BIO*123L, BIO*124L, and BIO*222Genomics and Proteomics is the detailed study of technologies and methodologies for evaluation of genomic and protein functions. These methods are used to interpret biological regulation of DNA sequences, the RNAs that are copied from them, and the proteins that are synthesized from these RNAs. The application of these technologies to problems in biology ranging from organism development to human diseases will be discussed.BIO 385 —Topic:Prerequisite Take BIO*121, BIO*122, BIO*123L, and BIO*124LThis special topics course provides students with opportunities to study current topics in the biological sciences. Biology is a rapidly changing field and thus many current issues are unable to be fully addressed in traditional course offerings. This includes topics in environmental science, bioinformatics and other evolving fields. Students may repeat the course two additional times as the topic changes.BIO 391 —Bio-Analy Tech & Lab IPrerequisite Take BIO*121, BIO*122, BIO*123L, BIO*124L, and BIO*334Lectures and laboratories will emphasize contemporary bioanalytical and biological research at the cell and molecular levels.BIO 391will stress methods employed in studies of cell physiology.BIO 392will emphasize DNA methods of gene recombination in prokaryotic and eukaryotic systems. Theoretical and practical competence will be developed in all techniques.BIO 392 —Bio-Analy Tech & Lab IIPrerequisite Take BIO*121, BIO*122, BIO*123L, BIO*124L, and BIO*334Lectures and laboratories will emphasize contemporary bioanalytical and biological research at the cell and molecular levels.BIO 391will stress methods employed in studies of cell physiology.BIO 392will emphasize DNA methods of gene recombination in prokaryotic and eukaryotic systems. Theoretical and practical competence will be developed in all techniques.BIO 401 —Biology SeminarRequired of all B.S. and B.A. biology majors beginning with students entering their senior year. The goal is to assure the readiness of students for job placement, and/or entrance into professional or graduate school by assessing the students knowledge and understanding of the field and their writing and speaking skills.BIO 402 —Biology SeminarPrerequisite TakeBIO 401Required of all B.S. and B.A. biology majors beginning with students entering senior year. The presentation of a research seminar and an in depth research literature review will be done to asses the students knowledge and understanding of the field and their writing and speaking skills.BIO 403 —Honors Thesis IIndividual research of a substantive nature pursued in the students major field of study. The research will conclude in a written thesis on an original project, and an oral defense.BIO 404 —Honors Thesis IIIndividual research of a substantive nature pursued in the students major field of study. The research will conclude in a written thesis on an original project, and an oral defense.BIO 410 —Projects in Public HealthPrerequisite Take BIO*106 and BIO*107This service learning and seminar course requires the student to apply public health concepts to his/her major area of study by working with a community partner on a project in a relevant area of public health. Students will meet weekly to discuss their projects.BIO 422 —Bioinformatics IIPrerequisite Take BIO*222The field of bioinformatics has developed as a result of the integration of information and approaches from a number of disciplines. This is an advanced course where on will be introduced to the challenges and projected outcomes of the field. It is expected that students entering this course are familiar with biological and computational techniques, as they will be used as the foundation for the laboratory portion of the course.BIO 427 —Environmental Microbio & LabPrerequisite Take BIO*212 and BIO*213LBIO 432 —Development & LabPrerequisite Take BIO*334To provide a modern view of developmental biology unifying the approaches of cell biology, biochemistry, molecular biology, and genetics. This course is designed for students who have had one year of introductory biology, and one semester of cell biology. The communication of biological concepts, ideas, and experimentation, in verbal and written form, is an integral component of this course. The laboratory emphasizes molecular aspects of development.BIO 435 —Plant PhysiologyPrerequisite Take BIO*121, BIO*122, BIO*123L, BIO*124L, and BIO*210This course deals with plant physiology at an organismal level and with the physiological ecology or interactions of plants with their environment. The unique features of plant photosynthesis, water relations and metabolic processes will be studied in a variety of taxa and settings. Laboratory will include field trips to local areas of interest and experiments in the laboratory.BIO 435L —Plant Physiology LabPrerequisite Take BIO*121, BIO*122, BIO*123L, and BIO*124LLaboratory will include field trips to local areas of interest and experiments in the laboratory.BIO 436 —Human GeneticsPrerequisite Take BIO*334The role of molecular regulatory mechanisms as they pertain to the structure and function of genes in eukaryotic systems, the evolution of genomes and molecular techniques are emphasized.BIO 437L —Medical Genetics LabPrerequisite Take BIO*436The bioinformatics component of Medical Genetics . A semester-long research project will be used to teach students how to use DNA sequence analysis to determine evolutionary relationships or explore the genetics of human disease. Research projects will vary depending upon the expertise and interest of the instructor.BIO 441 —Comp Animal Phys & LabPrerequisite Take BIO*121, BIO*122, BIO*123L, BIO*124L, and BIO*334An advanced course in physiology intended to provide in-depth coverage of functions of selected cells, tissues, organs, and organ systems. Laboratory will feature experiments using appropriate animal model systems.BIO 445 —LimnologyPrerequisite Take BIO*121. BIO*122, BIO*204, and BIO*205LThis course provides students with an introduction to limnology, emphasizing the physical, chemical and biological function of north temperate lakes and streams. Lecture topics include the physics and chemistry of continental waters, the major biotic communities, interactions among these communities, and interactions between humans and the aquatic environment. Laboratory exercises and field trips provide a practical introduction to the methods of aquatic sciences.BIO 488 —Internship in Environmental ScienceTraining and professional experience in the environment. Interns perform service training, keep a written journal, and write a personal career evaluation based on the internship experience. Department chair permission required.BIO 489 —Health Studies InternshipThe health studies internship is an immersive hands-on experience in a particular aspect of health care. Individuals must perform a minimum of 60 hours of structured, closely monitored training, maintain a written journal, and write a personal career evaluation based on the experience. Biology department chair permission required.BIO 497 —Independent Study Upper class status - junior or senior.  A 3.0 GPA in the major.  The acceptance of his/her proposed work by a department faculty member.  Completed work on the project by the end of one semester - written report.BIO 498 —Independent Study Upper class status - junior or senior.  A 3.0 GPA in the major.  The acceptance of his/her proposed work by a department faculty member.  Completed work on the project by the end of one semester - written report.BIO 499 —Independent Study A 3.0 GPA in the major.  The acceptance of his/her proposed work by a department faculty member.  Completed work on the project by the end of one semester - written report.",
            "instructors": [],
            "textbooks": [],
            "zoom_link": null
        },
        {
            "number": "101",
            "title": "— Human Biology",
            "description": "A study of the basic functions of the human body in health and disease. This course is designed to increase the students understanding of elementary human physiology. It will emphasize the functional aspects of the body at the cellular, organ, and organ system levels. It is designed as a terminal non-laboratory course for non-science students.",
            "instructors": [],
            "textbooks": [],
            "zoom_link": null
        },
        {
            "number": "102",
            "title": "— Introductory Biology",
            "description": "A study of the basic principles of biology dealing with animals. The course includes a laboratory and is designed for non majors with no prior college biology courses. There will be two hours of lecture and one semester hour of laboratory each week.",
            "instructors": [],
            "textbooks": [],
            "zoom_link": null
        },
        {
            "number": "103",
            "title": "— Environ Biology",
            "description": "An introductory course in which the functioning of ecosystems is explored and related to environmental problems. The course stresses current topics of local and global interest with emphasis on how to obtain, understand, and interpret information pertaining to environmental issues.",
            "instructors": [],
            "textbooks": [],
            "zoom_link": null
        },
        {
            "number": "104",
            "title": "— Human Genetics",
            "description": "An introductory course for non-science majors describing the fundamental principles of genetics and how they apply to humans. The nature of the gene, genetic technologies and the implications of genetics for individuals in modern society are prominent aspects of the course. It is intended for students who have had high school courses in biology and chemistry.",
            "instructors": [],
            "textbooks": [],
            "zoom_link": null
        },
        {
            "number": "105",
            "title": "— Introduction to Environmental Health",
            "description": "In this course, students will be introduced to the basic concepts of toxicology, as they apply to understanding how environmental contaminants pose risks to human health and the environment. This course is intended for non-biology majors.",
            "instructors": [],
            "textbooks": [],
            "zoom_link": null
        },
        {
            "number": "106",
            "title": "— Introduction to Public Health",
            "description": "Public Health is about what makes us sick, what keeps us healthy, and what we can do about it as communities, populations and societies. This course provides an introduction to public health concepts and practice. Topics include historical perspectives on the contributions and roles of public health, an introduction to epidemiological methods, health from a global perspective, an introduction to tools for disease control and health promotion, and issues of health care delivery.",
            "instructors": [],
            "textbooks": [],
            "zoom_link": null
        },
        {
            "number": "107",
            "title": "— Introduction to Epidemiology",
            "description": "This course provides an introduction to epidemiology, the basic science of public health. Epidemiology is a scientific way of thinking, applicable to fields ranging from basic and clinical sciences to public policy. Students will learn how to use epidemiological methods in the analysis of information from real public health problems.",
            "instructors": [],
            "textbooks": [],
            "zoom_link": null
        },
        {
            "number": "121",
            "title": "— General Biology I",
            "description": "A treatment of basic principles of life, and of life-related phenomena; offers a broad base for advanced study by biology and natural science majors.",
            "instructors": [],
            "textbooks": [],
            "zoom_link": null
        },
        {
            "number": "122",
            "title": "— General Biology II",
            "description": "Prerequisite Take BIO*121 A treatment of basic principles of life, and of life-related phenomena; offers a broad base for advanced study by biology and natural science majors.",
            "instructors": [],
            "textbooks": [],
            "zoom_link": null
        },
        {
            "number": "123L",
            "title": "— Gen Biology Lab I",
            "description": "Prerequisite Take BIO*121 This laboratory is designed to be taken concurrently with BIO 121-122 and includes an investigative approach to the study of all living organisms.",
            "instructors": [],
            "textbooks": [],
            "zoom_link": null
        }
    ]
}