{
    "name": "Environmental Studies",
    "mission_statement": "With two degree programs and a focus on hands-on lab and field experiences, our Environmental Science program will challenge you in all the best ways. We have designed our curriculum to prepare you for a variety of careers in this important and rapidly growing field.\n\nOur undergraduate programs will help you identify and solve environmental issues through critical thinking, research, and scientific study. Faculty will personally guide and work alongside you in the classroom, field, and lab, as you learn about alternative energy systems, natural resource management, pollution control and mitigation, the effects of climate change, and more.",
    "office": null,
    "course_listing_url": null,
    "course_descriptions_url": "https://catalog.niagara.edu/undergraduate/courses-az/env/",
    "courses": [
        {
            "number": "103",
            "title": "— Environmental Biology",
            "description": "An introductory course in which the functioning of ecosystems is explored and related to environmental problems. The course stresses current topics of local and global interest with emphasis on how to obtain, understand, and interpret information pertaining to environmental issues. Cross-listed as BIO 103.",
            "instructors": [],
            "textbooks": [],
            "zoom_link": null
        },
        {
            "number": "105",
            "title": "— Environmental Health",
            "description": "In this course, students are introduced to the basic concepts of toxicology, as they apply to understanding how environmental contaminants pose risks to human health and the environment. This course is intended for non-biology majors. Cross-listed as BIO 105.",
            "instructors": [],
            "textbooks": [],
            "zoom_link": null
        },
        {
            "number": "109",
            "title": "— Introduction to Climate Science",
            "description": "An introductory course in which climate and climate change are explored and related to environmental and human impacts, mitigation, and adaptation. The course stresses current topics with emphasis on obtaining, understanding, and interpreting information about climate change.",
            "instructors": [],
            "textbooks": [],
            "zoom_link": null
        },
        {
            "number": "200",
            "title": "— Introduction to Environmental Studies",
            "description": "This course is an introduction to the study of environmental policy and politics, focusing on the tension between human values and environmental public policy. The objectives are to: convey to students the main tenet of environmental stewardship, familiarize students with the development of the environmental movement and environmental history in the United States, and introduce students to the difficulties in developing and enforcing environmental policy with a focus on the problems facing the Niagara Frontier Region.",
            "instructors": [],
            "textbooks": [],
            "zoom_link": null
        },
        {
            "number": "204",
            "title": "— Ecology and Lab",
            "description": "Prerequisite BIO*121 A course relating ecological principles to studies in the laboratory and field. Topics include population dynamics, energy flow in ecosystems, and species interactions. Cross-listed as BIO 204",
            "instructors": [],
            "textbooks": [],
            "zoom_link": null
        },
        {
            "number": "221",
            "title": "— Evolution",
            "description": "Prerequisite BIO*121 Nothing in biology makes sense except in the light of evolution (Dobzhansky). This course covers the diversity of life on earth and the ongoing evolutionary processes that affect all biology from the ecosystem to the hospital. Topics include natural selection, speciation, diversity on earth, molecular processes and primate evolution. Cross listed as BIO 221.",
            "instructors": [],
            "textbooks": [],
            "zoom_link": null
        },
        {
            "number": "290",
            "title": "— Environmental Thought",
            "description": "This course introduces students to environmental thought and what shapes peoples ideas and behaviors concerning the environment. It examines the relationship between individuals, society, and the environment using various perspectives [i.e., the humanities, religions (Eastern and Western), philosophical and cultural traditions, and different political and economic systems]. The course focuses on the interplay of personal and cultural values and how they influence attitudes toward the environment. Students are encouraged to develop a ?sense of place? that grounds them intellectually, spiritually, and physically in the geographic area in which they live.",
            "instructors": [],
            "textbooks": [],
            "zoom_link": null
        },
        {
            "number": "300",
            "title": "— Sustainability Science",
            "description": "Prerequisite ENV*200 Sustainability: meeting our needs without compromising future generations. Sustainability addresses solutions in food, water, energy, climate change, health and development using an interdisciplinary approach with local, regional and global sustainability issues. Includes use of the basic analytical skills necessary for scientific treatment of sustainability with an emphasis on critical thinking.",
            "instructors": [],
            "textbooks": [],
            "zoom_link": null
        },
        {
            "number": "302",
            "title": "— Nature Study",
            "description": "This course fosters a personal, hands-on approach to understanding the natural world. It is designed to help the student become a better observer and communicator in the field of nature study. The laboratory provides opportunities to visit nature sites, conduct field studies, and learn from accomplished naturalists and educators. The course may include a service learning component. Cross-listed as BIO 302.",
            "instructors": [],
            "textbooks": [],
            "zoom_link": null
        },
        {
            "number": "304",
            "title": "— Field Ecology",
            "description": "A field experience course. Through hands-on learning, we study the interactions between humans and ecology and gain an appreciation of ecology in a natural setting. Extended field trip(s), (e.g. Everglades, FL and Great Lakes Shipboard Science). Instructor permission required.",
            "instructors": [],
            "textbooks": [],
            "zoom_link": null
        }
    ]
}