{
    "name": "Theater Arts",
    "mission_statement": "As one of the oldest professional theatre training programs in the region, Niagara University is well-known for preparing students for careers that take them anywhere from Broadway to Hollywood. One-on-one mentorship with theatre faculty gives increased confidence – both onstage and offstage – throughout every step of the experiential learning process. To better prepare students for success and the realities of careers in professional theatre, our programs require an intense schedule and disciplined focus on both academic coursework and practical production experience. Niagara University Theatre requires a greater time commitment than other programs, but the benefits are significant.",
    "office": null,
    "course_listing_url": null,
    "course_descriptions_url": "https://catalog.niagara.edu/undergraduate/courses-az/thr/",
    "courses": [
        {
            "number": "101",
            "title": "Introduction to Theater",
            "description": "An introductory course covering the fundamentals of theater arts and performance.",
            "instructors": [],
            "textbooks": [],
            "zoom_link": null
        },
        {
            "number": "201",
            "title": "Acting Fundamentals",
            "description": "Basic acting techniques and scene study for beginning actors.",
            "instructors": [],
            "textbooks": [],
            "zoom_link": null
        },
        {
            "number": "109",
            "title": "110 in which more advanced techniques are explored with a focus on interpretation and audition techniques",
            "description": "Students continue to develop necessary skills for successful music theater performance utilizing the widening body of music theatre repertoire.THR 310 —Vocal Performance IVA continuation of THR 109-110 in which more advanced techniques are explored with a focus on interpretation and audition techniques. Students continue to develop necessary skills for successful music theater performance utilizing the widening body of music theater repertoire.THR 311 —Jazz Dance IIIPrerequisite Take THR*230;This class is geared to the student with some formal experience in jazz dance training. This course engages the dynamic sensitivity of the body to be able to communicate through movement. Specific jazz styles and choreographic formats are studied using basic steps and challenging combinations. The area of dance choreography is introduced.THR 312 —Jazz Dance IVPrerequisite Take THR*231This class is geared to the student with extensive formal experience in jazz dance training. This course challenges the dynamic and sensitivity of the body to be able to communicate through movement. Specific jazz styles and choreographic formats are studied using complex steps and challenging combinations. The area of dance choreography is introduced,THR 320 —Stage Combat IIIPrerequisite Take THR*301The accomplished actor combatant will explore advanced techniques in certain martial styles, ranging from classical to contemporary. Emphasis will be placed on organic storytelling and the creation of collaborative performances. Safety is emphasized. Instructor permission required.THR 321 —Tap Dance IThis course is an introduction to the field of tap dancing, beginning with basic single, double, triple, and quadruple sounds, simple combinations, rhythmic patterning, and routines. The material is designed for the novice and the beginning level.THR 322 —Tap Dance IIPrerequisite Take THR*321This course is an exploration into the field of tap dancing, beginning with single, double, triple, and quadruple sounds, combinations, rhythmic patterning, and routines. The material is designed for the intermediate and advanced level.THR 323 —Physical Theatre I Development of practical physical theatre skills: juggling, mime techniques and illusions, and body awareness. Exploration of analysis of movement theories. Performance of pantomime, gesture language, and gestural cartooning.THR 324 —Physical Theatre II Practical study of mask play and visual character development using neutral, larval, expressive, and found masks, Simple mask making. Alternative puppetry. Examination of current trends in physical theatre.THR 326 —Music Theatre RepertoirePrerequisite Take THR*202 or THR*110A focus on music literacy and advanced study of performance techniques for the music theatre singer utilizing repertoire from the diverse styles of music theatre.THR 329 —PlaywritingAn introductory course in the problems and practices of playwriting. Emphasis is placed on the development and revision of a one-act play. Students also are acquainted with opportunities for production and publication.THR 331 —Costume DesignPrerequisite Take FAA*120 or THR*120Students learn the process of costume design for the theatre. Techniques covered include: script analysis, character conceptualization, research, and basic rendering. Art supplies required.THR 337 —Scene DesignPrerequisite Take FAA*120 or THR*120This course will introduce students to the basic skills required to be a scenic designer. The goal of the course is to expose, explore, and develop methods of visual communication within the design process of scenic design. This course will introduce students to script analysis, research, drafting, painting, collage, and model building. Drafting kit and art supplies required.THR 339 —Lighting DesignAn introductory study of the art of lighting for the stage from the initial concept through electricity, instruments, color, plots, and designing for various types of stages. Drafting kit required.THR 343 —Pattern DraftingPrerequisite THR*243This is a studio course in which the student will learn the fundamentals of pattern drafting through demonstrations and practical applications. Topics covered include: drafting a basic pattern set consisting of a bodice, skirt, and sleeve, manipulating darts, adding fullness, and learning how to fit the body.THR 344 —History of Decor FashionThis course is a study of clothing and the decorative arts . The historical periods from Prehistory to the Baroque and the societies within which they developed will be covered. The student will gain knowledge of the connections between the present and the past in Western culture. This is an upper division course, not necessarily appropriate for freshmen students.THR 345 —History of Decor IIThis course is a study of clothing and the decorative arts . The historical periods from the Baroques to the present, and the societies within which they developed will be covered. The student will gain knowledge of the connections between the present and the past in Western culture.THR 347 —Special Topics-CostumeIn this studio course students will examine in detail the fundamental construction and application techniques used to create a variety of costume specialties. Sample topics: corsets and petticoats, mask making, jewelry making, millinery, dancewear, and men's tailoring. This course may be taken up to three times with different course topics. Lab fee.THR 350 —Advanced Make-upPrerequisite Take THR 270 orFAA 270The design, creation, and use of prosthetics, wigs, facial hair, blood, and other special effects are used to create realistic and fantastical characters. Lab Fee.THR 362 —Dramatic Theory and CriticismA study of the history and development of dramatic theory and criticism from ancient times to the present. Students will analyze distinct conceptions of theatre across both time and geography through engagement with selected theorists.THR 400 —ShakespeareThis course examines in-depth representative plays of Shakespeare in each of the genres: tragedy, comedy, history, and romance, as well as the sonnets.THR 401 —Performance Techniques VIIPrerequisite Must have taken THR*301 and THR*302;An advanced course for the senior performance emphasis student comprising a range of separate skills classes including: Acting-Synthesis & The Profession, Ballet, and Physical Theatre IV. Lab fee.THR 402 —Performance Techniques VIIIPrerequisite Take THR*401An advanced course for the senior performance emphasis student comprising a range of separate skills classes including: Acting-Synthesis & The Profession, Advanced Jazz Dance, and Vocal Performance VI. Lab fee.THR 403 —Broadway Dance IPrerequisite Take THR*311This course is designed to develop the advanced jazz dancer through the study of complex dynamic styles and combinations. Emphasis is placed on techniques and the importance of rhythms, special awareness, and projection as means of creating variety in dance. Musical theatre history and repertory is introduced.THR 404 —Broadway Dance IIPrerequisite Take THR*312This course is designed to develop the advanced jazz dancer by a complex study of dynamics, styles, and combinations. Emphasis is placed on technique, the importance of rhythms, spatial awareness, and projection as means of fine-tuning dance. Musical theatre history and repertory is introduced.THR 407 —Honors Thesis IIndividual research of a substantive nature pursued in the student's major field of study. The research will conclude in a written thesis or an original project, and an oral defense.THR 408 —Honors Thesis IIIndividual research of a substantive nature pursued in the student's major field of study. The research will conclude in a written thesis or an original project, and an oral defense.THR 409 —Ballet VPrerequisite take thr*211This course will concentrate on barre exercises in progressive combinations including: balances on releve, complex locomotive patterns, turns, and jumps. Students will be required to create ballet phrases and demonstrate complex movement.THR 410 —Ballet VIPrerequisite take thr*212This course is designed for the advanced ballet student. Class will be taught at an accelerated pace. It will include advanced and complex combinations incorporating jumps with turns, beats, partnering techniques, and choreographic exploration.THR 411 —History and Literature of TheatreA study of the development of theatrical performance from the Greeks through Asian theatres to Shakespeare, with emphasis on reading and analyzing representative performance texts from each period.THR 412 —History and Literature of Theatre IIA study of the development of theatrical performance, from the Italian Renaissance through the rise of realism at the end of the 19th century, with an emphasis of understanding theatrical style through diverse performance texts.THR 413 —History and Literature of Theatre IIIA study of the development of theatrical performance from the 20th century to the present day, with emphasis on work in North America and Europe.THR 414 —American Theatre and Drama: From theThis course examines the development of American theatre, historically and dramatically, from Colonial times to the advent of Eugene O'Neill. The emphasis is on plays from the 18th, 19th, and early 20th century theatre.THR 415 —Cont Theaters of Global MajsPrerequisite TakeTHR 412This course explores theatres of the global majority since the 1940s. This term broadly encompasses Black, Asian, Latinx, indigenous, bi-racial, and others long considered minorities through a Western lens. Students will read plays and learn about their context to understand the variety of stylistic and social deployments of theatre.THR 417 —Acting-Synthesis & the ProfessionPrerequisite Must have taken THR*307 and THR*308;An advanced acting course emphasizing the synthesis of skills and techniques explored in the previous years of study. Special attention is placed on developing a range of audition material. Classes are devoted to the business aspects of the acting profession.THR 418 —Acting-Synthesis & the ProfessionPrerequisite Must have taken THR*307 and THR*308;An advanced acting course emphasizing the synthesis of skills and techniques explored in the previous years of study. Special attention is placed on developing a range of audition material. Classes are devoted to the business aspects of the acting profession.THR 423 —Physical Theatre III Prerequisite Take THR*324Practical study of physical character development and visual narrative using improvisation techniques, including contact improv, devised pieces, and articulating visual perceptions on paper. Classical Commedia dell 'Arte characters are explored, using masks, existing traditional scenarios, and modern commedia is introduced through performance of a new adaptation.THR 424 —Physical Theatre IV Prerequisite Take THR*423The class will apply the techniques of clowning and improvisation to the creation of physically based dramatic narratives. The process will include developing a personal clown, a family of clowns, and a clown play. Audition techniques from the visual perspective and the actor as creator will also be explored.THR 425 —DirectingA study of general directorial problems and solutions: auditions, blocking, pace, rhythm, characterization, composition, picturization, movement, and general design. The student also prepares a short play from the beginning to actual performance.THR 430 —Senior SeminarThe senior seminar is an integrative capstone course requiring general theatre students to conduct research on a question or problem in a specific area of theatre. It will be conducted as an independent research effort with each student meeting privately with his or her research adviser. Students will write a senior thesis applying their acquired skills to a central topic, theme, or question.THR 431 —Senior Seminar IIPrerequisite THR*430The Senior Seminar II is the continuation of an interactive capstone course, requiring specialized theatre students to conduct research on a question or problem in a specific area of concentration in theatre. It will be conducted as an independent research effort with each student meeting privately with his or her research advisor. Students will write a senior thesis applying their acquired skills to a central topic, theme or question and present the findings in a forum appropriate to the subject.THR 445 —Advanced Design StudioPrerequisite Must have taken THR*337 THR*339 and THR*331;This independent study serves as the capstone course restricted to seniors in the design/technology sequence. Students will apply the knowledge and skills acquired over the course of their program to further their individual goals. The topics will be determined by the instructors and will vary by student need.THR 493 —Theatre Internship/Co-opA junior or senior work-study program providing relevant employment experience. Registration will occur at the beginning of the experience. The objective of the program is to integrate classroom theory and practical work experience, thus lending relevancy to learning and providing the student with a realistic exposure to career opportunities. Students interested in taking an internship or co-op should talk to their adviser.THR 494 —Theatre Internship/Co-opA junior or senior work-study program providing relevant employment experience. Registration will occur at the beginning of the experience. The objective of the program is to integrate classroom theory and practical work experience, thus lending relevancy to learning and providing the student with a realistic exposure to career opportunities. Students interested in taking an internship or co-op should talk to their adviser.THR 495 —Theatre Internship/Co-opA junior or senior work-study program providing relevant employment experience. Registration will occur at the beginning of the experience. The objective of the program is to integrate classroom theory and practical work experience, thus lending relevancy to learning and providing the student with a realistic exposure to career opportunities. Students interested in taking an internship or co-op should talk to their adviser.THR 496 —Theatre Internship/Co-opA junior or senior work-study program providing relevant employment experience. Registration will occur at the beginning of the experience. The objective of the program is to integrate classroom theory and practical work experience, thus lending relevancy to learning and providing the student with a realistic exposure to career opportunities. Students interested in taking an internship or co-op should talk to their adviser.",
            "instructors": [],
            "textbooks": [],
            "zoom_link": null
        },
        {
            "number": "109",
            "title": "110 in which more advanced techniques are explored with a focus on interpretation and audition techniques",
            "description": "Students continue to develop necessary skills for successful music theater performance utilizing the widening body of music theatre repertoire.THR 310 —Vocal Performance IVA continuation of THR 109-110 in which more advanced techniques are explored with a focus on interpretation and audition techniques. Students continue to develop necessary skills for successful music theater performance utilizing the widening body of music theater repertoire.THR 311 —Jazz Dance IIIPrerequisite Take THR*230;This class is geared to the student with some formal experience in jazz dance training. This course engages the dynamic sensitivity of the body to be able to communicate through movement. Specific jazz styles and choreographic formats are studied using basic steps and challenging combinations. The area of dance choreography is introduced.THR 312 —Jazz Dance IVPrerequisite Take THR*231This class is geared to the student with extensive formal experience in jazz dance training. This course challenges the dynamic and sensitivity of the body to be able to communicate through movement. Specific jazz styles and choreographic formats are studied using complex steps and challenging combinations. The area of dance choreography is introduced,THR 320 —Stage Combat IIIPrerequisite Take THR*301The accomplished actor combatant will explore advanced techniques in certain martial styles, ranging from classical to contemporary. Emphasis will be placed on organic storytelling and the creation of collaborative performances. Safety is emphasized. Instructor permission required.THR 321 —Tap Dance IThis course is an introduction to the field of tap dancing, beginning with basic single, double, triple, and quadruple sounds, simple combinations, rhythmic patterning, and routines. The material is designed for the novice and the beginning level.THR 322 —Tap Dance IIPrerequisite Take THR*321This course is an exploration into the field of tap dancing, beginning with single, double, triple, and quadruple sounds, combinations, rhythmic patterning, and routines. The material is designed for the intermediate and advanced level.THR 323 —Physical Theatre I Development of practical physical theatre skills: juggling, mime techniques and illusions, and body awareness. Exploration of analysis of movement theories. Performance of pantomime, gesture language, and gestural cartooning.THR 324 —Physical Theatre II Practical study of mask play and visual character development using neutral, larval, expressive, and found masks, Simple mask making. Alternative puppetry. Examination of current trends in physical theatre.THR 326 —Music Theatre RepertoirePrerequisite Take THR*202 or THR*110A focus on music literacy and advanced study of performance techniques for the music theatre singer utilizing repertoire from the diverse styles of music theatre.THR 329 —PlaywritingAn introductory course in the problems and practices of playwriting. Emphasis is placed on the development and revision of a one-act play. Students also are acquainted with opportunities for production and publication.THR 331 —Costume DesignPrerequisite Take FAA*120 or THR*120Students learn the process of costume design for the theatre. Techniques covered include: script analysis, character conceptualization, research, and basic rendering. Art supplies required.THR 337 —Scene DesignPrerequisite Take FAA*120 or THR*120This course will introduce students to the basic skills required to be a scenic designer. The goal of the course is to expose, explore, and develop methods of visual communication within the design process of scenic design. This course will introduce students to script analysis, research, drafting, painting, collage, and model building. Drafting kit and art supplies required.THR 339 —Lighting DesignAn introductory study of the art of lighting for the stage from the initial concept through electricity, instruments, color, plots, and designing for various types of stages. Drafting kit required.THR 343 —Pattern DraftingPrerequisite THR*243This is a studio course in which the student will learn the fundamentals of pattern drafting through demonstrations and practical applications. Topics covered include: drafting a basic pattern set consisting of a bodice, skirt, and sleeve, manipulating darts, adding fullness, and learning how to fit the body.THR 344 —History of Decor FashionThis course is a study of clothing and the decorative arts . The historical periods from Prehistory to the Baroque and the societies within which they developed will be covered. The student will gain knowledge of the connections between the present and the past in Western culture. This is an upper division course, not necessarily appropriate for freshmen students.THR 345 —History of Decor IIThis course is a study of clothing and the decorative arts . The historical periods from the Baroques to the present, and the societies within which they developed will be covered. The student will gain knowledge of the connections between the present and the past in Western culture.THR 347 —Special Topics-CostumeIn this studio course students will examine in detail the fundamental construction and application techniques used to create a variety of costume specialties. Sample topics: corsets and petticoats, mask making, jewelry making, millinery, dancewear, and men's tailoring. This course may be taken up to three times with different course topics. Lab fee.THR 350 —Advanced Make-upPrerequisite Take THR 270 orFAA 270The design, creation, and use of prosthetics, wigs, facial hair, blood, and other special effects are used to create realistic and fantastical characters. Lab Fee.THR 362 —Dramatic Theory and CriticismA study of the history and development of dramatic theory and criticism from ancient times to the present. Students will analyze distinct conceptions of theatre across both time and geography through engagement with selected theorists.THR 400 —ShakespeareThis course examines in-depth representative plays of Shakespeare in each of the genres: tragedy, comedy, history, and romance, as well as the sonnets.THR 401 —Performance Techniques VIIPrerequisite Must have taken THR*301 and THR*302;An advanced course for the senior performance emphasis student comprising a range of separate skills classes including: Acting-Synthesis & The Profession, Ballet, and Physical Theatre IV. Lab fee.THR 402 —Performance Techniques VIIIPrerequisite Take THR*401An advanced course for the senior performance emphasis student comprising a range of separate skills classes including: Acting-Synthesis & The Profession, Advanced Jazz Dance, and Vocal Performance VI. Lab fee.THR 403 —Broadway Dance IPrerequisite Take THR*311This course is designed to develop the advanced jazz dancer through the study of complex dynamic styles and combinations. Emphasis is placed on techniques and the importance of rhythms, special awareness, and projection as means of creating variety in dance. Musical theatre history and repertory is introduced.THR 404 —Broadway Dance IIPrerequisite Take THR*312This course is designed to develop the advanced jazz dancer by a complex study of dynamics, styles, and combinations. Emphasis is placed on technique, the importance of rhythms, spatial awareness, and projection as means of fine-tuning dance. Musical theatre history and repertory is introduced.THR 407 —Honors Thesis IIndividual research of a substantive nature pursued in the student's major field of study. The research will conclude in a written thesis or an original project, and an oral defense.THR 408 —Honors Thesis IIIndividual research of a substantive nature pursued in the student's major field of study. The research will conclude in a written thesis or an original project, and an oral defense.THR 409 —Ballet VPrerequisite take thr*211This course will concentrate on barre exercises in progressive combinations including: balances on releve, complex locomotive patterns, turns, and jumps. Students will be required to create ballet phrases and demonstrate complex movement.THR 410 —Ballet VIPrerequisite take thr*212This course is designed for the advanced ballet student. Class will be taught at an accelerated pace. It will include advanced and complex combinations incorporating jumps with turns, beats, partnering techniques, and choreographic exploration.THR 411 —History and Literature of TheatreA study of the development of theatrical performance from the Greeks through Asian theatres to Shakespeare, with emphasis on reading and analyzing representative performance texts from each period.THR 412 —History and Literature of Theatre IIA study of the development of theatrical performance, from the Italian Renaissance through the rise of realism at the end of the 19th century, with an emphasis of understanding theatrical style through diverse performance texts.THR 413 —History and Literature of Theatre IIIA study of the development of theatrical performance from the 20th century to the present day, with emphasis on work in North America and Europe.THR 414 —American Theatre and Drama: From theThis course examines the development of American theatre, historically and dramatically, from Colonial times to the advent of Eugene O'Neill. The emphasis is on plays from the 18th, 19th, and early 20th century theatre.THR 415 —Cont Theaters of Global MajsPrerequisite TakeTHR 412This course explores theatres of the global majority since the 1940s. This term broadly encompasses Black, Asian, Latinx, indigenous, bi-racial, and others long considered minorities through a Western lens. Students will read plays and learn about their context to understand the variety of stylistic and social deployments of theatre.THR 417 —Acting-Synthesis & the ProfessionPrerequisite Must have taken THR*307 and THR*308;An advanced acting course emphasizing the synthesis of skills and techniques explored in the previous years of study. Special attention is placed on developing a range of audition material. Classes are devoted to the business aspects of the acting profession.THR 418 —Acting-Synthesis & the ProfessionPrerequisite Must have taken THR*307 and THR*308;An advanced acting course emphasizing the synthesis of skills and techniques explored in the previous years of study. Special attention is placed on developing a range of audition material. Classes are devoted to the business aspects of the acting profession.THR 423 —Physical Theatre III Prerequisite Take THR*324Practical study of physical character development and visual narrative using improvisation techniques, including contact improv, devised pieces, and articulating visual perceptions on paper. Classical Commedia dell 'Arte characters are explored, using masks, existing traditional scenarios, and modern commedia is introduced through performance of a new adaptation.THR 424 —Physical Theatre IV Prerequisite Take THR*423The class will apply the techniques of clowning and improvisation to the creation of physically based dramatic narratives. The process will include developing a personal clown, a family of clowns, and a clown play. Audition techniques from the visual perspective and the actor as creator will also be explored.THR 425 —DirectingA study of general directorial problems and solutions: auditions, blocking, pace, rhythm, characterization, composition, picturization, movement, and general design. The student also prepares a short play from the beginning to actual performance.THR 430 —Senior SeminarThe senior seminar is an integrative capstone course requiring general theatre students to conduct research on a question or problem in a specific area of theatre. It will be conducted as an independent research effort with each student meeting privately with his or her research adviser. Students will write a senior thesis applying their acquired skills to a central topic, theme, or question.THR 431 —Senior Seminar IIPrerequisite THR*430The Senior Seminar II is the continuation of an interactive capstone course, requiring specialized theatre students to conduct research on a question or problem in a specific area of concentration in theatre. It will be conducted as an independent research effort with each student meeting privately with his or her research advisor. Students will write a senior thesis applying their acquired skills to a central topic, theme or question and present the findings in a forum appropriate to the subject.THR 445 —Advanced Design StudioPrerequisite Must have taken THR*337 THR*339 and THR*331;This independent study serves as the capstone course restricted to seniors in the design/technology sequence. Students will apply the knowledge and skills acquired over the course of their program to further their individual goals. The topics will be determined by the instructors and will vary by student need.THR 493 —Theatre Internship/Co-opA junior or senior work-study program providing relevant employment experience. Registration will occur at the beginning of the experience. The objective of the program is to integrate classroom theory and practical work experience, thus lending relevancy to learning and providing the student with a realistic exposure to career opportunities. Students interested in taking an internship or co-op should talk to their adviser.THR 494 —Theatre Internship/Co-opA junior or senior work-study program providing relevant employment experience. Registration will occur at the beginning of the experience. The objective of the program is to integrate classroom theory and practical work experience, thus lending relevancy to learning and providing the student with a realistic exposure to career opportunities. Students interested in taking an internship or co-op should talk to their adviser.THR 495 —Theatre Internship/Co-opA junior or senior work-study program providing relevant employment experience. Registration will occur at the beginning of the experience. The objective of the program is to integrate classroom theory and practical work experience, thus lending relevancy to learning and providing the student with a realistic exposure to career opportunities. Students interested in taking an internship or co-op should talk to their adviser.THR 496 —Theatre Internship/Co-opA junior or senior work-study program providing relevant employment experience. Registration will occur at the beginning of the experience. The objective of the program is to integrate classroom theory and practical work experience, thus lending relevancy to learning and providing the student with a realistic exposure to career opportunities. Students interested in taking an internship or co-op should talk to their adviser.",
            "instructors": [],
            "textbooks": [],
            "zoom_link": null
        },
        {
            "number": "109",
            "title": "110 in which more advanced techniques are explored with a focus on interpretation and audition techniques",
            "description": "Students continue to develop necessary skills for successful music theater performance utilizing the widening body of music theatre repertoire.THR 310 —Vocal Performance IVA continuation of THR 109-110 in which more advanced techniques are explored with a focus on interpretation and audition techniques. Students continue to develop necessary skills for successful music theater performance utilizing the widening body of music theater repertoire.THR 311 —Jazz Dance IIIPrerequisite Take THR*230;This class is geared to the student with some formal experience in jazz dance training. This course engages the dynamic sensitivity of the body to be able to communicate through movement. Specific jazz styles and choreographic formats are studied using basic steps and challenging combinations. The area of dance choreography is introduced.THR 312 —Jazz Dance IVPrerequisite Take THR*231This class is geared to the student with extensive formal experience in jazz dance training. This course challenges the dynamic and sensitivity of the body to be able to communicate through movement. Specific jazz styles and choreographic formats are studied using complex steps and challenging combinations. The area of dance choreography is introduced,THR 320 —Stage Combat IIIPrerequisite Take THR*301The accomplished actor combatant will explore advanced techniques in certain martial styles, ranging from classical to contemporary. Emphasis will be placed on organic storytelling and the creation of collaborative performances. Safety is emphasized. Instructor permission required.THR 321 —Tap Dance IThis course is an introduction to the field of tap dancing, beginning with basic single, double, triple, and quadruple sounds, simple combinations, rhythmic patterning, and routines. The material is designed for the novice and the beginning level.THR 322 —Tap Dance IIPrerequisite Take THR*321This course is an exploration into the field of tap dancing, beginning with single, double, triple, and quadruple sounds, combinations, rhythmic patterning, and routines. The material is designed for the intermediate and advanced level.THR 323 —Physical Theatre I Development of practical physical theatre skills: juggling, mime techniques and illusions, and body awareness. Exploration of analysis of movement theories. Performance of pantomime, gesture language, and gestural cartooning.THR 324 —Physical Theatre II Practical study of mask play and visual character development using neutral, larval, expressive, and found masks, Simple mask making. Alternative puppetry. Examination of current trends in physical theatre.THR 326 —Music Theatre RepertoirePrerequisite Take THR*202 or THR*110A focus on music literacy and advanced study of performance techniques for the music theatre singer utilizing repertoire from the diverse styles of music theatre.THR 329 —PlaywritingAn introductory course in the problems and practices of playwriting. Emphasis is placed on the development and revision of a one-act play. Students also are acquainted with opportunities for production and publication.THR 331 —Costume DesignPrerequisite Take FAA*120 or THR*120Students learn the process of costume design for the theatre. Techniques covered include: script analysis, character conceptualization, research, and basic rendering. Art supplies required.THR 337 —Scene DesignPrerequisite Take FAA*120 or THR*120This course will introduce students to the basic skills required to be a scenic designer. The goal of the course is to expose, explore, and develop methods of visual communication within the design process of scenic design. This course will introduce students to script analysis, research, drafting, painting, collage, and model building. Drafting kit and art supplies required.THR 339 —Lighting DesignAn introductory study of the art of lighting for the stage from the initial concept through electricity, instruments, color, plots, and designing for various types of stages. Drafting kit required.THR 343 —Pattern DraftingPrerequisite THR*243This is a studio course in which the student will learn the fundamentals of pattern drafting through demonstrations and practical applications. Topics covered include: drafting a basic pattern set consisting of a bodice, skirt, and sleeve, manipulating darts, adding fullness, and learning how to fit the body.THR 344 —History of Decor FashionThis course is a study of clothing and the decorative arts . The historical periods from Prehistory to the Baroque and the societies within which they developed will be covered. The student will gain knowledge of the connections between the present and the past in Western culture. This is an upper division course, not necessarily appropriate for freshmen students.THR 345 —History of Decor IIThis course is a study of clothing and the decorative arts . The historical periods from the Baroques to the present, and the societies within which they developed will be covered. The student will gain knowledge of the connections between the present and the past in Western culture.THR 347 —Special Topics-CostumeIn this studio course students will examine in detail the fundamental construction and application techniques used to create a variety of costume specialties. Sample topics: corsets and petticoats, mask making, jewelry making, millinery, dancewear, and men's tailoring. This course may be taken up to three times with different course topics. Lab fee.THR 350 —Advanced Make-upPrerequisite Take THR 270 orFAA 270The design, creation, and use of prosthetics, wigs, facial hair, blood, and other special effects are used to create realistic and fantastical characters. Lab Fee.THR 362 —Dramatic Theory and CriticismA study of the history and development of dramatic theory and criticism from ancient times to the present. Students will analyze distinct conceptions of theatre across both time and geography through engagement with selected theorists.THR 400 —ShakespeareThis course examines in-depth representative plays of Shakespeare in each of the genres: tragedy, comedy, history, and romance, as well as the sonnets.THR 401 —Performance Techniques VIIPrerequisite Must have taken THR*301 and THR*302;An advanced course for the senior performance emphasis student comprising a range of separate skills classes including: Acting-Synthesis & The Profession, Ballet, and Physical Theatre IV. Lab fee.THR 402 —Performance Techniques VIIIPrerequisite Take THR*401An advanced course for the senior performance emphasis student comprising a range of separate skills classes including: Acting-Synthesis & The Profession, Advanced Jazz Dance, and Vocal Performance VI. Lab fee.THR 403 —Broadway Dance IPrerequisite Take THR*311This course is designed to develop the advanced jazz dancer through the study of complex dynamic styles and combinations. Emphasis is placed on techniques and the importance of rhythms, special awareness, and projection as means of creating variety in dance. Musical theatre history and repertory is introduced.THR 404 —Broadway Dance IIPrerequisite Take THR*312This course is designed to develop the advanced jazz dancer by a complex study of dynamics, styles, and combinations. Emphasis is placed on technique, the importance of rhythms, spatial awareness, and projection as means of fine-tuning dance. Musical theatre history and repertory is introduced.THR 407 —Honors Thesis IIndividual research of a substantive nature pursued in the student's major field of study. The research will conclude in a written thesis or an original project, and an oral defense.THR 408 —Honors Thesis IIIndividual research of a substantive nature pursued in the student's major field of study. The research will conclude in a written thesis or an original project, and an oral defense.THR 409 —Ballet VPrerequisite take thr*211This course will concentrate on barre exercises in progressive combinations including: balances on releve, complex locomotive patterns, turns, and jumps. Students will be required to create ballet phrases and demonstrate complex movement.THR 410 —Ballet VIPrerequisite take thr*212This course is designed for the advanced ballet student. Class will be taught at an accelerated pace. It will include advanced and complex combinations incorporating jumps with turns, beats, partnering techniques, and choreographic exploration.THR 411 —History and Literature of TheatreA study of the development of theatrical performance from the Greeks through Asian theatres to Shakespeare, with emphasis on reading and analyzing representative performance texts from each period.THR 412 —History and Literature of Theatre IIA study of the development of theatrical performance, from the Italian Renaissance through the rise of realism at the end of the 19th century, with an emphasis of understanding theatrical style through diverse performance texts.THR 413 —History and Literature of Theatre IIIA study of the development of theatrical performance from the 20th century to the present day, with emphasis on work in North America and Europe.THR 414 —American Theatre and Drama: From theThis course examines the development of American theatre, historically and dramatically, from Colonial times to the advent of Eugene O'Neill. The emphasis is on plays from the 18th, 19th, and early 20th century theatre.THR 415 —Cont Theaters of Global MajsPrerequisite TakeTHR 412This course explores theatres of the global majority since the 1940s. This term broadly encompasses Black, Asian, Latinx, indigenous, bi-racial, and others long considered minorities through a Western lens. Students will read plays and learn about their context to understand the variety of stylistic and social deployments of theatre.THR 417 —Acting-Synthesis & the ProfessionPrerequisite Must have taken THR*307 and THR*308;An advanced acting course emphasizing the synthesis of skills and techniques explored in the previous years of study. Special attention is placed on developing a range of audition material. Classes are devoted to the business aspects of the acting profession.THR 418 —Acting-Synthesis & the ProfessionPrerequisite Must have taken THR*307 and THR*308;An advanced acting course emphasizing the synthesis of skills and techniques explored in the previous years of study. Special attention is placed on developing a range of audition material. Classes are devoted to the business aspects of the acting profession.THR 423 —Physical Theatre III Prerequisite Take THR*324Practical study of physical character development and visual narrative using improvisation techniques, including contact improv, devised pieces, and articulating visual perceptions on paper. Classical Commedia dell 'Arte characters are explored, using masks, existing traditional scenarios, and modern commedia is introduced through performance of a new adaptation.THR 424 —Physical Theatre IV Prerequisite Take THR*423The class will apply the techniques of clowning and improvisation to the creation of physically based dramatic narratives. The process will include developing a personal clown, a family of clowns, and a clown play. Audition techniques from the visual perspective and the actor as creator will also be explored.THR 425 —DirectingA study of general directorial problems and solutions: auditions, blocking, pace, rhythm, characterization, composition, picturization, movement, and general design. The student also prepares a short play from the beginning to actual performance.THR 430 —Senior SeminarThe senior seminar is an integrative capstone course requiring general theatre students to conduct research on a question or problem in a specific area of theatre. It will be conducted as an independent research effort with each student meeting privately with his or her research adviser. Students will write a senior thesis applying their acquired skills to a central topic, theme, or question.THR 431 —Senior Seminar IIPrerequisite THR*430The Senior Seminar II is the continuation of an interactive capstone course, requiring specialized theatre students to conduct research on a question or problem in a specific area of concentration in theatre. It will be conducted as an independent research effort with each student meeting privately with his or her research advisor. Students will write a senior thesis applying their acquired skills to a central topic, theme or question and present the findings in a forum appropriate to the subject.THR 445 —Advanced Design StudioPrerequisite Must have taken THR*337 THR*339 and THR*331;This independent study serves as the capstone course restricted to seniors in the design/technology sequence. Students will apply the knowledge and skills acquired over the course of their program to further their individual goals. The topics will be determined by the instructors and will vary by student need.THR 493 —Theatre Internship/Co-opA junior or senior work-study program providing relevant employment experience. Registration will occur at the beginning of the experience. The objective of the program is to integrate classroom theory and practical work experience, thus lending relevancy to learning and providing the student with a realistic exposure to career opportunities. Students interested in taking an internship or co-op should talk to their adviser.THR 494 —Theatre Internship/Co-opA junior or senior work-study program providing relevant employment experience. Registration will occur at the beginning of the experience. The objective of the program is to integrate classroom theory and practical work experience, thus lending relevancy to learning and providing the student with a realistic exposure to career opportunities. Students interested in taking an internship or co-op should talk to their adviser.THR 495 —Theatre Internship/Co-opA junior or senior work-study program providing relevant employment experience. Registration will occur at the beginning of the experience. The objective of the program is to integrate classroom theory and practical work experience, thus lending relevancy to learning and providing the student with a realistic exposure to career opportunities. Students interested in taking an internship or co-op should talk to their adviser.THR 496 —Theatre Internship/Co-opA junior or senior work-study program providing relevant employment experience. Registration will occur at the beginning of the experience. The objective of the program is to integrate classroom theory and practical work experience, thus lending relevancy to learning and providing the student with a realistic exposure to career opportunities. Students interested in taking an internship or co-op should talk to their adviser.",
            "instructors": [],
            "textbooks": [],
            "zoom_link": null
        },
        {
            "number": "109",
            "title": "110 in which more advanced techniques are explored with a focus on interpretation and audition techniques",
            "description": "Students continue to develop necessary skills for successful music theater performance utilizing the widening body of music theatre repertoire.THR 310 —Vocal Performance IVA continuation of THR 109-110 in which more advanced techniques are explored with a focus on interpretation and audition techniques. Students continue to develop necessary skills for successful music theater performance utilizing the widening body of music theater repertoire.THR 311 —Jazz Dance IIIPrerequisite Take THR*230;This class is geared to the student with some formal experience in jazz dance training. This course engages the dynamic sensitivity of the body to be able to communicate through movement. Specific jazz styles and choreographic formats are studied using basic steps and challenging combinations. The area of dance choreography is introduced.THR 312 —Jazz Dance IVPrerequisite Take THR*231This class is geared to the student with extensive formal experience in jazz dance training. This course challenges the dynamic and sensitivity of the body to be able to communicate through movement. Specific jazz styles and choreographic formats are studied using complex steps and challenging combinations. The area of dance choreography is introduced,THR 320 —Stage Combat IIIPrerequisite Take THR*301The accomplished actor combatant will explore advanced techniques in certain martial styles, ranging from classical to contemporary. Emphasis will be placed on organic storytelling and the creation of collaborative performances. Safety is emphasized. Instructor permission required.THR 321 —Tap Dance IThis course is an introduction to the field of tap dancing, beginning with basic single, double, triple, and quadruple sounds, simple combinations, rhythmic patterning, and routines. The material is designed for the novice and the beginning level.THR 322 —Tap Dance IIPrerequisite Take THR*321This course is an exploration into the field of tap dancing, beginning with single, double, triple, and quadruple sounds, combinations, rhythmic patterning, and routines. The material is designed for the intermediate and advanced level.THR 323 —Physical Theatre I Development of practical physical theatre skills: juggling, mime techniques and illusions, and body awareness. Exploration of analysis of movement theories. Performance of pantomime, gesture language, and gestural cartooning.THR 324 —Physical Theatre II Practical study of mask play and visual character development using neutral, larval, expressive, and found masks, Simple mask making. Alternative puppetry. Examination of current trends in physical theatre.THR 326 —Music Theatre RepertoirePrerequisite Take THR*202 or THR*110A focus on music literacy and advanced study of performance techniques for the music theatre singer utilizing repertoire from the diverse styles of music theatre.THR 329 —PlaywritingAn introductory course in the problems and practices of playwriting. Emphasis is placed on the development and revision of a one-act play. Students also are acquainted with opportunities for production and publication.THR 331 —Costume DesignPrerequisite Take FAA*120 or THR*120Students learn the process of costume design for the theatre. Techniques covered include: script analysis, character conceptualization, research, and basic rendering. Art supplies required.THR 337 —Scene DesignPrerequisite Take FAA*120 or THR*120This course will introduce students to the basic skills required to be a scenic designer. The goal of the course is to expose, explore, and develop methods of visual communication within the design process of scenic design. This course will introduce students to script analysis, research, drafting, painting, collage, and model building. Drafting kit and art supplies required.THR 339 —Lighting DesignAn introductory study of the art of lighting for the stage from the initial concept through electricity, instruments, color, plots, and designing for various types of stages. Drafting kit required.THR 343 —Pattern DraftingPrerequisite THR*243This is a studio course in which the student will learn the fundamentals of pattern drafting through demonstrations and practical applications. Topics covered include: drafting a basic pattern set consisting of a bodice, skirt, and sleeve, manipulating darts, adding fullness, and learning how to fit the body.THR 344 —History of Decor FashionThis course is a study of clothing and the decorative arts . The historical periods from Prehistory to the Baroque and the societies within which they developed will be covered. The student will gain knowledge of the connections between the present and the past in Western culture. This is an upper division course, not necessarily appropriate for freshmen students.THR 345 —History of Decor IIThis course is a study of clothing and the decorative arts . The historical periods from the Baroques to the present, and the societies within which they developed will be covered. The student will gain knowledge of the connections between the present and the past in Western culture.THR 347 —Special Topics-CostumeIn this studio course students will examine in detail the fundamental construction and application techniques used to create a variety of costume specialties. Sample topics: corsets and petticoats, mask making, jewelry making, millinery, dancewear, and men's tailoring. This course may be taken up to three times with different course topics. Lab fee.THR 350 —Advanced Make-upPrerequisite Take THR 270 orFAA 270The design, creation, and use of prosthetics, wigs, facial hair, blood, and other special effects are used to create realistic and fantastical characters. Lab Fee.THR 362 —Dramatic Theory and CriticismA study of the history and development of dramatic theory and criticism from ancient times to the present. Students will analyze distinct conceptions of theatre across both time and geography through engagement with selected theorists.THR 400 —ShakespeareThis course examines in-depth representative plays of Shakespeare in each of the genres: tragedy, comedy, history, and romance, as well as the sonnets.THR 401 —Performance Techniques VIIPrerequisite Must have taken THR*301 and THR*302;An advanced course for the senior performance emphasis student comprising a range of separate skills classes including: Acting-Synthesis & The Profession, Ballet, and Physical Theatre IV. Lab fee.THR 402 —Performance Techniques VIIIPrerequisite Take THR*401An advanced course for the senior performance emphasis student comprising a range of separate skills classes including: Acting-Synthesis & The Profession, Advanced Jazz Dance, and Vocal Performance VI. Lab fee.THR 403 —Broadway Dance IPrerequisite Take THR*311This course is designed to develop the advanced jazz dancer through the study of complex dynamic styles and combinations. Emphasis is placed on techniques and the importance of rhythms, special awareness, and projection as means of creating variety in dance. Musical theatre history and repertory is introduced.THR 404 —Broadway Dance IIPrerequisite Take THR*312This course is designed to develop the advanced jazz dancer by a complex study of dynamics, styles, and combinations. Emphasis is placed on technique, the importance of rhythms, spatial awareness, and projection as means of fine-tuning dance. Musical theatre history and repertory is introduced.THR 407 —Honors Thesis IIndividual research of a substantive nature pursued in the student's major field of study. The research will conclude in a written thesis or an original project, and an oral defense.THR 408 —Honors Thesis IIIndividual research of a substantive nature pursued in the student's major field of study. The research will conclude in a written thesis or an original project, and an oral defense.THR 409 —Ballet VPrerequisite take thr*211This course will concentrate on barre exercises in progressive combinations including: balances on releve, complex locomotive patterns, turns, and jumps. Students will be required to create ballet phrases and demonstrate complex movement.THR 410 —Ballet VIPrerequisite take thr*212This course is designed for the advanced ballet student. Class will be taught at an accelerated pace. It will include advanced and complex combinations incorporating jumps with turns, beats, partnering techniques, and choreographic exploration.THR 411 —History and Literature of TheatreA study of the development of theatrical performance from the Greeks through Asian theatres to Shakespeare, with emphasis on reading and analyzing representative performance texts from each period.THR 412 —History and Literature of Theatre IIA study of the development of theatrical performance, from the Italian Renaissance through the rise of realism at the end of the 19th century, with an emphasis of understanding theatrical style through diverse performance texts.THR 413 —History and Literature of Theatre IIIA study of the development of theatrical performance from the 20th century to the present day, with emphasis on work in North America and Europe.THR 414 —American Theatre and Drama: From theThis course examines the development of American theatre, historically and dramatically, from Colonial times to the advent of Eugene O'Neill. The emphasis is on plays from the 18th, 19th, and early 20th century theatre.THR 415 —Cont Theaters of Global MajsPrerequisite TakeTHR 412This course explores theatres of the global majority since the 1940s. This term broadly encompasses Black, Asian, Latinx, indigenous, bi-racial, and others long considered minorities through a Western lens. Students will read plays and learn about their context to understand the variety of stylistic and social deployments of theatre.THR 417 —Acting-Synthesis & the ProfessionPrerequisite Must have taken THR*307 and THR*308;An advanced acting course emphasizing the synthesis of skills and techniques explored in the previous years of study. Special attention is placed on developing a range of audition material. Classes are devoted to the business aspects of the acting profession.THR 418 —Acting-Synthesis & the ProfessionPrerequisite Must have taken THR*307 and THR*308;An advanced acting course emphasizing the synthesis of skills and techniques explored in the previous years of study. Special attention is placed on developing a range of audition material. Classes are devoted to the business aspects of the acting profession.THR 423 —Physical Theatre III Prerequisite Take THR*324Practical study of physical character development and visual narrative using improvisation techniques, including contact improv, devised pieces, and articulating visual perceptions on paper. Classical Commedia dell 'Arte characters are explored, using masks, existing traditional scenarios, and modern commedia is introduced through performance of a new adaptation.THR 424 —Physical Theatre IV Prerequisite Take THR*423The class will apply the techniques of clowning and improvisation to the creation of physically based dramatic narratives. The process will include developing a personal clown, a family of clowns, and a clown play. Audition techniques from the visual perspective and the actor as creator will also be explored.THR 425 —DirectingA study of general directorial problems and solutions: auditions, blocking, pace, rhythm, characterization, composition, picturization, movement, and general design. The student also prepares a short play from the beginning to actual performance.THR 430 —Senior SeminarThe senior seminar is an integrative capstone course requiring general theatre students to conduct research on a question or problem in a specific area of theatre. It will be conducted as an independent research effort with each student meeting privately with his or her research adviser. Students will write a senior thesis applying their acquired skills to a central topic, theme, or question.THR 431 —Senior Seminar IIPrerequisite THR*430The Senior Seminar II is the continuation of an interactive capstone course, requiring specialized theatre students to conduct research on a question or problem in a specific area of concentration in theatre. It will be conducted as an independent research effort with each student meeting privately with his or her research advisor. Students will write a senior thesis applying their acquired skills to a central topic, theme or question and present the findings in a forum appropriate to the subject.THR 445 —Advanced Design StudioPrerequisite Must have taken THR*337 THR*339 and THR*331;This independent study serves as the capstone course restricted to seniors in the design/technology sequence. Students will apply the knowledge and skills acquired over the course of their program to further their individual goals. The topics will be determined by the instructors and will vary by student need.THR 493 —Theatre Internship/Co-opA junior or senior work-study program providing relevant employment experience. Registration will occur at the beginning of the experience. The objective of the program is to integrate classroom theory and practical work experience, thus lending relevancy to learning and providing the student with a realistic exposure to career opportunities. Students interested in taking an internship or co-op should talk to their adviser.THR 494 —Theatre Internship/Co-opA junior or senior work-study program providing relevant employment experience. Registration will occur at the beginning of the experience. The objective of the program is to integrate classroom theory and practical work experience, thus lending relevancy to learning and providing the student with a realistic exposure to career opportunities. Students interested in taking an internship or co-op should talk to their adviser.THR 495 —Theatre Internship/Co-opA junior or senior work-study program providing relevant employment experience. Registration will occur at the beginning of the experience. The objective of the program is to integrate classroom theory and practical work experience, thus lending relevancy to learning and providing the student with a realistic exposure to career opportunities. Students interested in taking an internship or co-op should talk to their adviser.THR 496 —Theatre Internship/Co-opA junior or senior work-study program providing relevant employment experience. Registration will occur at the beginning of the experience. The objective of the program is to integrate classroom theory and practical work experience, thus lending relevancy to learning and providing the student with a realistic exposure to career opportunities. Students interested in taking an internship or co-op should talk to their adviser.",
            "instructors": [],
            "textbooks": [],
            "zoom_link": null
        },
        {
            "number": "109",
            "title": "110 in which more advanced techniques are explored with a focus on interpretation and audition techniques",
            "description": "Students continue to develop necessary skills for successful music theater performance utilizing the widening body of music theatre repertoire.THR 310 —Vocal Performance IVA continuation of THR 109-110 in which more advanced techniques are explored with a focus on interpretation and audition techniques. Students continue to develop necessary skills for successful music theater performance utilizing the widening body of music theater repertoire.THR 311 —Jazz Dance IIIPrerequisite Take THR*230;This class is geared to the student with some formal experience in jazz dance training. This course engages the dynamic sensitivity of the body to be able to communicate through movement. Specific jazz styles and choreographic formats are studied using basic steps and challenging combinations. The area of dance choreography is introduced.THR 312 —Jazz Dance IVPrerequisite Take THR*231This class is geared to the student with extensive formal experience in jazz dance training. This course challenges the dynamic and sensitivity of the body to be able to communicate through movement. Specific jazz styles and choreographic formats are studied using complex steps and challenging combinations. The area of dance choreography is introduced,THR 320 —Stage Combat IIIPrerequisite Take THR*301The accomplished actor combatant will explore advanced techniques in certain martial styles, ranging from classical to contemporary. Emphasis will be placed on organic storytelling and the creation of collaborative performances. Safety is emphasized. Instructor permission required.THR 321 —Tap Dance IThis course is an introduction to the field of tap dancing, beginning with basic single, double, triple, and quadruple sounds, simple combinations, rhythmic patterning, and routines. The material is designed for the novice and the beginning level.THR 322 —Tap Dance IIPrerequisite Take THR*321This course is an exploration into the field of tap dancing, beginning with single, double, triple, and quadruple sounds, combinations, rhythmic patterning, and routines. The material is designed for the intermediate and advanced level.THR 323 —Physical Theatre I Development of practical physical theatre skills: juggling, mime techniques and illusions, and body awareness. Exploration of analysis of movement theories. Performance of pantomime, gesture language, and gestural cartooning.THR 324 —Physical Theatre II Practical study of mask play and visual character development using neutral, larval, expressive, and found masks, Simple mask making. Alternative puppetry. Examination of current trends in physical theatre.THR 326 —Music Theatre RepertoirePrerequisite Take THR*202 or THR*110A focus on music literacy and advanced study of performance techniques for the music theatre singer utilizing repertoire from the diverse styles of music theatre.THR 329 —PlaywritingAn introductory course in the problems and practices of playwriting. Emphasis is placed on the development and revision of a one-act play. Students also are acquainted with opportunities for production and publication.THR 331 —Costume DesignPrerequisite Take FAA*120 or THR*120Students learn the process of costume design for the theatre. Techniques covered include: script analysis, character conceptualization, research, and basic rendering. Art supplies required.THR 337 —Scene DesignPrerequisite Take FAA*120 or THR*120This course will introduce students to the basic skills required to be a scenic designer. The goal of the course is to expose, explore, and develop methods of visual communication within the design process of scenic design. This course will introduce students to script analysis, research, drafting, painting, collage, and model building. Drafting kit and art supplies required.THR 339 —Lighting DesignAn introductory study of the art of lighting for the stage from the initial concept through electricity, instruments, color, plots, and designing for various types of stages. Drafting kit required.THR 343 —Pattern DraftingPrerequisite THR*243This is a studio course in which the student will learn the fundamentals of pattern drafting through demonstrations and practical applications. Topics covered include: drafting a basic pattern set consisting of a bodice, skirt, and sleeve, manipulating darts, adding fullness, and learning how to fit the body.THR 344 —History of Decor FashionThis course is a study of clothing and the decorative arts . The historical periods from Prehistory to the Baroque and the societies within which they developed will be covered. The student will gain knowledge of the connections between the present and the past in Western culture. This is an upper division course, not necessarily appropriate for freshmen students.THR 345 —History of Decor IIThis course is a study of clothing and the decorative arts . The historical periods from the Baroques to the present, and the societies within which they developed will be covered. The student will gain knowledge of the connections between the present and the past in Western culture.THR 347 —Special Topics-CostumeIn this studio course students will examine in detail the fundamental construction and application techniques used to create a variety of costume specialties. Sample topics: corsets and petticoats, mask making, jewelry making, millinery, dancewear, and men's tailoring. This course may be taken up to three times with different course topics. Lab fee.THR 350 —Advanced Make-upPrerequisite Take THR 270 orFAA 270The design, creation, and use of prosthetics, wigs, facial hair, blood, and other special effects are used to create realistic and fantastical characters. Lab Fee.THR 362 —Dramatic Theory and CriticismA study of the history and development of dramatic theory and criticism from ancient times to the present. Students will analyze distinct conceptions of theatre across both time and geography through engagement with selected theorists.THR 400 —ShakespeareThis course examines in-depth representative plays of Shakespeare in each of the genres: tragedy, comedy, history, and romance, as well as the sonnets.THR 401 —Performance Techniques VIIPrerequisite Must have taken THR*301 and THR*302;An advanced course for the senior performance emphasis student comprising a range of separate skills classes including: Acting-Synthesis & The Profession, Ballet, and Physical Theatre IV. Lab fee.THR 402 —Performance Techniques VIIIPrerequisite Take THR*401An advanced course for the senior performance emphasis student comprising a range of separate skills classes including: Acting-Synthesis & The Profession, Advanced Jazz Dance, and Vocal Performance VI. Lab fee.THR 403 —Broadway Dance IPrerequisite Take THR*311This course is designed to develop the advanced jazz dancer through the study of complex dynamic styles and combinations. Emphasis is placed on techniques and the importance of rhythms, special awareness, and projection as means of creating variety in dance. Musical theatre history and repertory is introduced.THR 404 —Broadway Dance IIPrerequisite Take THR*312This course is designed to develop the advanced jazz dancer by a complex study of dynamics, styles, and combinations. Emphasis is placed on technique, the importance of rhythms, spatial awareness, and projection as means of fine-tuning dance. Musical theatre history and repertory is introduced.THR 407 —Honors Thesis IIndividual research of a substantive nature pursued in the student's major field of study. The research will conclude in a written thesis or an original project, and an oral defense.THR 408 —Honors Thesis IIIndividual research of a substantive nature pursued in the student's major field of study. The research will conclude in a written thesis or an original project, and an oral defense.THR 409 —Ballet VPrerequisite take thr*211This course will concentrate on barre exercises in progressive combinations including: balances on releve, complex locomotive patterns, turns, and jumps. Students will be required to create ballet phrases and demonstrate complex movement.THR 410 —Ballet VIPrerequisite take thr*212This course is designed for the advanced ballet student. Class will be taught at an accelerated pace. It will include advanced and complex combinations incorporating jumps with turns, beats, partnering techniques, and choreographic exploration.THR 411 —History and Literature of TheatreA study of the development of theatrical performance from the Greeks through Asian theatres to Shakespeare, with emphasis on reading and analyzing representative performance texts from each period.THR 412 —History and Literature of Theatre IIA study of the development of theatrical performance, from the Italian Renaissance through the rise of realism at the end of the 19th century, with an emphasis of understanding theatrical style through diverse performance texts.THR 413 —History and Literature of Theatre IIIA study of the development of theatrical performance from the 20th century to the present day, with emphasis on work in North America and Europe.THR 414 —American Theatre and Drama: From theThis course examines the development of American theatre, historically and dramatically, from Colonial times to the advent of Eugene O'Neill. The emphasis is on plays from the 18th, 19th, and early 20th century theatre.THR 415 —Cont Theaters of Global MajsPrerequisite TakeTHR 412This course explores theatres of the global majority since the 1940s. This term broadly encompasses Black, Asian, Latinx, indigenous, bi-racial, and others long considered minorities through a Western lens. Students will read plays and learn about their context to understand the variety of stylistic and social deployments of theatre.THR 417 —Acting-Synthesis & the ProfessionPrerequisite Must have taken THR*307 and THR*308;An advanced acting course emphasizing the synthesis of skills and techniques explored in the previous years of study. Special attention is placed on developing a range of audition material. Classes are devoted to the business aspects of the acting profession.THR 418 —Acting-Synthesis & the ProfessionPrerequisite Must have taken THR*307 and THR*308;An advanced acting course emphasizing the synthesis of skills and techniques explored in the previous years of study. Special attention is placed on developing a range of audition material. Classes are devoted to the business aspects of the acting profession.THR 423 —Physical Theatre III Prerequisite Take THR*324Practical study of physical character development and visual narrative using improvisation techniques, including contact improv, devised pieces, and articulating visual perceptions on paper. Classical Commedia dell 'Arte characters are explored, using masks, existing traditional scenarios, and modern commedia is introduced through performance of a new adaptation.THR 424 —Physical Theatre IV Prerequisite Take THR*423The class will apply the techniques of clowning and improvisation to the creation of physically based dramatic narratives. The process will include developing a personal clown, a family of clowns, and a clown play. Audition techniques from the visual perspective and the actor as creator will also be explored.THR 425 —DirectingA study of general directorial problems and solutions: auditions, blocking, pace, rhythm, characterization, composition, picturization, movement, and general design. The student also prepares a short play from the beginning to actual performance.THR 430 —Senior SeminarThe senior seminar is an integrative capstone course requiring general theatre students to conduct research on a question or problem in a specific area of theatre. It will be conducted as an independent research effort with each student meeting privately with his or her research adviser. Students will write a senior thesis applying their acquired skills to a central topic, theme, or question.THR 431 —Senior Seminar IIPrerequisite THR*430The Senior Seminar II is the continuation of an interactive capstone course, requiring specialized theatre students to conduct research on a question or problem in a specific area of concentration in theatre. It will be conducted as an independent research effort with each student meeting privately with his or her research advisor. Students will write a senior thesis applying their acquired skills to a central topic, theme or question and present the findings in a forum appropriate to the subject.THR 445 —Advanced Design StudioPrerequisite Must have taken THR*337 THR*339 and THR*331;This independent study serves as the capstone course restricted to seniors in the design/technology sequence. Students will apply the knowledge and skills acquired over the course of their program to further their individual goals. The topics will be determined by the instructors and will vary by student need.THR 493 —Theatre Internship/Co-opA junior or senior work-study program providing relevant employment experience. Registration will occur at the beginning of the experience. The objective of the program is to integrate classroom theory and practical work experience, thus lending relevancy to learning and providing the student with a realistic exposure to career opportunities. Students interested in taking an internship or co-op should talk to their adviser.THR 494 —Theatre Internship/Co-opA junior or senior work-study program providing relevant employment experience. Registration will occur at the beginning of the experience. The objective of the program is to integrate classroom theory and practical work experience, thus lending relevancy to learning and providing the student with a realistic exposure to career opportunities. Students interested in taking an internship or co-op should talk to their adviser.THR 495 —Theatre Internship/Co-opA junior or senior work-study program providing relevant employment experience. Registration will occur at the beginning of the experience. The objective of the program is to integrate classroom theory and practical work experience, thus lending relevancy to learning and providing the student with a realistic exposure to career opportunities. Students interested in taking an internship or co-op should talk to their adviser.THR 496 —Theatre Internship/Co-opA junior or senior work-study program providing relevant employment experience. Registration will occur at the beginning of the experience. The objective of the program is to integrate classroom theory and practical work experience, thus lending relevancy to learning and providing the student with a realistic exposure to career opportunities. Students interested in taking an internship or co-op should talk to their adviser.",
            "instructors": [],
            "textbooks": [],
            "zoom_link": null
        },
        {
            "number": "109",
            "title": "110 in which more advanced techniques are explored with a focus on interpretation and audition techniques",
            "description": "Students continue to develop necessary skills for successful music theater performance utilizing the widening body of music theatre repertoire.THR 310 —Vocal Performance IVA continuation of THR 109-110 in which more advanced techniques are explored with a focus on interpretation and audition techniques. Students continue to develop necessary skills for successful music theater performance utilizing the widening body of music theater repertoire.THR 311 —Jazz Dance IIIPrerequisite Take THR*230;This class is geared to the student with some formal experience in jazz dance training. This course engages the dynamic sensitivity of the body to be able to communicate through movement. Specific jazz styles and choreographic formats are studied using basic steps and challenging combinations. The area of dance choreography is introduced.THR 312 —Jazz Dance IVPrerequisite Take THR*231This class is geared to the student with extensive formal experience in jazz dance training. This course challenges the dynamic and sensitivity of the body to be able to communicate through movement. Specific jazz styles and choreographic formats are studied using complex steps and challenging combinations. The area of dance choreography is introduced,THR 320 —Stage Combat IIIPrerequisite Take THR*301The accomplished actor combatant will explore advanced techniques in certain martial styles, ranging from classical to contemporary. Emphasis will be placed on organic storytelling and the creation of collaborative performances. Safety is emphasized. Instructor permission required.THR 321 —Tap Dance IThis course is an introduction to the field of tap dancing, beginning with basic single, double, triple, and quadruple sounds, simple combinations, rhythmic patterning, and routines. The material is designed for the novice and the beginning level.THR 322 —Tap Dance IIPrerequisite Take THR*321This course is an exploration into the field of tap dancing, beginning with single, double, triple, and quadruple sounds, combinations, rhythmic patterning, and routines. The material is designed for the intermediate and advanced level.THR 323 —Physical Theatre I Development of practical physical theatre skills: juggling, mime techniques and illusions, and body awareness. Exploration of analysis of movement theories. Performance of pantomime, gesture language, and gestural cartooning.THR 324 —Physical Theatre II Practical study of mask play and visual character development using neutral, larval, expressive, and found masks, Simple mask making. Alternative puppetry. Examination of current trends in physical theatre.THR 326 —Music Theatre RepertoirePrerequisite Take THR*202 or THR*110A focus on music literacy and advanced study of performance techniques for the music theatre singer utilizing repertoire from the diverse styles of music theatre.THR 329 —PlaywritingAn introductory course in the problems and practices of playwriting. Emphasis is placed on the development and revision of a one-act play. Students also are acquainted with opportunities for production and publication.THR 331 —Costume DesignPrerequisite Take FAA*120 or THR*120Students learn the process of costume design for the theatre. Techniques covered include: script analysis, character conceptualization, research, and basic rendering. Art supplies required.THR 337 —Scene DesignPrerequisite Take FAA*120 or THR*120This course will introduce students to the basic skills required to be a scenic designer. The goal of the course is to expose, explore, and develop methods of visual communication within the design process of scenic design. This course will introduce students to script analysis, research, drafting, painting, collage, and model building. Drafting kit and art supplies required.THR 339 —Lighting DesignAn introductory study of the art of lighting for the stage from the initial concept through electricity, instruments, color, plots, and designing for various types of stages. Drafting kit required.THR 343 —Pattern DraftingPrerequisite THR*243This is a studio course in which the student will learn the fundamentals of pattern drafting through demonstrations and practical applications. Topics covered include: drafting a basic pattern set consisting of a bodice, skirt, and sleeve, manipulating darts, adding fullness, and learning how to fit the body.THR 344 —History of Decor FashionThis course is a study of clothing and the decorative arts . The historical periods from Prehistory to the Baroque and the societies within which they developed will be covered. The student will gain knowledge of the connections between the present and the past in Western culture. This is an upper division course, not necessarily appropriate for freshmen students.THR 345 —History of Decor IIThis course is a study of clothing and the decorative arts . The historical periods from the Baroques to the present, and the societies within which they developed will be covered. The student will gain knowledge of the connections between the present and the past in Western culture.THR 347 —Special Topics-CostumeIn this studio course students will examine in detail the fundamental construction and application techniques used to create a variety of costume specialties. Sample topics: corsets and petticoats, mask making, jewelry making, millinery, dancewear, and men's tailoring. This course may be taken up to three times with different course topics. Lab fee.THR 350 —Advanced Make-upPrerequisite Take THR 270 orFAA 270The design, creation, and use of prosthetics, wigs, facial hair, blood, and other special effects are used to create realistic and fantastical characters. Lab Fee.THR 362 —Dramatic Theory and CriticismA study of the history and development of dramatic theory and criticism from ancient times to the present. Students will analyze distinct conceptions of theatre across both time and geography through engagement with selected theorists.THR 400 —ShakespeareThis course examines in-depth representative plays of Shakespeare in each of the genres: tragedy, comedy, history, and romance, as well as the sonnets.THR 401 —Performance Techniques VIIPrerequisite Must have taken THR*301 and THR*302;An advanced course for the senior performance emphasis student comprising a range of separate skills classes including: Acting-Synthesis & The Profession, Ballet, and Physical Theatre IV. Lab fee.THR 402 —Performance Techniques VIIIPrerequisite Take THR*401An advanced course for the senior performance emphasis student comprising a range of separate skills classes including: Acting-Synthesis & The Profession, Advanced Jazz Dance, and Vocal Performance VI. Lab fee.THR 403 —Broadway Dance IPrerequisite Take THR*311This course is designed to develop the advanced jazz dancer through the study of complex dynamic styles and combinations. Emphasis is placed on techniques and the importance of rhythms, special awareness, and projection as means of creating variety in dance. Musical theatre history and repertory is introduced.THR 404 —Broadway Dance IIPrerequisite Take THR*312This course is designed to develop the advanced jazz dancer by a complex study of dynamics, styles, and combinations. Emphasis is placed on technique, the importance of rhythms, spatial awareness, and projection as means of fine-tuning dance. Musical theatre history and repertory is introduced.THR 407 —Honors Thesis IIndividual research of a substantive nature pursued in the student's major field of study. The research will conclude in a written thesis or an original project, and an oral defense.THR 408 —Honors Thesis IIIndividual research of a substantive nature pursued in the student's major field of study. The research will conclude in a written thesis or an original project, and an oral defense.THR 409 —Ballet VPrerequisite take thr*211This course will concentrate on barre exercises in progressive combinations including: balances on releve, complex locomotive patterns, turns, and jumps. Students will be required to create ballet phrases and demonstrate complex movement.THR 410 —Ballet VIPrerequisite take thr*212This course is designed for the advanced ballet student. Class will be taught at an accelerated pace. It will include advanced and complex combinations incorporating jumps with turns, beats, partnering techniques, and choreographic exploration.THR 411 —History and Literature of TheatreA study of the development of theatrical performance from the Greeks through Asian theatres to Shakespeare, with emphasis on reading and analyzing representative performance texts from each period.THR 412 —History and Literature of Theatre IIA study of the development of theatrical performance, from the Italian Renaissance through the rise of realism at the end of the 19th century, with an emphasis of understanding theatrical style through diverse performance texts.THR 413 —History and Literature of Theatre IIIA study of the development of theatrical performance from the 20th century to the present day, with emphasis on work in North America and Europe.THR 414 —American Theatre and Drama: From theThis course examines the development of American theatre, historically and dramatically, from Colonial times to the advent of Eugene O'Neill. The emphasis is on plays from the 18th, 19th, and early 20th century theatre.THR 415 —Cont Theaters of Global MajsPrerequisite TakeTHR 412This course explores theatres of the global majority since the 1940s. This term broadly encompasses Black, Asian, Latinx, indigenous, bi-racial, and others long considered minorities through a Western lens. Students will read plays and learn about their context to understand the variety of stylistic and social deployments of theatre.THR 417 —Acting-Synthesis & the ProfessionPrerequisite Must have taken THR*307 and THR*308;An advanced acting course emphasizing the synthesis of skills and techniques explored in the previous years of study. Special attention is placed on developing a range of audition material. Classes are devoted to the business aspects of the acting profession.THR 418 —Acting-Synthesis & the ProfessionPrerequisite Must have taken THR*307 and THR*308;An advanced acting course emphasizing the synthesis of skills and techniques explored in the previous years of study. Special attention is placed on developing a range of audition material. Classes are devoted to the business aspects of the acting profession.THR 423 —Physical Theatre III Prerequisite Take THR*324Practical study of physical character development and visual narrative using improvisation techniques, including contact improv, devised pieces, and articulating visual perceptions on paper. Classical Commedia dell 'Arte characters are explored, using masks, existing traditional scenarios, and modern commedia is introduced through performance of a new adaptation.THR 424 —Physical Theatre IV Prerequisite Take THR*423The class will apply the techniques of clowning and improvisation to the creation of physically based dramatic narratives. The process will include developing a personal clown, a family of clowns, and a clown play. Audition techniques from the visual perspective and the actor as creator will also be explored.THR 425 —DirectingA study of general directorial problems and solutions: auditions, blocking, pace, rhythm, characterization, composition, picturization, movement, and general design. The student also prepares a short play from the beginning to actual performance.THR 430 —Senior SeminarThe senior seminar is an integrative capstone course requiring general theatre students to conduct research on a question or problem in a specific area of theatre. It will be conducted as an independent research effort with each student meeting privately with his or her research adviser. Students will write a senior thesis applying their acquired skills to a central topic, theme, or question.THR 431 —Senior Seminar IIPrerequisite THR*430The Senior Seminar II is the continuation of an interactive capstone course, requiring specialized theatre students to conduct research on a question or problem in a specific area of concentration in theatre. It will be conducted as an independent research effort with each student meeting privately with his or her research advisor. Students will write a senior thesis applying their acquired skills to a central topic, theme or question and present the findings in a forum appropriate to the subject.THR 445 —Advanced Design StudioPrerequisite Must have taken THR*337 THR*339 and THR*331;This independent study serves as the capstone course restricted to seniors in the design/technology sequence. Students will apply the knowledge and skills acquired over the course of their program to further their individual goals. The topics will be determined by the instructors and will vary by student need.THR 493 —Theatre Internship/Co-opA junior or senior work-study program providing relevant employment experience. Registration will occur at the beginning of the experience. The objective of the program is to integrate classroom theory and practical work experience, thus lending relevancy to learning and providing the student with a realistic exposure to career opportunities. Students interested in taking an internship or co-op should talk to their adviser.THR 494 —Theatre Internship/Co-opA junior or senior work-study program providing relevant employment experience. Registration will occur at the beginning of the experience. The objective of the program is to integrate classroom theory and practical work experience, thus lending relevancy to learning and providing the student with a realistic exposure to career opportunities. Students interested in taking an internship or co-op should talk to their adviser.THR 495 —Theatre Internship/Co-opA junior or senior work-study program providing relevant employment experience. Registration will occur at the beginning of the experience. The objective of the program is to integrate classroom theory and practical work experience, thus lending relevancy to learning and providing the student with a realistic exposure to career opportunities. Students interested in taking an internship or co-op should talk to their adviser.THR 496 —Theatre Internship/Co-opA junior or senior work-study program providing relevant employment experience. Registration will occur at the beginning of the experience. The objective of the program is to integrate classroom theory and practical work experience, thus lending relevancy to learning and providing the student with a realistic exposure to career opportunities. Students interested in taking an internship or co-op should talk to their adviser.",
            "instructors": [],
            "textbooks": [],
            "zoom_link": null
        },
        {
            "number": "109",
            "title": "110 in which more advanced techniques are explored with a focus on interpretation and audition techniques",
            "description": "Students continue to develop necessary skills for successful music theater performance utilizing the widening body of music theatre repertoire.THR 310 —Vocal Performance IVA continuation of THR 109-110 in which more advanced techniques are explored with a focus on interpretation and audition techniques. Students continue to develop necessary skills for successful music theater performance utilizing the widening body of music theater repertoire.THR 311 —Jazz Dance IIIPrerequisite Take THR*230;This class is geared to the student with some formal experience in jazz dance training. This course engages the dynamic sensitivity of the body to be able to communicate through movement. Specific jazz styles and choreographic formats are studied using basic steps and challenging combinations. The area of dance choreography is introduced.THR 312 —Jazz Dance IVPrerequisite Take THR*231This class is geared to the student with extensive formal experience in jazz dance training. This course challenges the dynamic and sensitivity of the body to be able to communicate through movement. Specific jazz styles and choreographic formats are studied using complex steps and challenging combinations. The area of dance choreography is introduced,THR 320 —Stage Combat IIIPrerequisite Take THR*301The accomplished actor combatant will explore advanced techniques in certain martial styles, ranging from classical to contemporary. Emphasis will be placed on organic storytelling and the creation of collaborative performances. Safety is emphasized. Instructor permission required.THR 321 —Tap Dance IThis course is an introduction to the field of tap dancing, beginning with basic single, double, triple, and quadruple sounds, simple combinations, rhythmic patterning, and routines. The material is designed for the novice and the beginning level.THR 322 —Tap Dance IIPrerequisite Take THR*321This course is an exploration into the field of tap dancing, beginning with single, double, triple, and quadruple sounds, combinations, rhythmic patterning, and routines. The material is designed for the intermediate and advanced level.THR 323 —Physical Theatre I Development of practical physical theatre skills: juggling, mime techniques and illusions, and body awareness. Exploration of analysis of movement theories. Performance of pantomime, gesture language, and gestural cartooning.THR 324 —Physical Theatre II Practical study of mask play and visual character development using neutral, larval, expressive, and found masks, Simple mask making. Alternative puppetry. Examination of current trends in physical theatre.THR 326 —Music Theatre RepertoirePrerequisite Take THR*202 or THR*110A focus on music literacy and advanced study of performance techniques for the music theatre singer utilizing repertoire from the diverse styles of music theatre.THR 329 —PlaywritingAn introductory course in the problems and practices of playwriting. Emphasis is placed on the development and revision of a one-act play. Students also are acquainted with opportunities for production and publication.THR 331 —Costume DesignPrerequisite Take FAA*120 or THR*120Students learn the process of costume design for the theatre. Techniques covered include: script analysis, character conceptualization, research, and basic rendering. Art supplies required.THR 337 —Scene DesignPrerequisite Take FAA*120 or THR*120This course will introduce students to the basic skills required to be a scenic designer. The goal of the course is to expose, explore, and develop methods of visual communication within the design process of scenic design. This course will introduce students to script analysis, research, drafting, painting, collage, and model building. Drafting kit and art supplies required.THR 339 —Lighting DesignAn introductory study of the art of lighting for the stage from the initial concept through electricity, instruments, color, plots, and designing for various types of stages. Drafting kit required.THR 343 —Pattern DraftingPrerequisite THR*243This is a studio course in which the student will learn the fundamentals of pattern drafting through demonstrations and practical applications. Topics covered include: drafting a basic pattern set consisting of a bodice, skirt, and sleeve, manipulating darts, adding fullness, and learning how to fit the body.THR 344 —History of Decor FashionThis course is a study of clothing and the decorative arts . The historical periods from Prehistory to the Baroque and the societies within which they developed will be covered. The student will gain knowledge of the connections between the present and the past in Western culture. This is an upper division course, not necessarily appropriate for freshmen students.THR 345 —History of Decor IIThis course is a study of clothing and the decorative arts . The historical periods from the Baroques to the present, and the societies within which they developed will be covered. The student will gain knowledge of the connections between the present and the past in Western culture.THR 347 —Special Topics-CostumeIn this studio course students will examine in detail the fundamental construction and application techniques used to create a variety of costume specialties. Sample topics: corsets and petticoats, mask making, jewelry making, millinery, dancewear, and men's tailoring. This course may be taken up to three times with different course topics. Lab fee.THR 350 —Advanced Make-upPrerequisite Take THR 270 orFAA 270The design, creation, and use of prosthetics, wigs, facial hair, blood, and other special effects are used to create realistic and fantastical characters. Lab Fee.THR 362 —Dramatic Theory and CriticismA study of the history and development of dramatic theory and criticism from ancient times to the present. Students will analyze distinct conceptions of theatre across both time and geography through engagement with selected theorists.THR 400 —ShakespeareThis course examines in-depth representative plays of Shakespeare in each of the genres: tragedy, comedy, history, and romance, as well as the sonnets.THR 401 —Performance Techniques VIIPrerequisite Must have taken THR*301 and THR*302;An advanced course for the senior performance emphasis student comprising a range of separate skills classes including: Acting-Synthesis & The Profession, Ballet, and Physical Theatre IV. Lab fee.THR 402 —Performance Techniques VIIIPrerequisite Take THR*401An advanced course for the senior performance emphasis student comprising a range of separate skills classes including: Acting-Synthesis & The Profession, Advanced Jazz Dance, and Vocal Performance VI. Lab fee.THR 403 —Broadway Dance IPrerequisite Take THR*311This course is designed to develop the advanced jazz dancer through the study of complex dynamic styles and combinations. Emphasis is placed on techniques and the importance of rhythms, special awareness, and projection as means of creating variety in dance. Musical theatre history and repertory is introduced.THR 404 —Broadway Dance IIPrerequisite Take THR*312This course is designed to develop the advanced jazz dancer by a complex study of dynamics, styles, and combinations. Emphasis is placed on technique, the importance of rhythms, spatial awareness, and projection as means of fine-tuning dance. Musical theatre history and repertory is introduced.THR 407 —Honors Thesis IIndividual research of a substantive nature pursued in the student's major field of study. The research will conclude in a written thesis or an original project, and an oral defense.THR 408 —Honors Thesis IIIndividual research of a substantive nature pursued in the student's major field of study. The research will conclude in a written thesis or an original project, and an oral defense.THR 409 —Ballet VPrerequisite take thr*211This course will concentrate on barre exercises in progressive combinations including: balances on releve, complex locomotive patterns, turns, and jumps. Students will be required to create ballet phrases and demonstrate complex movement.THR 410 —Ballet VIPrerequisite take thr*212This course is designed for the advanced ballet student. Class will be taught at an accelerated pace. It will include advanced and complex combinations incorporating jumps with turns, beats, partnering techniques, and choreographic exploration.THR 411 —History and Literature of TheatreA study of the development of theatrical performance from the Greeks through Asian theatres to Shakespeare, with emphasis on reading and analyzing representative performance texts from each period.THR 412 —History and Literature of Theatre IIA study of the development of theatrical performance, from the Italian Renaissance through the rise of realism at the end of the 19th century, with an emphasis of understanding theatrical style through diverse performance texts.THR 413 —History and Literature of Theatre IIIA study of the development of theatrical performance from the 20th century to the present day, with emphasis on work in North America and Europe.THR 414 —American Theatre and Drama: From theThis course examines the development of American theatre, historically and dramatically, from Colonial times to the advent of Eugene O'Neill. The emphasis is on plays from the 18th, 19th, and early 20th century theatre.THR 415 —Cont Theaters of Global MajsPrerequisite TakeTHR 412This course explores theatres of the global majority since the 1940s. This term broadly encompasses Black, Asian, Latinx, indigenous, bi-racial, and others long considered minorities through a Western lens. Students will read plays and learn about their context to understand the variety of stylistic and social deployments of theatre.THR 417 —Acting-Synthesis & the ProfessionPrerequisite Must have taken THR*307 and THR*308;An advanced acting course emphasizing the synthesis of skills and techniques explored in the previous years of study. Special attention is placed on developing a range of audition material. Classes are devoted to the business aspects of the acting profession.THR 418 —Acting-Synthesis & the ProfessionPrerequisite Must have taken THR*307 and THR*308;An advanced acting course emphasizing the synthesis of skills and techniques explored in the previous years of study. Special attention is placed on developing a range of audition material. Classes are devoted to the business aspects of the acting profession.THR 423 —Physical Theatre III Prerequisite Take THR*324Practical study of physical character development and visual narrative using improvisation techniques, including contact improv, devised pieces, and articulating visual perceptions on paper. Classical Commedia dell 'Arte characters are explored, using masks, existing traditional scenarios, and modern commedia is introduced through performance of a new adaptation.THR 424 —Physical Theatre IV Prerequisite Take THR*423The class will apply the techniques of clowning and improvisation to the creation of physically based dramatic narratives. The process will include developing a personal clown, a family of clowns, and a clown play. Audition techniques from the visual perspective and the actor as creator will also be explored.THR 425 —DirectingA study of general directorial problems and solutions: auditions, blocking, pace, rhythm, characterization, composition, picturization, movement, and general design. The student also prepares a short play from the beginning to actual performance.THR 430 —Senior SeminarThe senior seminar is an integrative capstone course requiring general theatre students to conduct research on a question or problem in a specific area of theatre. It will be conducted as an independent research effort with each student meeting privately with his or her research adviser. Students will write a senior thesis applying their acquired skills to a central topic, theme, or question.THR 431 —Senior Seminar IIPrerequisite THR*430The Senior Seminar II is the continuation of an interactive capstone course, requiring specialized theatre students to conduct research on a question or problem in a specific area of concentration in theatre. It will be conducted as an independent research effort with each student meeting privately with his or her research advisor. Students will write a senior thesis applying their acquired skills to a central topic, theme or question and present the findings in a forum appropriate to the subject.THR 445 —Advanced Design StudioPrerequisite Must have taken THR*337 THR*339 and THR*331;This independent study serves as the capstone course restricted to seniors in the design/technology sequence. Students will apply the knowledge and skills acquired over the course of their program to further their individual goals. The topics will be determined by the instructors and will vary by student need.THR 493 —Theatre Internship/Co-opA junior or senior work-study program providing relevant employment experience. Registration will occur at the beginning of the experience. The objective of the program is to integrate classroom theory and practical work experience, thus lending relevancy to learning and providing the student with a realistic exposure to career opportunities. Students interested in taking an internship or co-op should talk to their adviser.THR 494 —Theatre Internship/Co-opA junior or senior work-study program providing relevant employment experience. Registration will occur at the beginning of the experience. The objective of the program is to integrate classroom theory and practical work experience, thus lending relevancy to learning and providing the student with a realistic exposure to career opportunities. Students interested in taking an internship or co-op should talk to their adviser.THR 495 —Theatre Internship/Co-opA junior or senior work-study program providing relevant employment experience. Registration will occur at the beginning of the experience. The objective of the program is to integrate classroom theory and practical work experience, thus lending relevancy to learning and providing the student with a realistic exposure to career opportunities. Students interested in taking an internship or co-op should talk to their adviser.THR 496 —Theatre Internship/Co-opA junior or senior work-study program providing relevant employment experience. Registration will occur at the beginning of the experience. The objective of the program is to integrate classroom theory and practical work experience, thus lending relevancy to learning and providing the student with a realistic exposure to career opportunities. Students interested in taking an internship or co-op should talk to their adviser.",
            "instructors": [],
            "textbooks": [],
            "zoom_link": null
        },
        {
            "number": "109",
            "title": "110 in which more advanced techniques are explored with a focus on interpretation and audition techniques",
            "description": "Students continue to develop necessary skills for successful music theater performance utilizing the widening body of music theatre repertoire.THR 310 —Vocal Performance IVA continuation of THR 109-110 in which more advanced techniques are explored with a focus on interpretation and audition techniques. Students continue to develop necessary skills for successful music theater performance utilizing the widening body of music theater repertoire.THR 311 —Jazz Dance IIIPrerequisite Take THR*230;This class is geared to the student with some formal experience in jazz dance training. This course engages the dynamic sensitivity of the body to be able to communicate through movement. Specific jazz styles and choreographic formats are studied using basic steps and challenging combinations. The area of dance choreography is introduced.THR 312 —Jazz Dance IVPrerequisite Take THR*231This class is geared to the student with extensive formal experience in jazz dance training. This course challenges the dynamic and sensitivity of the body to be able to communicate through movement. Specific jazz styles and choreographic formats are studied using complex steps and challenging combinations. The area of dance choreography is introduced,THR 320 —Stage Combat IIIPrerequisite Take THR*301The accomplished actor combatant will explore advanced techniques in certain martial styles, ranging from classical to contemporary. Emphasis will be placed on organic storytelling and the creation of collaborative performances. Safety is emphasized. Instructor permission required.THR 321 —Tap Dance IThis course is an introduction to the field of tap dancing, beginning with basic single, double, triple, and quadruple sounds, simple combinations, rhythmic patterning, and routines. The material is designed for the novice and the beginning level.THR 322 —Tap Dance IIPrerequisite Take THR*321This course is an exploration into the field of tap dancing, beginning with single, double, triple, and quadruple sounds, combinations, rhythmic patterning, and routines. The material is designed for the intermediate and advanced level.THR 323 —Physical Theatre I Development of practical physical theatre skills: juggling, mime techniques and illusions, and body awareness. Exploration of analysis of movement theories. Performance of pantomime, gesture language, and gestural cartooning.THR 324 —Physical Theatre II Practical study of mask play and visual character development using neutral, larval, expressive, and found masks, Simple mask making. Alternative puppetry. Examination of current trends in physical theatre.THR 326 —Music Theatre RepertoirePrerequisite Take THR*202 or THR*110A focus on music literacy and advanced study of performance techniques for the music theatre singer utilizing repertoire from the diverse styles of music theatre.THR 329 —PlaywritingAn introductory course in the problems and practices of playwriting. Emphasis is placed on the development and revision of a one-act play. Students also are acquainted with opportunities for production and publication.THR 331 —Costume DesignPrerequisite Take FAA*120 or THR*120Students learn the process of costume design for the theatre. Techniques covered include: script analysis, character conceptualization, research, and basic rendering. Art supplies required.THR 337 —Scene DesignPrerequisite Take FAA*120 or THR*120This course will introduce students to the basic skills required to be a scenic designer. The goal of the course is to expose, explore, and develop methods of visual communication within the design process of scenic design. This course will introduce students to script analysis, research, drafting, painting, collage, and model building. Drafting kit and art supplies required.THR 339 —Lighting DesignAn introductory study of the art of lighting for the stage from the initial concept through electricity, instruments, color, plots, and designing for various types of stages. Drafting kit required.THR 343 —Pattern DraftingPrerequisite THR*243This is a studio course in which the student will learn the fundamentals of pattern drafting through demonstrations and practical applications. Topics covered include: drafting a basic pattern set consisting of a bodice, skirt, and sleeve, manipulating darts, adding fullness, and learning how to fit the body.THR 344 —History of Decor FashionThis course is a study of clothing and the decorative arts . The historical periods from Prehistory to the Baroque and the societies within which they developed will be covered. The student will gain knowledge of the connections between the present and the past in Western culture. This is an upper division course, not necessarily appropriate for freshmen students.THR 345 —History of Decor IIThis course is a study of clothing and the decorative arts . The historical periods from the Baroques to the present, and the societies within which they developed will be covered. The student will gain knowledge of the connections between the present and the past in Western culture.THR 347 —Special Topics-CostumeIn this studio course students will examine in detail the fundamental construction and application techniques used to create a variety of costume specialties. Sample topics: corsets and petticoats, mask making, jewelry making, millinery, dancewear, and men's tailoring. This course may be taken up to three times with different course topics. Lab fee.THR 350 —Advanced Make-upPrerequisite Take THR 270 orFAA 270The design, creation, and use of prosthetics, wigs, facial hair, blood, and other special effects are used to create realistic and fantastical characters. Lab Fee.THR 362 —Dramatic Theory and CriticismA study of the history and development of dramatic theory and criticism from ancient times to the present. Students will analyze distinct conceptions of theatre across both time and geography through engagement with selected theorists.THR 400 —ShakespeareThis course examines in-depth representative plays of Shakespeare in each of the genres: tragedy, comedy, history, and romance, as well as the sonnets.THR 401 —Performance Techniques VIIPrerequisite Must have taken THR*301 and THR*302;An advanced course for the senior performance emphasis student comprising a range of separate skills classes including: Acting-Synthesis & The Profession, Ballet, and Physical Theatre IV. Lab fee.THR 402 —Performance Techniques VIIIPrerequisite Take THR*401An advanced course for the senior performance emphasis student comprising a range of separate skills classes including: Acting-Synthesis & The Profession, Advanced Jazz Dance, and Vocal Performance VI. Lab fee.THR 403 —Broadway Dance IPrerequisite Take THR*311This course is designed to develop the advanced jazz dancer through the study of complex dynamic styles and combinations. Emphasis is placed on techniques and the importance of rhythms, special awareness, and projection as means of creating variety in dance. Musical theatre history and repertory is introduced.THR 404 —Broadway Dance IIPrerequisite Take THR*312This course is designed to develop the advanced jazz dancer by a complex study of dynamics, styles, and combinations. Emphasis is placed on technique, the importance of rhythms, spatial awareness, and projection as means of fine-tuning dance. Musical theatre history and repertory is introduced.THR 407 —Honors Thesis IIndividual research of a substantive nature pursued in the student's major field of study. The research will conclude in a written thesis or an original project, and an oral defense.THR 408 —Honors Thesis IIIndividual research of a substantive nature pursued in the student's major field of study. The research will conclude in a written thesis or an original project, and an oral defense.THR 409 —Ballet VPrerequisite take thr*211This course will concentrate on barre exercises in progressive combinations including: balances on releve, complex locomotive patterns, turns, and jumps. Students will be required to create ballet phrases and demonstrate complex movement.THR 410 —Ballet VIPrerequisite take thr*212This course is designed for the advanced ballet student. Class will be taught at an accelerated pace. It will include advanced and complex combinations incorporating jumps with turns, beats, partnering techniques, and choreographic exploration.THR 411 —History and Literature of TheatreA study of the development of theatrical performance from the Greeks through Asian theatres to Shakespeare, with emphasis on reading and analyzing representative performance texts from each period.THR 412 —History and Literature of Theatre IIA study of the development of theatrical performance, from the Italian Renaissance through the rise of realism at the end of the 19th century, with an emphasis of understanding theatrical style through diverse performance texts.THR 413 —History and Literature of Theatre IIIA study of the development of theatrical performance from the 20th century to the present day, with emphasis on work in North America and Europe.THR 414 —American Theatre and Drama: From theThis course examines the development of American theatre, historically and dramatically, from Colonial times to the advent of Eugene O'Neill. The emphasis is on plays from the 18th, 19th, and early 20th century theatre.THR 415 —Cont Theaters of Global MajsPrerequisite TakeTHR 412This course explores theatres of the global majority since the 1940s. This term broadly encompasses Black, Asian, Latinx, indigenous, bi-racial, and others long considered minorities through a Western lens. Students will read plays and learn about their context to understand the variety of stylistic and social deployments of theatre.THR 417 —Acting-Synthesis & the ProfessionPrerequisite Must have taken THR*307 and THR*308;An advanced acting course emphasizing the synthesis of skills and techniques explored in the previous years of study. Special attention is placed on developing a range of audition material. Classes are devoted to the business aspects of the acting profession.THR 418 —Acting-Synthesis & the ProfessionPrerequisite Must have taken THR*307 and THR*308;An advanced acting course emphasizing the synthesis of skills and techniques explored in the previous years of study. Special attention is placed on developing a range of audition material. Classes are devoted to the business aspects of the acting profession.THR 423 —Physical Theatre III Prerequisite Take THR*324Practical study of physical character development and visual narrative using improvisation techniques, including contact improv, devised pieces, and articulating visual perceptions on paper. Classical Commedia dell 'Arte characters are explored, using masks, existing traditional scenarios, and modern commedia is introduced through performance of a new adaptation.THR 424 —Physical Theatre IV Prerequisite Take THR*423The class will apply the techniques of clowning and improvisation to the creation of physically based dramatic narratives. The process will include developing a personal clown, a family of clowns, and a clown play. Audition techniques from the visual perspective and the actor as creator will also be explored.THR 425 —DirectingA study of general directorial problems and solutions: auditions, blocking, pace, rhythm, characterization, composition, picturization, movement, and general design. The student also prepares a short play from the beginning to actual performance.THR 430 —Senior SeminarThe senior seminar is an integrative capstone course requiring general theatre students to conduct research on a question or problem in a specific area of theatre. It will be conducted as an independent research effort with each student meeting privately with his or her research adviser. Students will write a senior thesis applying their acquired skills to a central topic, theme, or question.THR 431 —Senior Seminar IIPrerequisite THR*430The Senior Seminar II is the continuation of an interactive capstone course, requiring specialized theatre students to conduct research on a question or problem in a specific area of concentration in theatre. It will be conducted as an independent research effort with each student meeting privately with his or her research advisor. Students will write a senior thesis applying their acquired skills to a central topic, theme or question and present the findings in a forum appropriate to the subject.THR 445 —Advanced Design StudioPrerequisite Must have taken THR*337 THR*339 and THR*331;This independent study serves as the capstone course restricted to seniors in the design/technology sequence. Students will apply the knowledge and skills acquired over the course of their program to further their individual goals. The topics will be determined by the instructors and will vary by student need.THR 493 —Theatre Internship/Co-opA junior or senior work-study program providing relevant employment experience. Registration will occur at the beginning of the experience. The objective of the program is to integrate classroom theory and practical work experience, thus lending relevancy to learning and providing the student with a realistic exposure to career opportunities. Students interested in taking an internship or co-op should talk to their adviser.THR 494 —Theatre Internship/Co-opA junior or senior work-study program providing relevant employment experience. Registration will occur at the beginning of the experience. The objective of the program is to integrate classroom theory and practical work experience, thus lending relevancy to learning and providing the student with a realistic exposure to career opportunities. Students interested in taking an internship or co-op should talk to their adviser.THR 495 —Theatre Internship/Co-opA junior or senior work-study program providing relevant employment experience. Registration will occur at the beginning of the experience. The objective of the program is to integrate classroom theory and practical work experience, thus lending relevancy to learning and providing the student with a realistic exposure to career opportunities. Students interested in taking an internship or co-op should talk to their adviser.THR 496 —Theatre Internship/Co-opA junior or senior work-study program providing relevant employment experience. Registration will occur at the beginning of the experience. The objective of the program is to integrate classroom theory and practical work experience, thus lending relevancy to learning and providing the student with a realistic exposure to career opportunities. Students interested in taking an internship or co-op should talk to their adviser.",
            "instructors": [],
            "textbooks": [],
            "zoom_link": null
        },
        {
            "number": "109",
            "title": "110 in which more advanced techniques are explored with a focus on interpretation and audition techniques",
            "description": "Students continue to develop necessary skills for successful music theater performance utilizing the widening body of music theatre repertoire.THR 310 —Vocal Performance IVA continuation of THR 109-110 in which more advanced techniques are explored with a focus on interpretation and audition techniques. Students continue to develop necessary skills for successful music theater performance utilizing the widening body of music theater repertoire.THR 311 —Jazz Dance IIIPrerequisite Take THR*230;This class is geared to the student with some formal experience in jazz dance training. This course engages the dynamic sensitivity of the body to be able to communicate through movement. Specific jazz styles and choreographic formats are studied using basic steps and challenging combinations. The area of dance choreography is introduced.THR 312 —Jazz Dance IVPrerequisite Take THR*231This class is geared to the student with extensive formal experience in jazz dance training. This course challenges the dynamic and sensitivity of the body to be able to communicate through movement. Specific jazz styles and choreographic formats are studied using complex steps and challenging combinations. The area of dance choreography is introduced,THR 320 —Stage Combat IIIPrerequisite Take THR*301The accomplished actor combatant will explore advanced techniques in certain martial styles, ranging from classical to contemporary. Emphasis will be placed on organic storytelling and the creation of collaborative performances. Safety is emphasized. Instructor permission required.THR 321 —Tap Dance IThis course is an introduction to the field of tap dancing, beginning with basic single, double, triple, and quadruple sounds, simple combinations, rhythmic patterning, and routines. The material is designed for the novice and the beginning level.THR 322 —Tap Dance IIPrerequisite Take THR*321This course is an exploration into the field of tap dancing, beginning with single, double, triple, and quadruple sounds, combinations, rhythmic patterning, and routines. The material is designed for the intermediate and advanced level.THR 323 —Physical Theatre I Development of practical physical theatre skills: juggling, mime techniques and illusions, and body awareness. Exploration of analysis of movement theories. Performance of pantomime, gesture language, and gestural cartooning.THR 324 —Physical Theatre II Practical study of mask play and visual character development using neutral, larval, expressive, and found masks, Simple mask making. Alternative puppetry. Examination of current trends in physical theatre.THR 326 —Music Theatre RepertoirePrerequisite Take THR*202 or THR*110A focus on music literacy and advanced study of performance techniques for the music theatre singer utilizing repertoire from the diverse styles of music theatre.THR 329 —PlaywritingAn introductory course in the problems and practices of playwriting. Emphasis is placed on the development and revision of a one-act play. Students also are acquainted with opportunities for production and publication.THR 331 —Costume DesignPrerequisite Take FAA*120 or THR*120Students learn the process of costume design for the theatre. Techniques covered include: script analysis, character conceptualization, research, and basic rendering. Art supplies required.THR 337 —Scene DesignPrerequisite Take FAA*120 or THR*120This course will introduce students to the basic skills required to be a scenic designer. The goal of the course is to expose, explore, and develop methods of visual communication within the design process of scenic design. This course will introduce students to script analysis, research, drafting, painting, collage, and model building. Drafting kit and art supplies required.THR 339 —Lighting DesignAn introductory study of the art of lighting for the stage from the initial concept through electricity, instruments, color, plots, and designing for various types of stages. Drafting kit required.THR 343 —Pattern DraftingPrerequisite THR*243This is a studio course in which the student will learn the fundamentals of pattern drafting through demonstrations and practical applications. Topics covered include: drafting a basic pattern set consisting of a bodice, skirt, and sleeve, manipulating darts, adding fullness, and learning how to fit the body.THR 344 —History of Decor FashionThis course is a study of clothing and the decorative arts . The historical periods from Prehistory to the Baroque and the societies within which they developed will be covered. The student will gain knowledge of the connections between the present and the past in Western culture. This is an upper division course, not necessarily appropriate for freshmen students.THR 345 —History of Decor IIThis course is a study of clothing and the decorative arts . The historical periods from the Baroques to the present, and the societies within which they developed will be covered. The student will gain knowledge of the connections between the present and the past in Western culture.THR 347 —Special Topics-CostumeIn this studio course students will examine in detail the fundamental construction and application techniques used to create a variety of costume specialties. Sample topics: corsets and petticoats, mask making, jewelry making, millinery, dancewear, and men's tailoring. This course may be taken up to three times with different course topics. Lab fee.THR 350 —Advanced Make-upPrerequisite Take THR 270 orFAA 270The design, creation, and use of prosthetics, wigs, facial hair, blood, and other special effects are used to create realistic and fantastical characters. Lab Fee.THR 362 —Dramatic Theory and CriticismA study of the history and development of dramatic theory and criticism from ancient times to the present. Students will analyze distinct conceptions of theatre across both time and geography through engagement with selected theorists.THR 400 —ShakespeareThis course examines in-depth representative plays of Shakespeare in each of the genres: tragedy, comedy, history, and romance, as well as the sonnets.THR 401 —Performance Techniques VIIPrerequisite Must have taken THR*301 and THR*302;An advanced course for the senior performance emphasis student comprising a range of separate skills classes including: Acting-Synthesis & The Profession, Ballet, and Physical Theatre IV. Lab fee.THR 402 —Performance Techniques VIIIPrerequisite Take THR*401An advanced course for the senior performance emphasis student comprising a range of separate skills classes including: Acting-Synthesis & The Profession, Advanced Jazz Dance, and Vocal Performance VI. Lab fee.THR 403 —Broadway Dance IPrerequisite Take THR*311This course is designed to develop the advanced jazz dancer through the study of complex dynamic styles and combinations. Emphasis is placed on techniques and the importance of rhythms, special awareness, and projection as means of creating variety in dance. Musical theatre history and repertory is introduced.THR 404 —Broadway Dance IIPrerequisite Take THR*312This course is designed to develop the advanced jazz dancer by a complex study of dynamics, styles, and combinations. Emphasis is placed on technique, the importance of rhythms, spatial awareness, and projection as means of fine-tuning dance. Musical theatre history and repertory is introduced.THR 407 —Honors Thesis IIndividual research of a substantive nature pursued in the student's major field of study. The research will conclude in a written thesis or an original project, and an oral defense.THR 408 —Honors Thesis IIIndividual research of a substantive nature pursued in the student's major field of study. The research will conclude in a written thesis or an original project, and an oral defense.THR 409 —Ballet VPrerequisite take thr*211This course will concentrate on barre exercises in progressive combinations including: balances on releve, complex locomotive patterns, turns, and jumps. Students will be required to create ballet phrases and demonstrate complex movement.THR 410 —Ballet VIPrerequisite take thr*212This course is designed for the advanced ballet student. Class will be taught at an accelerated pace. It will include advanced and complex combinations incorporating jumps with turns, beats, partnering techniques, and choreographic exploration.THR 411 —History and Literature of TheatreA study of the development of theatrical performance from the Greeks through Asian theatres to Shakespeare, with emphasis on reading and analyzing representative performance texts from each period.THR 412 —History and Literature of Theatre IIA study of the development of theatrical performance, from the Italian Renaissance through the rise of realism at the end of the 19th century, with an emphasis of understanding theatrical style through diverse performance texts.THR 413 —History and Literature of Theatre IIIA study of the development of theatrical performance from the 20th century to the present day, with emphasis on work in North America and Europe.THR 414 —American Theatre and Drama: From theThis course examines the development of American theatre, historically and dramatically, from Colonial times to the advent of Eugene O'Neill. The emphasis is on plays from the 18th, 19th, and early 20th century theatre.THR 415 —Cont Theaters of Global MajsPrerequisite TakeTHR 412This course explores theatres of the global majority since the 1940s. This term broadly encompasses Black, Asian, Latinx, indigenous, bi-racial, and others long considered minorities through a Western lens. Students will read plays and learn about their context to understand the variety of stylistic and social deployments of theatre.THR 417 —Acting-Synthesis & the ProfessionPrerequisite Must have taken THR*307 and THR*308;An advanced acting course emphasizing the synthesis of skills and techniques explored in the previous years of study. Special attention is placed on developing a range of audition material. Classes are devoted to the business aspects of the acting profession.THR 418 —Acting-Synthesis & the ProfessionPrerequisite Must have taken THR*307 and THR*308;An advanced acting course emphasizing the synthesis of skills and techniques explored in the previous years of study. Special attention is placed on developing a range of audition material. Classes are devoted to the business aspects of the acting profession.THR 423 —Physical Theatre III Prerequisite Take THR*324Practical study of physical character development and visual narrative using improvisation techniques, including contact improv, devised pieces, and articulating visual perceptions on paper. Classical Commedia dell 'Arte characters are explored, using masks, existing traditional scenarios, and modern commedia is introduced through performance of a new adaptation.THR 424 —Physical Theatre IV Prerequisite Take THR*423The class will apply the techniques of clowning and improvisation to the creation of physically based dramatic narratives. The process will include developing a personal clown, a family of clowns, and a clown play. Audition techniques from the visual perspective and the actor as creator will also be explored.THR 425 —DirectingA study of general directorial problems and solutions: auditions, blocking, pace, rhythm, characterization, composition, picturization, movement, and general design. The student also prepares a short play from the beginning to actual performance.THR 430 —Senior SeminarThe senior seminar is an integrative capstone course requiring general theatre students to conduct research on a question or problem in a specific area of theatre. It will be conducted as an independent research effort with each student meeting privately with his or her research adviser. Students will write a senior thesis applying their acquired skills to a central topic, theme, or question.THR 431 —Senior Seminar IIPrerequisite THR*430The Senior Seminar II is the continuation of an interactive capstone course, requiring specialized theatre students to conduct research on a question or problem in a specific area of concentration in theatre. It will be conducted as an independent research effort with each student meeting privately with his or her research advisor. Students will write a senior thesis applying their acquired skills to a central topic, theme or question and present the findings in a forum appropriate to the subject.THR 445 —Advanced Design StudioPrerequisite Must have taken THR*337 THR*339 and THR*331;This independent study serves as the capstone course restricted to seniors in the design/technology sequence. Students will apply the knowledge and skills acquired over the course of their program to further their individual goals. The topics will be determined by the instructors and will vary by student need.THR 493 —Theatre Internship/Co-opA junior or senior work-study program providing relevant employment experience. Registration will occur at the beginning of the experience. The objective of the program is to integrate classroom theory and practical work experience, thus lending relevancy to learning and providing the student with a realistic exposure to career opportunities. Students interested in taking an internship or co-op should talk to their adviser.THR 494 —Theatre Internship/Co-opA junior or senior work-study program providing relevant employment experience. Registration will occur at the beginning of the experience. The objective of the program is to integrate classroom theory and practical work experience, thus lending relevancy to learning and providing the student with a realistic exposure to career opportunities. Students interested in taking an internship or co-op should talk to their adviser.THR 495 —Theatre Internship/Co-opA junior or senior work-study program providing relevant employment experience. Registration will occur at the beginning of the experience. The objective of the program is to integrate classroom theory and practical work experience, thus lending relevancy to learning and providing the student with a realistic exposure to career opportunities. Students interested in taking an internship or co-op should talk to their adviser.THR 496 —Theatre Internship/Co-opA junior or senior work-study program providing relevant employment experience. Registration will occur at the beginning of the experience. The objective of the program is to integrate classroom theory and practical work experience, thus lending relevancy to learning and providing the student with a realistic exposure to career opportunities. Students interested in taking an internship or co-op should talk to their adviser.",
            "instructors": [],
            "textbooks": [],
            "zoom_link": null
        },
        {
            "number": "109",
            "title": "110 in which more advanced techniques are explored with a focus on interpretation and audition techniques",
            "description": "Students continue to develop necessary skills for successful music theater performance utilizing the widening body of music theatre repertoire.THR 310 —Vocal Performance IVA continuation of THR 109-110 in which more advanced techniques are explored with a focus on interpretation and audition techniques. Students continue to develop necessary skills for successful music theater performance utilizing the widening body of music theater repertoire.THR 311 —Jazz Dance IIIPrerequisite Take THR*230;This class is geared to the student with some formal experience in jazz dance training. This course engages the dynamic sensitivity of the body to be able to communicate through movement. Specific jazz styles and choreographic formats are studied using basic steps and challenging combinations. The area of dance choreography is introduced.THR 312 —Jazz Dance IVPrerequisite Take THR*231This class is geared to the student with extensive formal experience in jazz dance training. This course challenges the dynamic and sensitivity of the body to be able to communicate through movement. Specific jazz styles and choreographic formats are studied using complex steps and challenging combinations. The area of dance choreography is introduced,THR 320 —Stage Combat IIIPrerequisite Take THR*301The accomplished actor combatant will explore advanced techniques in certain martial styles, ranging from classical to contemporary. Emphasis will be placed on organic storytelling and the creation of collaborative performances. Safety is emphasized. Instructor permission required.THR 321 —Tap Dance IThis course is an introduction to the field of tap dancing, beginning with basic single, double, triple, and quadruple sounds, simple combinations, rhythmic patterning, and routines. The material is designed for the novice and the beginning level.THR 322 —Tap Dance IIPrerequisite Take THR*321This course is an exploration into the field of tap dancing, beginning with single, double, triple, and quadruple sounds, combinations, rhythmic patterning, and routines. The material is designed for the intermediate and advanced level.THR 323 —Physical Theatre I Development of practical physical theatre skills: juggling, mime techniques and illusions, and body awareness. Exploration of analysis of movement theories. Performance of pantomime, gesture language, and gestural cartooning.THR 324 —Physical Theatre II Practical study of mask play and visual character development using neutral, larval, expressive, and found masks, Simple mask making. Alternative puppetry. Examination of current trends in physical theatre.THR 326 —Music Theatre RepertoirePrerequisite Take THR*202 or THR*110A focus on music literacy and advanced study of performance techniques for the music theatre singer utilizing repertoire from the diverse styles of music theatre.THR 329 —PlaywritingAn introductory course in the problems and practices of playwriting. Emphasis is placed on the development and revision of a one-act play. Students also are acquainted with opportunities for production and publication.THR 331 —Costume DesignPrerequisite Take FAA*120 or THR*120Students learn the process of costume design for the theatre. Techniques covered include: script analysis, character conceptualization, research, and basic rendering. Art supplies required.THR 337 —Scene DesignPrerequisite Take FAA*120 or THR*120This course will introduce students to the basic skills required to be a scenic designer. The goal of the course is to expose, explore, and develop methods of visual communication within the design process of scenic design. This course will introduce students to script analysis, research, drafting, painting, collage, and model building. Drafting kit and art supplies required.THR 339 —Lighting DesignAn introductory study of the art of lighting for the stage from the initial concept through electricity, instruments, color, plots, and designing for various types of stages. Drafting kit required.THR 343 —Pattern DraftingPrerequisite THR*243This is a studio course in which the student will learn the fundamentals of pattern drafting through demonstrations and practical applications. Topics covered include: drafting a basic pattern set consisting of a bodice, skirt, and sleeve, manipulating darts, adding fullness, and learning how to fit the body.THR 344 —History of Decor FashionThis course is a study of clothing and the decorative arts . The historical periods from Prehistory to the Baroque and the societies within which they developed will be covered. The student will gain knowledge of the connections between the present and the past in Western culture. This is an upper division course, not necessarily appropriate for freshmen students.THR 345 —History of Decor IIThis course is a study of clothing and the decorative arts . The historical periods from the Baroques to the present, and the societies within which they developed will be covered. The student will gain knowledge of the connections between the present and the past in Western culture.THR 347 —Special Topics-CostumeIn this studio course students will examine in detail the fundamental construction and application techniques used to create a variety of costume specialties. Sample topics: corsets and petticoats, mask making, jewelry making, millinery, dancewear, and men's tailoring. This course may be taken up to three times with different course topics. Lab fee.THR 350 —Advanced Make-upPrerequisite Take THR 270 orFAA 270The design, creation, and use of prosthetics, wigs, facial hair, blood, and other special effects are used to create realistic and fantastical characters. Lab Fee.THR 362 —Dramatic Theory and CriticismA study of the history and development of dramatic theory and criticism from ancient times to the present. Students will analyze distinct conceptions of theatre across both time and geography through engagement with selected theorists.THR 400 —ShakespeareThis course examines in-depth representative plays of Shakespeare in each of the genres: tragedy, comedy, history, and romance, as well as the sonnets.THR 401 —Performance Techniques VIIPrerequisite Must have taken THR*301 and THR*302;An advanced course for the senior performance emphasis student comprising a range of separate skills classes including: Acting-Synthesis & The Profession, Ballet, and Physical Theatre IV. Lab fee.THR 402 —Performance Techniques VIIIPrerequisite Take THR*401An advanced course for the senior performance emphasis student comprising a range of separate skills classes including: Acting-Synthesis & The Profession, Advanced Jazz Dance, and Vocal Performance VI. Lab fee.THR 403 —Broadway Dance IPrerequisite Take THR*311This course is designed to develop the advanced jazz dancer through the study of complex dynamic styles and combinations. Emphasis is placed on techniques and the importance of rhythms, special awareness, and projection as means of creating variety in dance. Musical theatre history and repertory is introduced.THR 404 —Broadway Dance IIPrerequisite Take THR*312This course is designed to develop the advanced jazz dancer by a complex study of dynamics, styles, and combinations. Emphasis is placed on technique, the importance of rhythms, spatial awareness, and projection as means of fine-tuning dance. Musical theatre history and repertory is introduced.THR 407 —Honors Thesis IIndividual research of a substantive nature pursued in the student's major field of study. The research will conclude in a written thesis or an original project, and an oral defense.THR 408 —Honors Thesis IIIndividual research of a substantive nature pursued in the student's major field of study. The research will conclude in a written thesis or an original project, and an oral defense.THR 409 —Ballet VPrerequisite take thr*211This course will concentrate on barre exercises in progressive combinations including: balances on releve, complex locomotive patterns, turns, and jumps. Students will be required to create ballet phrases and demonstrate complex movement.THR 410 —Ballet VIPrerequisite take thr*212This course is designed for the advanced ballet student. Class will be taught at an accelerated pace. It will include advanced and complex combinations incorporating jumps with turns, beats, partnering techniques, and choreographic exploration.THR 411 —History and Literature of TheatreA study of the development of theatrical performance from the Greeks through Asian theatres to Shakespeare, with emphasis on reading and analyzing representative performance texts from each period.THR 412 —History and Literature of Theatre IIA study of the development of theatrical performance, from the Italian Renaissance through the rise of realism at the end of the 19th century, with an emphasis of understanding theatrical style through diverse performance texts.THR 413 —History and Literature of Theatre IIIA study of the development of theatrical performance from the 20th century to the present day, with emphasis on work in North America and Europe.THR 414 —American Theatre and Drama: From theThis course examines the development of American theatre, historically and dramatically, from Colonial times to the advent of Eugene O'Neill. The emphasis is on plays from the 18th, 19th, and early 20th century theatre.THR 415 —Cont Theaters of Global MajsPrerequisite TakeTHR 412This course explores theatres of the global majority since the 1940s. This term broadly encompasses Black, Asian, Latinx, indigenous, bi-racial, and others long considered minorities through a Western lens. Students will read plays and learn about their context to understand the variety of stylistic and social deployments of theatre.THR 417 —Acting-Synthesis & the ProfessionPrerequisite Must have taken THR*307 and THR*308;An advanced acting course emphasizing the synthesis of skills and techniques explored in the previous years of study. Special attention is placed on developing a range of audition material. Classes are devoted to the business aspects of the acting profession.THR 418 —Acting-Synthesis & the ProfessionPrerequisite Must have taken THR*307 and THR*308;An advanced acting course emphasizing the synthesis of skills and techniques explored in the previous years of study. Special attention is placed on developing a range of audition material. Classes are devoted to the business aspects of the acting profession.THR 423 —Physical Theatre III Prerequisite Take THR*324Practical study of physical character development and visual narrative using improvisation techniques, including contact improv, devised pieces, and articulating visual perceptions on paper. Classical Commedia dell 'Arte characters are explored, using masks, existing traditional scenarios, and modern commedia is introduced through performance of a new adaptation.THR 424 —Physical Theatre IV Prerequisite Take THR*423The class will apply the techniques of clowning and improvisation to the creation of physically based dramatic narratives. The process will include developing a personal clown, a family of clowns, and a clown play. Audition techniques from the visual perspective and the actor as creator will also be explored.THR 425 —DirectingA study of general directorial problems and solutions: auditions, blocking, pace, rhythm, characterization, composition, picturization, movement, and general design. The student also prepares a short play from the beginning to actual performance.THR 430 —Senior SeminarThe senior seminar is an integrative capstone course requiring general theatre students to conduct research on a question or problem in a specific area of theatre. It will be conducted as an independent research effort with each student meeting privately with his or her research adviser. Students will write a senior thesis applying their acquired skills to a central topic, theme, or question.THR 431 —Senior Seminar IIPrerequisite THR*430The Senior Seminar II is the continuation of an interactive capstone course, requiring specialized theatre students to conduct research on a question or problem in a specific area of concentration in theatre. It will be conducted as an independent research effort with each student meeting privately with his or her research advisor. Students will write a senior thesis applying their acquired skills to a central topic, theme or question and present the findings in a forum appropriate to the subject.THR 445 —Advanced Design StudioPrerequisite Must have taken THR*337 THR*339 and THR*331;This independent study serves as the capstone course restricted to seniors in the design/technology sequence. Students will apply the knowledge and skills acquired over the course of their program to further their individual goals. The topics will be determined by the instructors and will vary by student need.THR 493 —Theatre Internship/Co-opA junior or senior work-study program providing relevant employment experience. Registration will occur at the beginning of the experience. The objective of the program is to integrate classroom theory and practical work experience, thus lending relevancy to learning and providing the student with a realistic exposure to career opportunities. Students interested in taking an internship or co-op should talk to their adviser.THR 494 —Theatre Internship/Co-opA junior or senior work-study program providing relevant employment experience. Registration will occur at the beginning of the experience. The objective of the program is to integrate classroom theory and practical work experience, thus lending relevancy to learning and providing the student with a realistic exposure to career opportunities. Students interested in taking an internship or co-op should talk to their adviser.THR 495 —Theatre Internship/Co-opA junior or senior work-study program providing relevant employment experience. Registration will occur at the beginning of the experience. The objective of the program is to integrate classroom theory and practical work experience, thus lending relevancy to learning and providing the student with a realistic exposure to career opportunities. Students interested in taking an internship or co-op should talk to their adviser.THR 496 —Theatre Internship/Co-opA junior or senior work-study program providing relevant employment experience. Registration will occur at the beginning of the experience. The objective of the program is to integrate classroom theory and practical work experience, thus lending relevancy to learning and providing the student with a realistic exposure to career opportunities. Students interested in taking an internship or co-op should talk to their adviser.",
            "instructors": [],
            "textbooks": [],
            "zoom_link": null
        },
        {
            "number": "101",
            "title": "— Performance Techniques I",
            "description": "A course for the performance and general emphasis student comprising a range of separate skills classes, including: Acting-Foundations, Dance and Movement, and Vocal Performance I. Lab fee.",
            "instructors": [],
            "textbooks": [],
            "zoom_link": null
        },
        {
            "number": "102",
            "title": "— Performance Techniques II",
            "description": "Prerequisite Must have taken THR*101; A course for the performance and general emphasis student comprising a range of separate skills classes, including: Acting-Foundations, Introduction to Ballet, Physical Theatre I, and Speech I. Lab fee.",
            "instructors": [],
            "textbooks": [],
            "zoom_link": null
        },
        {
            "number": "103",
            "title": "— Introduction to Theatre",
            "description": "An introduction to the collaborative nature, origin, and general history of the theatre, as well as an examination of the contributions of the producer, director, actor, and design team to the theatrical event. Also presented is an overview of the dominant dramatic forms.",
            "instructors": [],
            "textbooks": [],
            "zoom_link": null
        },
        {
            "number": "104",
            "title": "— Stagecraft",
            "description": "This course is an introduction to the craft of sets, lighting, and costumes for the theatre. It examines the organization of a theatre from the production end and introduces the student to the basic tools, materials, techniques, and procedures used in technical theatre.",
            "instructors": [],
            "textbooks": [],
            "zoom_link": null
        },
        {
            "number": "105",
            "title": "— Theory & Musicianship I",
            "description": "A study of elementary theory and sight singing to aid music reading and rhythm. This course focuses on beginning music theory and sight singing.",
            "instructors": [],
            "textbooks": [],
            "zoom_link": null
        },
        {
            "number": "106",
            "title": "— Theory & Musicianship II",
            "description": "A study of advanced music theory, keyboarding, and sight singing to aid music reading and rhythm. This course focuses on music theory, keyboarding, and sight singing skills for the student who already possesses a background in music literacy.",
            "instructors": [],
            "textbooks": [],
            "zoom_link": null
        },
        {
            "number": "107",
            "title": "— Acting-Foundations",
            "description": "This is an introductory course in the basic vocabulary and theory of acting. This course is designed to begin the acting sequence for theatre or non-theatre majors.",
            "instructors": [],
            "textbooks": [],
            "zoom_link": null
        },
        {
            "number": "108",
            "title": "— Acting- Foundations II",
            "description": "Prerequisite Take THR*107 This course, a continuation of THR 107, is an introductory course in basic methods and approaches to acting, monologue, and scene work are included as well as the analysis of dramatic text.",
            "instructors": [],
            "textbooks": [],
            "zoom_link": null
        },
        {
            "number": "109",
            "title": "— Vocal Performance I & II",
            "description": "Prerequisite Must have taken THR 101, THR 105, or THR 106 A study of elementary theory to aid music reading and rhythm. Basic singing techniques, including breath control, diction, projection, and phrasing are taught, as well as the basic techniques for musical theatre singing.",
            "instructors": [],
            "textbooks": [],
            "zoom_link": null
        },
        {
            "number": "110",
            "title": "— Vocal Performance I & II",
            "description": "A study of elementary theory to aid music reading and rhythm. Basic singing techniques, including breath control, diction, projection, and phrasing are taught, as well as the basic techniques for musical theatre singing.",
            "instructors": [],
            "textbooks": [],
            "zoom_link": null
        }
    ]
}