{
  "3+1 Accounting Program": {
    "url": "https://www.niagara.edu/programs/3-1-accounting-program/",
    "overview": "Get a head start on your accounting career by applying for the Distinguished Accounting Scholar Accelerated Degree 3+1 Accounting Program sponsored by Deloitte.\n\nStudents obtain both their Bachelor of Business Administration and their Master of Business Administration degrees in four years rather than the usual five. This program is geared toward incoming students who have completed college-level courses during their high school careers."
  },
  "Accounting": {
    "url": "https://www.niagara.edu/programs/accounting/",
    "overview": "Our Accounting program offers you a comprehensive and adaptable education designed for aspiring accountants and financial professionals. Whether you envision a career in a big accounting firm, a small practice, or even starting your own business, this curriculum ensures you’ll be equipped to handle the complexities of the financial world after graduation as you pursue your specific career aspirations.\n\nAs a student at NU, you’ll learn about the accounting process in small interactive classes as you work one-on-one with our faculty, a distinctive group of internationally recognized instructors and seasoned professionals. You’ll also have opportunities to minor in fraud examination and/or data analytics, prepare for the CPA exam, or apply to become an Accelerated Scholars to earn your graduate degree on a much quicker timeline."
  },
  "Actuarial Science": {
    "url": "https://www.niagara.edu/programs/actuarial-science/",
    "overview": "As a student of actuarial science, you’ll blend theory from math, business, finance, and economics into practice in this interdisciplinary major. Our students learn about the commonalities and science between math and business with individual instruction in small classes.\n\nYour coursework will combine mathematics, general business, finance, and computer science to help you pass the first two actuarial exams while developing marketable skills for your post-graduate career."
  },
  "Adolescence Education (Grades 7-12)": {
    "url": "https://www.niagara.edu/programs/adolescence-education-grades-7-12/",
    "overview": "Our Adolescence Education program is recommended for people who have a passion teaching a specific subject to middle and high school students in grades 7-12. As a student in our College of Education, you’ll be encouraged to explore concepts, issues, and problems from multiple perspectives with reflection, collaboration, and analysis of diverse evidence. Through this foundation, you’ll systematically build your knowledge and skill through coursework and field experiences, beginning in your first semester at Niagara.\n\nOnce you successfully complete our program and pass New York state testing requirements, you’ll qualify for initial teacher certification in New York for middle childhood and adolescence education in your specific subject, including Biology, Chemistry, English, Mathematics, Spanish, French, and Social Studies."
  },
  "Advanced Certificate in Applied Behavior Analysis Online": {
    "url": "https://www.niagara.edu/programs/applied-behavior-analysis-online/",
    "overview": "Applied Behavior Analysis Online program (ABA) allows students to obtain education and certification needed to effectively meet diverse behavioral needs. ABA is a scientific field of study that relies on the principles of learning to deliver meaningful behavior change. Applied behavior analysis skills are especially important in schools or when working with persons on the autism spectrum.\n\nCandidates are prepared for careers as applied behavior analysts in accordance with the educational requirements set forth for professional practice as a licensed behavior analyst in the state of New York.\n\nOur online ABA program provides comprehensive coverage of concepts and principles of behavior analysis, single-subject research methods and designs, functional behavior analysis and other behavior assessment techniques, as well as professional and ethical issues in behavior analysis.\n\nCandidates will further develop professional skills by completing a minimum of 250 hours of supervised experience in applied behavior analysis. Our program prepares candidates to:\n\nStudents will be prepared to secure a Limited Permit to complete professional experience requirements towards as an LBA and further pursue licensure. Our program is also aligned with the content areas set forth for the BCBA examination"
  },
  "Advanced Certificate in Literacy Instruction All Grades (B-12) Online": {
    "url": "https://www.niagara.edu/programs/literacy-instruction/",
    "overview": "Our Master’s in Literacy Education program offers you a comprehensive experience designed to enhance your understanding and practice of literacy assessment and instruction. Our accredited program will develop and enhance your skill set to become a highly-qualified literacy educator knowledgeable with assessment, instruction, and leadership, while preparing you for Literacy Specialist All Grades certification.\n\nAs our program focuses on developmental reading, you’ll explore the process and effective instructional strategies across all grade levels, honing your ability to diagnose and address reading difficulties. You’ll gain professional skills and knowledge in both childhood and adolescent literacy development through in-depth coursework and real-world professional experiences."
  },
  "Advanced Certificate in School Counseling": {
    "url": "https://www.niagara.edu/programs/school-counseling/",
    "overview": "Our Master’s in School Counseling will prepare you to have a positive and sustained impact for students, families, schools, and communities, especially those who have been historically marginalized. Our aim is to develop you into a skilled, ethical school counselor who advocates for positive change by learning, leading, and serving your students and communities.\n\nAs you approach graduation at Niagara, you’ll be able to facilitate the academic, career, personal, and social development and achievement in all pre-K to grade 12 students."
  },
  "Advanced Certificate in School District Business Leadership Online": {
    "url": "https://www.niagara.edu/programs/educational-leadership/",
    "overview": "Our M.S.Ed/Advanced Certificate program is a CAEP-accredited graduate program designed to prepare you for larger leadership roles in education. Our specialized curriculum focuses on leadership development to ensure you’ll graduate with the knowledge, skills, and confidence needed to lead educational communities and nonprofit organizations.\n\nThese programs are carefully designed to align with the National Educational Leadership Standards and provide considerable flexibility for you to modify your pathway after initial enrollment. We accept a limited amount of graduate credits from other nationally accredited colleges and universities. Candidates who complete a CAS-SBL or SAS-SDL program can utilize the credit earned in your first CAS toward the CAS by taking five additional courses, two of which are internship courses."
  },
  "Advanced Certificate in Teaching English to Speakers of Other Languages (TESOL) Online": {
    "url": "https://www.niagara.edu/programs/master-of-science-in-teaching-english-to-speakers-of-other-languages/",
    "overview": "Master of Science in Teaching English to Speakers of Other Languages Online program provides you with the knowledge and skills you need to effectively teach English language learners while preparing to meet state certification requirements.\n\nOur curriculum is designed to meet the growing demand for teachers who work with English language learners, focusing on the theories, strategies, and methods for teaching this specialized population. You’ll gain an awareness and understanding of the sociocultural and sociolinguistic issues that impact the acquisition of English as an additional language, as well as advance your abilities for effective communication. Our graduates are highly motivated to advance in a field that allows them to help others across borders and cultures, and indeed, you’ll have opportunities to travel abroad as you study TESOL at Niagara."
  },
  "Africana/Black Studies (Minor)": {
    "url": "https://www.niagara.edu/programs/africana-black-studies/",
    "overview": "The Africana / Black studies minor focuses on the diaspora of African-descended people and cultures.\n\nThe sequencing of courses includes areas of study on the History of Africa, The African-American (USA and Canada) experience, both historically and in contemporary times, Afro-Caribbean, Afro-Hispanic, and other cultures and descents of African peoples. The program offerings range across traditional fields of sociology, criminology, history, literature, political sciences, law, communications, and education.\n\nOverall, the Africana/Black studies minor seeks to provide Niagara University studies with a multidisciplinary and comparative framework through which to explore African diaspora.\n\nGenerally, the minor is designed to introduce students to the history, culture and society, and political and economic conditions of Black people in Africa, the Americas, and elsewhere in the world; and to explore new approaches –  perspectives, analyses and interdisciplinary techniques– appropriate to the study of the Black experience."
  },
  "American Sign Language and Deaf Studies (Minor)": {
    "url": "https://www.niagara.edu/programs/american-sign-language-and-deaf-studies/",
    "overview": "The American Sign Language and Deaf Studies program is the largest minor on campus. The minor allows students the ability to earn a “degree with a difference.” Interested students are encouraged to start the courses early in their studies at Niagara University due to the progressive sequencing of the courses. We realize that many students like to explore courses before deciding. You are welcome to sit in on a class or two, come to our events, and/or meet with our professors individually.\n\nThe ASL/DS program offers small class sizes to enhance the individualized learning experience. Our faculty come from diverse backgrounds and are able to provide our students with a wide range of perspectives in the field of ASL/DS. Classes range from beginner ASL to conversational ASL with the possibility of having an internship after completion of the minor.\n\nCurriculum"
  },
  "Art History with Museum Studies": {
    "url": "https://www.niagara.edu/programs/art-history/",
    "overview": "Our Art History with Museum Studies program blends theory with practice through the scholarly study of art, culture, and museums while directly engaging in professional work through our on-campus art museum. It’s a unique opportunity to set yourself apart from students studying in other undergraduate programs.\n\nAs a Niagara University student, you’ll have direct access to our Castellani Art Museum through your academic studies. The CAM will also help you gain professional experience in curatorship, education, collections management, development, and museum administration. Upon graduation, you’ll have pursued an in-depth academic study of art history while earning hands-on experience in museum operations and art exhibitions."
  },
  "ASDBS Nursing": {
    "url": "https://www.niagara.edu/programs/asdbs-nursing/",
    "overview": "Completion Time: 12 Months\nCredits: 57 credits\nClinical Hours: 675\n\nOur Accelerated Second Degree Bachelor of Science (ASDBS) degree in Nursing compliments your bachelor’s degree to prepare you for a career in healthcare, with a focus on the science and fundamentals of nursing practice. Through classroom, lab, clinical, and simulated training, you’ll be equipped with the skills needed to provide sound clinical judgment while delivering comprehensive care to patients as entry-level clinicians.\n\nDesigned for students with a bachelor’s degree but lacking a license as a registered professional nurse, our ASDBS program will teach you how to enhance your personal resilience and wellness while focusing on service to others and the key components of effective health care delivery, including the comprehensive care of individuals and groups across their lifespan."
  },
  "Biology and Biotechnology": {
    "url": "https://www.niagara.edu/programs/biology-and-biotechnology/",
    "overview": "Our Biology program provides pre-professional education and training for students of health sciences. As a student at Niagara University, you’ll gain access to state-of-the-art labs, conduct research alongside faculty while receiving personal guidance, and gain working experience through internships and volunteer opportunities.\n\nWe will guide you with an integrated and contemporary knowledge of biology, preparing you to pursue careers in research and industry, or continue your studies with advanced education. Qualified pre-professional students seeking entry to medical school can apply for the University at Buffalo Medical School’s Early Assurance Program. NU also has coordinated programs with the Lake Erie College of Osteopathic Medicine, University at Buffalo Dental School, and the School of Pharmacy for 3+4 programs."
  },
  "Chemistry and Biochemistry": {
    "url": "https://www.niagara.edu/programs/chemistry-and-biochemistry/",
    "overview": "The B.S. in Chemistry major is certified by the American Chemical Society (ACS) to provide foundational training in all areas of chemistry. Many B.S. chemistry students continue into research-oriented careers and/or further graduate studies in chemistry, forensics, materials science, environmental science, or medicine.\n\nThe B.S. in Biochemistry major emphasizes additional study in biology and the chemistry of biological organisms. This major is particularly popular among pre-health students pursuing careers in medicine, dentistry, pharmacy, and allied fields.\n\nThe B.A. in Chemistry major offers a high level of flexibility in the choice of upper-level courses. This major is popular with students who wish to apply their interest in chemistry to careers in business, law, or public policy. Students may choose courses to fulfill a 4+1 B.A. in chemistry/M.B.A in business. Additionally, through the NU College of Education, our department supports programs that provide specialized chemistry training for educators teaching students across various age levels."
  },
  "Childhood and Middle Childhood Education": {
    "url": "https://www.niagara.edu/programs/childhood-and-middle-childhood-education/",
    "overview": "Our Childhood and Middle Childhood Education program is recommended for people who have a passion teaching a specific subject to students in grades 1-9. As a student in our College of Education, you’ll be encouraged to explore concepts, issues, and problems from multiple perspectives with reflection, collaboration, and analysis of diverse evidence. Through this foundation, you’ll systematically build your knowledge and skill through coursework and field experiences, beginning in your first semester at Niagara.\n\nOnce you successfully complete our program and pass New York state testing requirements, you’ll qualify for initial teacher certification in New York for childhood and middle childhood education (grades 1-9) in your specific subject, including Biology, Chemistry, English, Mathematics, Spanish, French, and Social Studies."
  },
  "Clinical Mental Health Counseling": {
    "url": "https://www.niagara.edu/programs/clinical-mental-health-counseling/",
    "overview": "As the field of mental health counseling expands, so does the need for qualified counselors. Our CACREP-accredited Master of Science in Clinical Health Health Counseling program prepares you for New York State Licensed Mental Health Counselor (LMHC) eligibility, while ensuring a general mastery of counseling service skills.\n\nYou’ll be trained in the application of psychotherapy principles, human development, and learning theory, as well as the etiology of mental illness and dysfunctional behavior to individuals, couples, families and groups. Upon graduation, you’ll become well-equipped to treat psychopathology and promote optimal mental health."
  },
  "Clinical Mental Health Counseling (Bridge Program) Online": {
    "url": "https://www.niagara.edu/programs/clinical-mental-health-counseling-bridge-program/",
    "overview": "The Advanced Certificate/Bridge program in clinical mental health counseling will satisfy New York State’s regulations for licensure and will prepare students to take the Certified Clinical Mental Health Counselor Examination for licensure in New York state."
  },
  "Communication and Media Studies": {
    "url": "https://www.niagara.edu/programs/communication-and-media-studies/",
    "overview": "Our Communication and Media Studies program examines how the tools of mass media (including writing, design, photography, videography, and technology) are used to influence the world around them. You will see how the media can shape cultural, social, and economic landscapes globally and within our own communities.\n\nStudents in our program will engage with the implications of today’s mass media consumption, as the program emphasizes the importance of language, the primacy of digital communication in the 21st century, and ethical career development. Our CMS curriculum nurtures core skill sets for students, including critical media literacy and professional training in media management and content creation."
  },
  "Computer and Information Sciences": {
    "url": "https://www.niagara.edu/programs/computer-and-information-sciences/",
    "overview": "Our bachelor’s program in Computer and Information Sciences provides a comprehensive foundation in computing principles while offering you a flexible curriculum to tailor your studies to your career interests.\n\nAs you study at Niagara, you’ll become prepared for a wide range of careers in the computing and information technology industry, or advanced study following graduation. Our students have a variety of paths to choose to study as an undergraduate student, including computer hardware, networking, information security, artificial intelligence (AI), data science, and more."
  },
  "Criminology and Criminal Justice": {
    "url": "https://www.niagara.edu/programs/criminology-and-criminal-justice/",
    "overview": "Our Criminology and Criminal Justice program provides a unique educational experience that bridges social scientific theory with current criminal justice policy and practice. This program goes beyond vocational training by blending academic rigor and practical application, preparing you to pursue positions in a wide range of criminal justice-related fields, or enter graduate or law school.\n\nThrough internships, research opportunities, and international experiences, our students gain a comprehensive understanding of criminology and criminal justice systems, positioning them for success in various career paths or advanced studies."
  },
  "Early Childhood and Childhood Education": {
    "url": "https://www.niagara.edu/programs/early-childhood-and-childhood-education/",
    "overview": "Our Early Childhood and Childhood Education program is recommended for people who have a passion teaching younger students in a variety of subjects. As a student in our College of Education, you’ll be encouraged to explore concepts, issues, and problems from multiple perspectives with reflection, collaboration, and analysis of diverse evidence. Through this foundation, you’ll systematically build your knowledge and skill through coursework and field experiences, beginning in your first semester at Niagara.\n\nOnce you successfully complete our program and pass New York state testing requirements, you’ll qualify for initial teacher certification in New York for early childhood and childhood education from birth through grade 6."
  },
  "Early Childhood and Special Education (Birth to Grade 2) Online": {
    "url": "https://www.niagara.edu/programs/early-childhood-and-special-education-birth-to-grade-2/",
    "overview": "Our graduate program in Early Childhood and Special Education is designed for dedicated professionals who want to make a difference in the lives of young children. As a student of the program, you’ll develop the knowledge and skills to meet initial and professional New York state teacher certifications in both early childhood education and students with disabilities from birth to grade 2.\n\nThis Master’s program helps current teachers earn professional certification in New York state, meet the qualifications for promotion or salary increase, or specialization within the field. Our program also creates a pathway for non-teaching professionals who are looking to pivot into education. Our graduates find success as teachers, leaders, or developmental specialists in a variety of early childhood and educational settings."
  },
  "Economics": {
    "url": "https://www.niagara.edu/programs/economics/",
    "overview": "Are you ready to understand the behaviors of individuals and groups through commerce? Our Economics programs will provide you with a comprehensive understanding of the concepts, theories, and analytics tools that determine how markets function.\n\nAs a Niagara University student, you’ll develop crucial skills like critical thinking, quantitative and qualitative data analysis, economic modeling and forecasting, policy analysis and evaluation, and a deep understanding of global economic issues."
  },
  "English": {
    "url": "https://www.niagara.edu/programs/english/",
    "overview": "Engaging in our English program at Niagara University will prepare you to use language-based critical thinking skills and compelling communication as powerful tools in your personal development, future career, and role as an informed citizen in a fast-changing world.\n\nAs a student in the program, you’ll develop and practice these skills by reading, analyzing, and critiquing great literary texts and translations from the United States, the United Kingdom, and other regions to gain a deeper understanding of people and the world around them. Our program will prepare you to persuade through oral dialogue and written text as you continue your development into agile readers, informed educators, and effective communicators."
  },
  "Environmental Science": {
    "url": "https://www.niagara.edu/programs/environmental-science/",
    "overview": "With two degree programs and a focus on hands-on lab and field experiences, our Environmental Science program will challenge you in all the best ways. We have designed our curriculum to prepare you for a variety of careers in this important and rapidly growing field.\n\nOur undergraduate programs will help you identify and solve environmental issues through critical thinking, research, and scientific study. Faculty will personally guide and work alongside you in the classroom, field, and lab, as you learn about alternative energy systems, natural resource management, pollution control and mitigation, the effects of climate change, and more."
  },
  "Family Nurse Practitioner": {
    "url": "https://www.niagara.edu/programs/family-nurse-practitioner/",
    "overview": "Completion Time: 24 Months\nCredits: 49 credits\nClinical Hours: 780\nFlexibility: Full or Part Time\nStart Terms: Fall or Spring\n\nOur Master of Science in Family Nurse Practitioner program will prepare registered nurses with a bachelor’s degree for the advanced practice role of a health care provider. As an FNP, you’ll be able to provide care for patients of all ages, and in a variety of medical settings.\n\nThis two-year program will elevate you into one of the fastest growing occupations: FNP. Courses are only held one day per week to afford you the opportunity to continue working in the field and build your nursing experience while studying for this advanced degree. Our comprehensive education includes clinical practicums where you’ll work one-on-one with a preceptor, the use of simulations, and smaller class sizes for individualized attention."
  },
  "Film Studies (Minor)": {
    "url": "https://www.niagara.edu/programs/film-studies/",
    "overview": "The film studies minor is an interdisciplinary program encompassing courses from across the College of Arts and Sciences, allowing students to acquire a knowledge and appreciation for film within multiple disciplines. Students gain an understanding for the art of cinema and how it is shaped and influenced through various fields of study."
  },
  "Finance": {
    "url": "https://www.niagara.edu/programs/finance/",
    "overview": "Our undergraduate Finance program is meticulously designed to equip you with a comprehensive understanding of the financial principles essential for success in the global economy. We blend theory with hands-on application, allowing you to delve deeply into financial markets, investment strategies, corporate finance, and analysis.\n\nBe assured that our faculty consists of seasoned professionals and scholars with extensive industry experience and academic expertise. You’ll receive personalized instruction with small class sizes and meaningful engagement with faculty. In addition, you’ll have the advantage of on-campus labs to provide you with essential financial data resources."
  },
  "Food Industry Management": {
    "url": "https://www.niagara.edu/programs/food-industry-management/",
    "overview": "The Food Industry Management program prepares students to become leaders in one of the world’s most dynamic and essential industries. This comprehensive undergraduate degree combines rigorous academic coursework with hands-on experiential learning, providing students with the technical expertise, business acumen, and global perspective necessary to excel in food production, marketing, distribution, safety, and innovation.\n\nIn addition to courses in all functional business areas, this interdisciplinary major also includes courses from across the entire University.  The curriculum emphasizes practical application through experiential learning opportunities and offers specialized elective tracks in Manufacturing and Hospitality to align with career interests.\n\nStudents learn about all facets of the food industry in small, interactive classes.  Open-door policies are the norm for NU faculty, so students have quick and easy access to these industry experts to ask questions and solve problems."
  },
  "French": {
    "url": "https://www.niagara.edu/programs/french/",
    "overview": "The French Program at Niagara University focuses on creating globalized citizens who, through studying a language that is spoken on every continent, cultivate new ways to engage with the world. The program progresses from language classes to courses on the history, literature, and art of the French speaking world, culminating in an immersive study-abroad experience.\n\nWith the world becoming more connected and globalized, the need to engage with and truly understand other cultures, and not just translate from one language to the next, is equally on the rise. Studies show that bilingual individuals on average make a higher salary and have more job prospects than their monolingual counterparts. Given that French is spoken on every continent, French majors have the opportunity to put their skills to use in almost any sector and open the doors to a future anywhere in the world.\n\nStudents at Niagara learn French in small classes designed to give them individual attention. Our courses focus on building a strong foundation of proficiency in the language while exposing students to the diverse French-speaking cultures of the world. The classes then progress from language-focused to courses on the history, literature, and art of the French-speaking world, culminating in an immersive study-abroad experience.\n\nThe flexible BA in French gives every student at Niagara University the opportunity to double major, rounding out their marketability and preparing them for any career they decide to pursue. Students can also choose to add on a French minor to any degree."
  },
  "General Studies": {
    "url": "https://www.niagara.edu/programs/general-studies/",
    "overview": "General Studies provides a flexible program of study grounded in Niagara Universities liberal arts curriculum.\n\nIt is intended for students who wish to complete a two year Associate in Arts (A.A) degree, explore major or career options, or continue on to a bachelor’s program.\n\nStudents enrolled in General Studies select from the same courses available to all NU students. The program aims to provide students with an integrated course of study in the liberal arts which introduces students to a specific body of knowledge, stimulates a student’s intellectual curiosity, and encourages future study.\n\nIndividual schedules are tailor made with your advisor to explore your academic and career interests. A general outline of the courses required can be found below.\n\nStudents who wish to pursue a four year degree after finishing their associate degree, can easily continue on at Niagara University for a Bachelor’s degree. As students figure out their interests, the curriculum can be adjusted to assist the transition to a specific major.\n\nStudents who wish to continue to explore an individually designed curriculum can take advantage of the new Bachelor of Arts degree in Liberal Arts and Master of Arts in Interdisciplinary Studies programs."
  },
  "Gerontology": {
    "url": "https://www.niagara.edu/programs/gerontology/",
    "overview": "As society contends with an older population, our Gerontology program will help you understand aging from a multidisciplinary perspective while preparing you for a career with the appropriate knowledge, skills, and values to engage with them.\n\nStudents in every major will benefit from an understanding of the interests, abilities, and needs of older adults. Our academic program also provides opportunities for you to engage with high impact learning, such as research training, internships, and community service placements."
  },
  "History": {
    "url": "https://www.niagara.edu/programs/history/",
    "overview": "History program equips students with the tools of historical thinking, which they can then apply to a broad range of career fields through the department’s extensive internship program."
  },
  "Hotel and Restaurant Management": {
    "url": "https://www.niagara.edu/programs/hotel-and-restaurant-management/",
    "overview": "The hotel and restaurant management degree program at Niagara University prepares students for management careers in the global hospitality industry at premier resorts, hotels, clubs, and foodservice establishments.\nThe core program challenges students to master today’s hospitality management competencies, including strategic management, finance and accounting, marketing, human resources, technology, and first-class service excellence.\n\nNiagara University’s College of Hospitality, Sport, and Tourism Management provides students with ample resources to be successful within their major, including regular academic advisement, career counseling, and networking opportunities with notable alumni and industry leaders.\n\nThe curriculum is based on the core principles of a dynamic business environment with specialized emphasis on the unique technological, managerial, and analytical requirements of managers and executives in the hotel and restaurant industries. Integrated throughout the curriculum is an emphasis on globalization, leadership, and technological advances in hotels and restaurants.\n\nThe program encourages further specialization through the achievement of a single or double concentration in: hotel planning, development, and operations; food and beverage management; and luxury hospitality operations. Niagara’s open curriculum allows future managers to build their own concentrations to best suit their interests and career goals. Students select from coursework around planning, developing, and operating a hotel property; food and beverage management; and luxury hospitality operations."
  },
  "M.A. Interdisciplinary Studies Online & On Campus": {
    "url": "https://www.niagara.edu/programs/master-of-arts-in-interdisciplinary-studies/",
    "overview": "With our Master of Arts in Interdisciplinary Studies program, you can complete your graduate degree with your own academic and career interests in mind, and at your own pace. This personalized program empowers you to design your own curriculum and pick relevant courses from a wide range of Niagara University offerings.\n\nOur Interdisciplinary Studies program also has two specialized focus tracks: Disaster/Emergency Management and National Security, or Social Justice, designed for you to enhance your knowledge while pursuing impactful careers and addressing critical challenges."
  },
  "M.S. Criminal Justice Administration": {
    "url": "https://www.niagara.edu/programs/master-of-science-in-criminal-justice-administration/",
    "overview": "A graduate degree in criminal justice administration prepares you for leadership positions in a wide range of related fields. This robust curriculum helps you anticipate, address, and work toward plausible solutions to problems associated with the criminal justice system and the individuals connected to it.\n\nOur faculty will work with you to deliver a tailored education journey designed for your career goals. You can complete your studies in one year (or at your own pace) with a flexible schedule that includes on-campus, hybrid, and weekend course offerings, as well as a 100% online option. Niagara University collaborates with numerous local, state, and federal agencies and organizations, which can offer you unique research, internship, and other experiential opportunities."
  },
  "M.S. Information Security and Digital Forensics Online (ISDF)": {
    "url": "https://www.niagara.edu/programs/isdf/",
    "overview": "Niagara’s ISDF program equips students to manage and react to cybersecurity threats that have presented challenges across all industries. Students will be trained in brand new, state-of-the-art computer labs, allowing them to gain skills that can be used in professional areas such as computer and mobile forensics, network security, defensive security, and data privacy. The program is appropriate for students of many backgrounds, including computer and information sciences, business, criminal justice, accounting, and healthcare. For those who are interested, this program will provide the knowledge necessary to obtain the Certified Information Systems Security Management Professionals (CISSP) certification.\n\nNiagara University is designated as a National Security Agency Center of Academic Excellence in Cyber Defense. This important recognition underscores the university’s commitment to advancing cybersecurity education, research, and developing the next generation of cybersecurity professionals to protect the United States’ critical national information infrastructure into the future."
  },
  "Management": {
    "url": "https://www.niagara.edu/programs/management/",
    "overview": "Our program in Management is a balanced and flexible choice that allows you to tailor your education to your career aspirations. As a Niagara graduate, you’ll be equipped with the skills and knowledge needed to excel in diverse business environments – from startup organizations to large, multinational corporations – and in a variety of roles.\n\nAt Niagara, you can customize your education and differentiate yourself with your course choices, including specialized instruction in human resources, international management, and more. Whether you envision a career in a large firm, small business, or even launching your own entrepreneurial venture, you’ll be prepared to navigate and lead in a dynamic business world."
  },
  "Marketing": {
    "url": "https://www.niagara.edu/programs/marketing/",
    "overview": "Whether you’re interested in a broad program or specialization like social media or food industry, studying Marketing at Niagara University will provide you an unbeatable advantage in developing your creativity, innovation, and insight into the winning brands of the future. Our courses and active opportunities are designed for your growth and success, charting the flight plan to help you achieve exceptional career growth.\n\nAs a Marketing student at Niagara, you’ll engage with generative AI technologies, predict outcomes using machine learning, create and publish captivating digital content, launch impactful marketing campaigns, and build winning brands. You’ll join a cohort of enthusiastic and engaged students who participate in national competitions, trade shows, study abroad activities, and on-campus clubs like the Niagara University Marketing Association (NUMA)."
  },
  "Marketing Food and Consumer Packaged Goods": {
    "url": "https://www.niagara.edu/programs/marketing-food-and-consumer-packaged-goods/",
    "overview": "Food and Consumer Packaged Goods Marketing concentration prepares students for exciting careers in the global world of food and brand marketing.\n\nThe Food & CPG Marketing concentration is an excellent choice for students who plan to create, develop, and grow the consumer brands of the future. Imagination and creativity are at the heart of this concentration. Students learn how to harness insights that spark new brand innovations, improve the lives of consumers, and influence the global community.\n\nBrand innovations require analytics and inspiration. Therefore, students embrace a highly unique curriculum offered by only a handful of programs. This unique concentration enjoys much support and engagement from industry partners who have formed the Food Industry Center of Excellence to sponsor internships, workshops, and career opportunities.\n\nThe Food & CPG Marketing concentration offers highly specialized courses designed to foster creative thinking and deep knowledge of the field. Faculty include award-winning industry executives who not only teach but also mentor students at industry competitions and trade shows. Unique courses in category management, the global food industry, marketing innovation, and analytics make this concentration unique. Food marketing graduates are highly prized by industry who enjoy the fast track to executive leadership."
  },
  "Master of Business Administration": {
    "url": "https://www.niagara.edu/programs/master-of-business-administration/",
    "overview": "Our Master of Business Administration (MBA) program provides you with rigorous and advanced study for further development as you work towards your current and future business career goals across all industries.\n\nAs an MBA student at Niagara, you’ll combine theory from social and behavioral science with real-world experiences. NU uses a variety of teaching methods, including team projects, experiential learning, and case studies, to enhance the interpersonal skills that are crucial for your professional advancement. Our small classes, led by industry professionals, ensure an optimal learning environment with opportunities for practical application, preparing you for success in the business world."
  },
  "Master of Science in Accounting": {
    "url": "https://www.niagara.edu/programs/master-of-science-in-accounting/",
    "overview": "Our Master of Science in Accounting program provides you with rigorous and advanced study in accounting, taxation and audit, and assurance practice to enhance your foundational knowledge in the field. Our curriculum covers essential topics to develop an advanced understanding of accounting practices so you’ll have the knowledge needed to fulfill the educational requirements for CPA licensure.\n\nOur graduate program offers you scheduling flexibility, with evening and online classes for full- and part-time students, to accommodate working professionals. You’ll also benefit from networking opportunities with industry professionals through seminars, workshops, and internships, that can enhance career prospects. Our Career Center team will also support you with opportunities for job placements and internships to aid your transition into the workforce."
  },
  "Master of Science in Elementary and Secondary Education Online": {
    "url": "https://www.niagara.edu/programs/graduate-teacher-education/",
    "overview": "Niagara University’s M.S.Ed in Elementary and Secondary Education program is designed for candidates who wish to become certified teachers in New York state. For international students (including those in Canada) the M.S.Ed in Elementary and Secondary Education program may meet certain requirements for certification in other jurisdictions. This online, CAEP accredited program consists of 39-credit hours that lead to certification in either The M.S. Ed. in Elementary or M.S. Ed. Secondary Education"
  },
  "Master of Science in Finance": {
    "url": "https://www.niagara.edu/programs/master-of-science-in-finance/",
    "overview": "Entering our Master of Science in Finance (MSF) program will equip you with the essential skills and knowledge necessary for advancement in diverse finance careers. By combining academic theory with real-world practice, you’ll be prepared to graduate and thrive in today’s financial environment.\n\nOur program covers a wide range of topics in the field, including investment analysis, corporate finance, quantitative finance, and risk management. We foster strong analytical, communication, and leadership skill development through real-world applications and case studies. You’ll be invited to multiple networking opportunities with industry professionals to further enrich your experience, while providing valuable connections for future employment."
  },
  "Master of Science in Literacy and English Language Learners Online": {
    "url": "https://www.niagara.edu/programs/literacy-and-english-language-learners/",
    "overview": "Literacy and English language learners program prepares individuals with initial certification to provide appropriate literacy assessments, interventions, and supports for all learners with a special focus on English language learners.\n\nChildren and adolescents, including English language learners, who do not meet literacy benchmarks are placed at a significant disadvantage both in school and in their later adult lives.\n\nAs well, candidates will acquire awareness and understanding of the social-cultural and socio-linguistic issues that impact the acquisition of English as an additional language. The program includes the most current theory and practice, and the program leads to New York state initial certification as literacy specialists birth to grade 12 and as ESOL teachers birth to grade 12.\n\nCandidates must hold a teacher certification in another area prior to admission that includes at least six credit hours of literacy coursework in literacy skills and methods, and three credit hours of coursework in teaching students with disabilities."
  },
  "Master of Science in School Psychology": {
    "url": "https://www.niagara.edu/programs/school-psychology/",
    "overview": "School Psychology with CAS program prepares you for a career in a field where the demand is exceptionally strong and on the rise. The program’s alumni boast a 100 percent employment rate after graduation.\n\nNiagara University’s master’s degree program in school psychology is founded on a commitment to developing practitioners and leaders in the field of school psychology who, in the Vincentian tradition, seek to individually and systematically foster human growth and development, spirituality, well-being, and emotional stability within culturally diverse contexts.\n\nStudents are mentored by highly credentialed faculty in small class sizes that facilitate individualized attention and often lead to research and conference participation.\n\nGraduates demonstrate qualities of outstanding reflective practitioners, such as the dispositions of caring and respect, open-mindedness, and a commitment to equity and social justice.\n\nCompletion of this 63 credit-hour graduate program provides candidates with an M.S. and advanced certification in school psychology. Graduates are eligible for provisional certification as a school psychologist by New York state and qualified to apply for national certification (NCSP). Candidates will demonstrate the knowledge, skills, and dispositions consistent with the training and ethical standards as set forth by the National Association of School Psychologists (NASP).\n\nApplications will be reviewed starting in February and interviews will be conducted shortly after. Please have all application materials submitted in order to complete the application in time."
  },
  "Master of Science in Special Education Online": {
    "url": "https://www.niagara.edu/programs/special-education-online/",
    "overview": "Special Education Online program emphasizes knowledge of the foundations of special education, characteristics of learners, assessment, as well as instructional methods, accommodations and modifications for students within various special education programs.\n\nThe overall goal of the program is to provide teachers with the knowledge of instructional principles and practices for teaching students with disabilities and to offer the opportunity to pursue a master of science in education degree. Special educators in today’s world are dedicated professionals who want to make a difference in the lives of children with disabilities. They are committed to the field of special education. They appreciate and embrace the diverse range of students’ needs. They remain lifelong learners as they seek out and implement validated practices supported by research in the field. They are able to work effectively within a variety of settings, situations and personalities.\n\nSpecial education teachers are able to assess and evaluate student progress, make appropriate accommodations and deliver individualized instruction that is based upon each student’s individual educational program. Finally, special educators are constant agents of positive change in a demanding yet exciting field.\n\nAdditionally, Niagara’s special education programs are housed in a College of Education that was one of the first in New York state to obtain national accreditation through CAEP, and has maintained this national accreditation continuously since 1984.\n\nOur special education master’s program is now offered in a 100% online format for busy teachers who find it difficult to commute to campus, but who would like to have the opportunity to engage in professional development in a graduate program."
  },
  "Master of Science in Sports Management": {
    "url": "https://www.niagara.edu/programs/master-of-science-in-sports-management/",
    "overview": "The master of science in sport management degree is a focused, yet flexible, 36-credit hour graduate program designed to meet the needs of today’s graduate student, while developing skilled professionals for the sport industry.\n\nThe program is structured to offer small class sizes, a flexible format for content delivery and interaction with industry professionals and full-time faculty. Offering an internship or a thesis track, students may select the format that best fits their abilities and accommodates their future interests in sport. The rigorous curriculum and experiential learning requirements are specifically designed to provide students with the skills necessary to be successful in a broad range of sport industry opportunities, or to move on to further study if they desire.\n\nThe Niagara University sport management program has a long history of providing outstanding experiential opportunities for its students. The program has an established network of industry relationships that will assist students in finding the right opportunities for them. Examples include the NFL Experience and the Super Bowl, MLB Spring Training, various NCAA championship events and professional and college sport organizations in Western New York and around the country. Not only will students have contact both in and out of the classroom with sport industry leaders, but the six-hour internship option in the program will allow students to maximize the benefit such experiences can provide.\n\nNiagara University is home to an NCAA Division I athletic program, providing valuable on-campus opportunities for students in college athletics administration. Additionally, through the College of Hospitality and Tourism Management, the program has established partnerships with a variety of sport facility and event managers throughout the United States. Finally, students with an interest in recreational sport will be able to find opportunities with local government and not-for-profit agencies as well."
  },
  "Master of Science in Theatre Education Online": {
    "url": "https://www.niagara.edu/programs/master-of-science-in-theatre-education/",
    "overview": "Our Master of Science in Theatre Education program is designed for individuals who have completed extensive study in the field of theater and are not currently certified to teach. Once you graduate from Niagara, you’ll be prepared to teach the next generations of actors by expanding knowledge in the principles of teaching theater and practices of applied drama.\n\nThis is a three-semester program for full-time students. Students who start in the summer semester can finish their degree in one calendar year, with part-time schedules also available to accommodate your schedule. Graduation will lead to initial certification in New York state for teaching theater in grades Pre-K through 12."
  },
  "Mathematics": {
    "url": "https://www.niagara.edu/programs/mathematics/",
    "overview": "Our academic program offers you a deeper understanding of pure and applied mathematics through individualized instruction, one of the benefits of our small classes. This bachelor’s degree will help you develop and hone new problem-solving skills, intellectual thought, and logic.\n\nWe offer flexibility within the program: study for a rigorous bachelor of science degree for students looking toward graduate studies in applied math, or balance our bachelor of arts degree in math with another major."
  },
  "Middle Childhood and Adolescence Education": {
    "url": "https://www.niagara.edu/programs/middle-childhood-and-adolescence-education/",
    "overview": "Our Middle Childhood and Adolescence Education program is recommended for people who have a passion teaching a specific subject to middle and high school students in grades 5-12. As a student in our College of Education, you’ll be encouraged to explore concepts, issues, and problems from multiple perspectives with reflection, collaboration, and analysis of diverse evidence. Through this foundation, you’ll systematically build your knowledge and skill through coursework and field experiences, beginning in your first semester at Niagara.\n\nOnce you successfully complete our program and pass New York state testing requirements, you’ll qualify for initial teacher certification in New York for middle childhood and adolescence education in your specific subject, including Biology, Business and Marketing, Chemistry, English, Mathematics, Spanish, French, and Social Studies."
  },
  "Modern and Classical Languages": {
    "url": "https://www.niagara.edu/programs/modern-and-classical-languages/",
    "overview": "Modern and Classical Languages program enriches your personal life, expands the range of professional opportunities open to you and increases your power to act as a citizen of the world.\n\nThrough its courses in language, literature and civilization, the department of modern and classical languages seeks to develop in all interested students an awareness and appreciation of both Western and non-Western cultures as well as the ability to communicate effectively in the language of their choice. The degree of proficiency sought and the skills to be attained are dependent on the career goals of the individual student. Individualized instruction, plus the opportunity to study abroad, permit qualified students to attain a degree of proficiency while preparing for careers in education, the humanities, science, government, law, business, nursing, interpretation/translation, tourism, hotel and restaurant administration or social welfare.\n\nAt the college level, you can begin a new language or build on your knowledge of a language that you have already studied.\n\nNiagara University offers major degree programs in French and Spanish, and an interdisciplinary major in Romance Languages. There are minor programs in American Sign Language / Deaf Studies, Italian Studies and Latin American Studies, as well as language and culture courses in Chinese, Japanese, Latin, Arabic, and Classical Greek.\n\nNot all courses in the language department are taught in a foreign language. We offer a number of courses in English, on the culture and literature of China, Japan, France, Spain, Italy, Latin America and the Arabic World, which do not require any previous study of a foreign language."
  },
  "Nursing": {
    "url": "https://www.niagara.edu/programs/nursing/",
    "overview": "Completion Time: 4 Years\nCredits: 120\n\nOur four-year degree in nursing prepares you for a career in healthcare with a focus on the science and fundamentals of nursing practice. Through classroom, laboratory, clinical, and simulated training, you’ll be equipped with the skills needed to think critically and provide sound clinical judgments to deliver comprehensive care to individuals, families, and communities as an entry-level clinician.\n\nAs a nursing student at Niagara, you’ll engage in a program that blends the general education core with prerequisite science classes to establish a solid foundation for your success. As you advance your studies in the discipline, you’ll enhance your personal resilience and wellness while emphasizing key components of effective health care delivery."
  },
  "Nursing RPN to BS": {
    "url": "https://www.niagara.edu/programs/rpn-nursing/",
    "overview": "Format: In-person with several online classes offered\nStart Terms: Fall or Spring\nCourse Schedule: Full or Part-Time available\n\nIf you have earned your registered practical nurse (RPN) licensure, we have created a unique pathway for Canadians that builds on your previous educational experience and clinical practice skills toward a bachelor of science in nursing.\n\nAs a NU student, you’ll learn to navigate plans of care and teaching strategies for individuals across their lifespan, as well as become eligible and well-prepared to sit for the NCLEX-RN licensure examination."
  },
  "Ph.D. in Leadership and Policy Online": {
    "url": "https://www.niagara.edu/programs/phd-in-leadership-and-policy/",
    "overview": "The Ph.D. in Leadership and Policy program focuses on bringing social justice and empowerment of those in need to the forefront of research, and provides a course of study in which professionals from various disciplines become change agents. This program is designed to enhance the research and policy leadership acumen of practicing professionals who are already established in their respective career paths. It prepares them for an enriching life of research and scholarship.\n\nDrawing on extensive research experience and real-world understanding and practice, our faculty prepares students to be thoughtful and effective agents of change in leadership and policy positions. As a result of their work at Niagara in generating new knowledge that positions them to make a significant impact on organizations and individuals at the local, national and international levels, our Ph.D. graduates are prepared to engage in meaningful careers in the public, private, and nonprofit sectors.\n\nThe Ph.D. program requires 60 credit hours beyond a master’s degree, with at least 48 of those credit hours completed at Niagara University. The programs two main components are 30 credits of leadership and policy core study and 30 credits of research core study.\n\nThere are 21 required credits (seven courses) in the leadership and policy study core of the Doctor of Philosophy program. Students, in consultation with their advisor, are able to select nine additional credit hours (three courses) in a concentration area within the field of leadership and policy. All candidates for the Ph.D. complete required courses as cohort members and have the opportunity to work individually toward their dissertation topic."
  },
  "Philosophy": {
    "url": "https://www.niagara.edu/programs/philosophy/",
    "overview": "Philosophy is the cornerstone of a liberal arts education.\n\nIt asks and searches for answers to some of the deepest, most personal questions that we all as human beings have had, such as:\n\nPhilosophy judges answers to these questions based on whether they can be rationally defended. Philosophy thus focuses almost entirely on assessing reasons, which is the keystone for critical thinking. Students who have had a firm grounding in philosophy are ready to enter the world as rational, freethinking, and critically reflective citizens and human beings."
  },
  "Political Science": {
    "url": "https://www.niagara.edu/programs/political-science/",
    "overview": "Political science is dedicated to developing student understanding of the institutions of government and the formulation and implementation of domestic and foreign policy.\n\nOur approach prepares students to think independently, appreciate alternative perspectives, and critically analyze current events. We seek to nurture student appreciation of law and legal reasoning, other cultures and political systems, and the role of the United States in the world community. We are dedicated to the development of the whole student, one who is culturally sensitive and able to apply qualitative and quantitative methodologies to political, economic, social, cultural, gender-based, and legal questions. We encourage students to consider the ethical implications of policies and governmental actions, and to become active citizens at both the local and global levels.\n\nThe breadth and diversity of political science makes it a discipline well suited for answering the major issues challenging the world of the 21st century."
  },
  "Pre-Health Professions": {
    "url": "https://www.niagara.edu/programs/pre-health-professions/",
    "overview": "Pre-health professions advisement program designed to help you make the best decision you can about your future in healthcare.\n\nThese are exciting and challenging times for you to become a healthcare professional.\n\nWhile some students begin college knowing what health profession they will pursue, some students change their mind several times. For still others the idea of choosing a profession seems far off. The Pre Health Advisement program at Niagara University offers you a structured program designed to help you think systematically about your options.\n\nAs you progress through the program, you will gain the tools to make an informed decision, based on guided self-reflection and the information you will gather about the many career options available to you.\n\nYou will explore the variety of health care specialties as well as the other career options available to you in the health professions. As you meet and talk with health care professionals in various specialties, you will begin to learn about what professionals do in these areas, gaining a real-world perspective on their specialties."
  },
  "Pre-Law": {
    "url": "https://www.niagara.edu/programs/pre-law/",
    "overview": "Pre-law program helps you navigate the admission process for law school, explore a range of legal careers, and guide you through course selection to ensure you build the skills and competencies required of competitive law school applicants.\n\nNiagara University’s Pre-Law Advisement program prepares students interested in law to achieve their academic and professional goals at the highest levels. Open to students from all majors and classes, Niagara’s Pre-Law Advisement program is designed to help students successfully navigate the path to law school and legal careers. The program’s central goal is to ensure that each Niagara Pre-Law student gains the knowledge, skills, and practical experience needed to excel in law school and beyond.\n\nStarting their first semester on campus, Niagara Pre-Law students have countless opportunities to learn about the various fields of law through courses, internships, moot court competitions, law school visits, academic research, and discussions with the Pre-Law Advisor and other legal practitioners.\n\nFor students who continue on the law school track, the Pre-Law Advisor serves as a resource and guide through every step of the process — from maximizing your score on the LSAT, to writing effective law school admissions essays, and, eventually, weighing competing offers from top law schools."
  },
  "Psychology": {
    "url": "https://www.niagara.edu/programs/psychology/",
    "overview": "The Psychology program is focused on preparing students for graduate school, professional school, or the work force.\n\nPsychology is a science, an academic discipline, and a time-honored profession. These qualities endow the field of psychology with a unique, multifaceted nature. As scientists, our concern is the careful and systematic observation of behavior and the collection, analysis and interpretation of empirical data. As academics, we deal in the realm of theoretical interpretations and ethical controversies. As professionals, we are dedicated to improving the lives and preserving the dignity of our fellow men and women.\n\nUpon graduation, our students are prepared for diverse careers involving the application of principles of human behavior to the betterment of humankind. Students are provided ample opportunities to become involved in faculty research and to gain hands on experience through a variety of practicum or co-op placements.\n\nPsychology students have a number of unique opportunities that enhance their academic experience"
  },
  "Religious Studies": {
    "url": "https://www.niagara.edu/programs/religious-studies/",
    "overview": "Our Religious Studies academic program explores the nature of religion and its impact on history, culture, and society. This is a unique offering, grounded in the Catholic Vincentian tradition of Niagara University, that will give you crucial insight into understanding the world and society, whether you are personally religious or not.\n\nWithin the global religious landscape, we focus on the great monotheistic traditions of Judaism, Christianity, and Islam, and how it is practiced through ritual, belief, art, and more. You’ll receive personalized instruction from the faculty and participate in research and activities alongside them, including Study Abroad trips to Rome, Italy."
  },
  "RN to BS Completion Program": {
    "url": "https://www.niagara.edu/programs/rn-to-bs-completion-program/",
    "overview": "The RN to BS completion program is an online option for licensed registered nurses who wish to advance their knowledge and skills while enhancing career-advancing opportunities.  The program builds on existing knowledge and experience, equipping nurses with the leadership skills needed to enhance the quality of care, patient safety, and health services in a continuously evolving healthcare system.\n\nProgram details:"
  },
  "Social Media, Digital Marketing, and Artificial Intelligence": {
    "url": "https://www.niagara.edu/programs/marketing-social-media-digital-marketing-and-artificial-intelligence/",
    "overview": "The focus of the Social Media, Digital Marketing, and Artificial Intelligence concentration is content marketing excellence through courses in social media, digital marketing, and digital analytics.\n\nExperts in Social Media, Digital Marketing, and Artificial Intelligence enjoy leadership positions in virtually all industries including advertising, public relations, fashion, high-tech, manufacturing, consumer products, finance, industrial, and entrepreneurial startups.\n\nThe use of digital advertising now comprises over 72% of total advertising expenditures for many businesses (eMarketer, 2022). In the past, firms used social and digital channels to enhance traditional marketing programs, today the most successful firms are focusing on social media and digital as the primary marketing channels. Brand value is increasingly delivered through creative content marketing programs, initiated by both consumers and companies.\n\nStudents become experts in the latest theory and best practices of envisioning, creating, deploying, and measuring the impact of content in social media and digital channels. The goal of this concentration is to prepare students for rewarding and exciting careers across the spectrum of opportunities in the social and digital space.\n\nWe are living in the content creation economy. Digital content, in all forms, has the power to attract, engage, sustain, and propel brands to market leadership. Students learn how to create, distribute, measure, and grow engagement with content to achieve organizational goals. In so doing, students create a rich, deep, and creative content portfolio that will serve as proof of exceptional abilities upon graduation, thereby leading to a distinct advantage in career development."
  },
  "Social Work": {
    "url": "https://www.niagara.edu/programs/social-work/",
    "overview": "Our Social Work program combines hands-on learning with commitment to social justice, preparing you to work impactful careers with integrity in diverse fields. Accredited by the Council on Social Work Education (CSWE), we equip you with the skills to address the needs of individuals, families, and communities.\n\nBy studying a curriculum rooted in empowerment, experiential learning, and service, you’ll gain practical skills and broad knowledge through coursework, internships, and research opportunities. Our graduates continue into diverse career pathways as they help individuals and families face challenges as social workers, government liaisons, policy analysts, community activists, international relief groups, or further study in graduate school."
  },
  "Sociology": {
    "url": "https://www.niagara.edu/programs/sociology/",
    "overview": "Studying Sociology at Niagara will provide you with the opportunity to study closely under faculty while acquiring the skills and experience you need to graduate into a successful career. You can major or minor in Sociology at NU, or pursue a minor in Inequality, Race, and Justice.\n\nOur program introduces you into a broader understanding of sociology, which is foundational to the social sciences and immensely practical in a changing world, and helps you see the interconnections that shape our lives. We will prepare you for any path you choose to pursue, whether you want to utilize your skills in law or business, conduct research, enter non-profit and community work, or go onto graduate school. We aim to hone the skills you’ll need to suit your interests"
  },
  "Spanish": {
    "url": "https://www.niagara.edu/programs/spanish/",
    "overview": "The Spanish program at Niagara University focuses on developing linguistic fluency while building global awareness, cultural understanding, and analytical thinking. This versatile major gives students the skills to communicate effectively with those around them, expanding their personal and professional horizons and empowering them to engage with Hispanic communities.\n\nStudying Spanish at Niagara University gives students the opportunity to learn, practice, and refine their use of the Spanish language. Our small class sizes ensure individualized attention, provide ample opportunity for the development of essential speaking and comprehension skills, and build a strong sense of community. The Spanish major is also flexible enough to combine with other academic programs and study abroad. Students graduate with a high level of proficiency, a greater understanding of the world around them, and the confidence they need to use their language skills professionally.\n\nOutside of the classroom, we offer a variety of activities that allow students to engage first-hand with Hispanic cultures while building lasting friendships. Informal conversation hours, film nights, guest speakers, and live music all help bring the language to life."
  },
  "Special Education": {
    "url": "https://www.niagara.edu/programs/special-education/",
    "overview": "Our Special Education program is recommended for people who have a passion for teaching students with learning differences. As a student in our College of Education, you’ll be encouraged to explore concepts, issues, and problems from multiple perspectives with reflection, collaboration, and analysis of diverse evidence. Through this foundation, you’ll systematically build your knowledge and skill through coursework and field experiences, beginning in your first semester at Niagara.\n\nOnce you successfully complete our program and pass New York state testing requirements, you’ll qualify for initial teacher certification in New York for students with disabilities."
  },
  "Special Education Advanced Certificate Online": {
    "url": "https://www.niagara.edu/programs/special-education-advanced-certificate-online/",
    "overview": "Special Education Advanced Certificate Online program may qualify candidates for special education certification in all grades provided all other New York State certification requirements are met.\n\nSpecial educators in today’s world are dedicated professionals who want to make a difference in the lives of children with disabilities. They are committed to the field of special education. They appreciate and embrace the diverse range of students’ needs. They remain lifelong learners as they seek out and implement validated practices supported by research in the field. They are able to work effectively within a variety of settings, situations and personalities.\n\nSpecial education teachers are able to assess and evaluate student progress; make appropriate accommodations and deliver individualized instruction that is based upon each student’s individual educational program. Finally, special educators are constant agents of positive change in a demanding yet exciting field."
  },
  "Sport and Recreation Management": {
    "url": "https://www.niagara.edu/programs/sport-and-recreation-management/",
    "overview": "Our Sport and Recreation Management program prepares you for leadership positions in the many sectors of this exciting and evolving industry. Our curriculum blends courses in sport management with broader-based business studies while emphasizing the skills needed to succeed upon entering the profession.\n\nAs a NU student, you’ll gain insight into the issues and challenges facing professional teams, collegiate athletics, youth sports, adult recreation, and the overall health and fitness economy. Our program will prepare you to address these current issues while gaining the tools to help develop solutions through policy and governance, sport law, sport marketing and promotions, and event and facility management."
  },
  "Supply Chain Management": {
    "url": "https://www.niagara.edu/programs/supply-chain-management/",
    "overview": "Are you ready to soar into the lifeblood of business? Our Supply Chain Management program will prepare you for success on day one into a well-paid and fast-growing profession. You’ll study under engaged faculty as you learn more about this dynamic field that keeps products and services moving across the world on schedule in industries such as automotive, e-commerce, healthcare, food, and retail.\n\nAs a student in Supply Chain Management, you’ll actively participate in our small class sizes with interactive discussions and personalized learning. This program will develop the confidence you need to succeed in unique ways by solving problems, working with others, engaging with technology and data, and more."
  },
  "Teaching English to Speakers of Other Languages": {
    "url": "https://www.niagara.edu/programs/teaching-english-to-speakers-of-other-languages/",
    "overview": "Becoming an English as a Second Language (ESL) teacher will provide you with unique multicultural opportunities in a growing field around the world and in our local schools. As a student in our Teaching English to Speakers of Other Languages (TESOL) program, you’ll be encouraged to explore theories, strategies, and methodologies in teaching English language learners, facilitate the process for them, and navigate the journey of education within the global context of our communities.\n\nOnce you successfully complete our program and pass New York state testing requirements, you’ll qualify for initial teacher certification in New York to teach English to speakers of other languages at any grade level."
  },
  "Theatre Studies and Fine Arts": {
    "url": "https://www.niagara.edu/programs/theatre-studies-and-fine-arts/",
    "overview": "As one of the oldest professional theatre training programs in the region, we are well-known for preparing you for careers that can take you anywhere from Broadway to Hollywood. Our unique curriculum fuses a conservatory approach to theatre training with a liberal arts education. You’ll engage with an intense schedule and disciplined focus on academic coursework and practical production experience.\n\nSince 1964, our NU Theatre department has proudly educated and entertained audiences through a variety of annual productions, giving you an artistic playground for growth and development and a passion for performance. Personalized mentorship with theatre faculty will help you find your confidence, both on- and off-stage, through every step of our experiential learning process."
  },
  "Tourism and Event Management": {
    "url": "https://www.niagara.edu/programs/tourism-and-event-management/",
    "overview": "The tourism and event management program at Niagara University prepares students for management careers in the global hospitality industry at premier resorts, hotels, clubs, and food service establishments. The curriculum emphasizes globalization, leadership, and technological advances in hotels and restaurants."
  },
  "Women’s Studies (Minor)": {
    "url": "https://www.niagara.edu/programs/womens-studies/",
    "overview": "Women’s studies creates an interdisciplinary framework for analyzing the historical, economic, political, social and cultural experiences of women.\n\nWomen’s studies courses strengthen critical inquiry as students learn to think and read through the lens of women’s experiences and lives. Women’s studies courses are premised on the assumption that sexism exits in North America, as well as in most places in the world, and has a profound impact on women’s lives. Students examine gender as a social construct which is essential to understanding power relations, social customs, and institutions.\n\nVirtually all graduate programs and professions require a consideration of gender issues. A background in women’s studies is thus useful for further academic studies. It also prepares students for a variety of occupations, such as law, criminal justice, business, social welfare, healthcare, counseling, human resources, economic development, education, journalism, literature, the arts, and community organizing at the local, national or international levels. Look here for a list of the things you can do with a minor in women’s studies!\n\nThe minor in women’s studies requires the completion of WMS 200 and four electives. With the permission of the women’s studies coordinator, another course on a women’s related issue or internship or co-op may be substituted for one of the required courses. Other courses include those that address women’s studies issues such as gender, race, class, etc."
  }
}